
local MainStorage = game:GetService('MainStorage')
local gg                = require(MainStorage.code.common.MGlobal)    ---@type gg

--- 动画配置文件
---@class AnimationConfig
local AnimationConfig = {}
local loaded = false

local function LoadConfig()
    AnimationConfig.config ={
    ["僵尸"] = {
        ["初始状态"] = "idle",
        ["状态"] = {
            ["idle"] = {
                ["播放模式"] = "循环",
                ["切换"] = {
                    ["attack"] = {
                        ["混合时间"] = 0.4,
                        ["时机"] = "攻击时",
                        ["已播放完成"] = false,
                        ["移动中"] = false,
                        ["静止中"] = false,
                        ["跳跃中"] = false
                    },
                    ["walk"] = {
                        ["混合时间"] = 0.4,
                        ["时机"] = "无",
                        ["已播放完成"] = false,
                        ["移动中"] = true,
                        ["静止中"] = false,
                        ["跳跃中"] = false
                    }
                }
            },
            ["attack"] = {
                ["播放模式"] = "单次",
                ["动画持续时间"] = 1,
                ["切换"] = {
                    ["idle"] = {
                        ["混合时间"] = 0.3,
                        ["时机"] = "无",
                        ["已播放完成"] = true,
                        ["移动中"] = false,
                        ["静止中"] = true,
                        ["跳跃中"] = false
                    },
                    ["walk"] = {
                        ["混合时间"] = 0.3,
                        ["时机"] = "无",
                        ["已播放完成"] = true,
                        ["移动中"] = true,
                        ["静止中"] = false,
                        ["跳跃中"] = false
                    }
                }
            },
            ["walk"] = {
                ["播放模式"] = "循环",
                ["切换"] = {
                    ["idle"] = {
                        ["混合时间"] = 0.4,
                        ["时机"] = "无",
                        ["已播放完成"] = false,
                        ["移动中"] = false,
                        ["静止中"] = true,
                        ["跳跃中"] = false
                    },
                    ["attack"] = {
                        ["混合时间"] = 0.4,
                        ["时机"] = "攻击时",
                        ["已播放完成"] = false,
                        ["移动中"] = false,
                        ["静止中"] = false,
                        ["跳跃中"] = false
                    }
                }
            }
        }
    },
    ["卡包"] = {
        ["初始状态"] = "born",
        ["状态"] = {
            ["born"] = {
                ["播放模式"] = "停留在最后",
                ["动画持续时间"] = 0,
                ["切换"] = {
                    ["idle"] = {
                        ["混合时间"] = 0.3,
                        ["时机"] = "无",
                        ["已播放完成"] = true,
                        ["移动中"] = false,
                        ["静止中"] = false,
                        ["跳跃中"] = false
                    }
                }
            },
            ["idle"] = {
                ["播放模式"] = "循环"
            },
            ["chu_0"] = {
                ["播放特效"] = {
                    {
                        ["_type"] = "ParticleGraphic",
                        ["特效对象"] = "特效/击中/爆炸_紫红色",
                        ["特效资产"] = "",
                        ["绑定实体"] = false,
                        ["绑定挂点"] = "",
                        ["偏移"] = {
                            0,
                            0,
                            0
                        },
                        ["目标"] = "自己",
                        ["目标场景名"] = "",
                        ["延迟"] = 0.8,
                        ["持续时间"] = 1,
                        ["重复次数"] = 1,
                        ["重复延迟"] = 0
                    }
                },
                ["播放模式"] = "停留在最后",
                ["动画持续时间"] = 0
            },
            ["chu_1"] = {
                ["播放特效"] = {
                    {
                        ["_type"] = "ParticleGraphic",
                        ["特效对象"] = "特效/击中/爆炸_紫红色",
                        ["特效资产"] = "",
                        ["绑定实体"] = false,
                        ["绑定挂点"] = "",
                        ["偏移"] = {
                            0,
                            0,
                            0
                        },
                        ["目标"] = "自己",
                        ["目标场景名"] = "",
                        ["延迟"] = 1.5,
                        ["持续时间"] = 1,
                        ["重复次数"] = 1,
                        ["重复延迟"] = 0
                    }
                },
                ["播放模式"] = "停留在最后",
                ["动画持续时间"] = 0
            },
            ["chu_2"] = {
                ["播放特效"] = {
                    {
                        ["_type"] = "ParticleGraphic",
                        ["特效对象"] = "特效/击中/爆炸_紫红色",
                        ["特效资产"] = "",
                        ["绑定实体"] = false,
                        ["绑定挂点"] = "",
                        ["偏移"] = {
                            0,
                            0,
                            0
                        },
                        ["目标"] = "自己",
                        ["目标场景名"] = "",
                        ["延迟"] = 2,
                        ["持续时间"] = 1,
                        ["重复次数"] = 1,
                        ["重复延迟"] = 0
                    }
                },
                ["播放模式"] = "单次",
                ["动画持续时间"] = 0
            },
            ["kai_0"] = {
                ["播放模式"] = "循环"
            },
            ["kai_1"] = {
                ["播放模式"] = "单次",
                ["动画持续时间"] = 0
            }
        }
    },
    ["卡片"] = {
        ["初始状态"] = "idle",
        ["状态"] = {
            ["idle"] = {
                ["播放模式"] = "循环",
                ["切换"] = {
                    ["attack"] = {
                        ["混合时间"] = 0.4,
                        ["时机"] = "攻击时",
                        ["已播放完成"] = false,
                        ["移动中"] = false,
                        ["静止中"] = false,
                        ["跳跃中"] = false
                    },
                    ["walk"] = {
                        ["混合时间"] = 0.4,
                        ["时机"] = "无",
                        ["已播放完成"] = false,
                        ["移动中"] = true,
                        ["静止中"] = false,
                        ["跳跃中"] = false
                    }
                }
            },
            ["attack"] = {
                ["播放模式"] = "单次",
                ["动画持续时间"] = 1,
                ["切换"] = {
                    ["idle"] = {
                        ["混合时间"] = 0,
                        ["时机"] = "无",
                        ["已播放完成"] = true,
                        ["移动中"] = false,
                        ["静止中"] = true,
                        ["跳跃中"] = false
                    },
                    ["walk"] = {
                        ["混合时间"] = 0,
                        ["时机"] = "无",
                        ["已播放完成"] = true,
                        ["移动中"] = true,
                        ["静止中"] = false,
                        ["跳跃中"] = false
                    }
                }
            },
            ["walk"] = {
                ["播放模式"] = "循环",
                ["切换"] = {
                    ["idle"] = {
                        ["混合时间"] = 0.4,
                        ["时机"] = "无",
                        ["已播放完成"] = false,
                        ["移动中"] = false,
                        ["静止中"] = true,
                        ["跳跃中"] = false
                    },
                    ["attack"] = {
                        ["混合时间"] = 0.4,
                        ["时机"] = "攻击时",
                        ["已播放完成"] = false,
                        ["移动中"] = false,
                        ["静止中"] = false,
                        ["跳跃中"] = false
                    }
                }
            }
        }
    },
    ["植物"] = {
        ["初始状态"] = "idle",
        ["状态"] = {
            ["idle"] = {
                ["播放模式"] = "循环",
                ["切换"] = {
                    ["attack"] = {
                        ["混合时间"] = 0.1,
                        ["时机"] = "攻击时",
                        ["已播放完成"] = false,
                        ["移动中"] = false,
                        ["静止中"] = false,
                        ["跳跃中"] = false
                    }
                }
            },
            ["attack"] = {
                ["播放模式"] = "单次",
                ["动画持续时间"] = 0.5,
                ["切换"] = {
                    ["idle"] = {
                        ["混合时间"] = 0,
                        ["时机"] = "无",
                        ["已播放完成"] = true,
                        ["移动中"] = false,
                        ["静止中"] = false,
                        ["跳跃中"] = false
                    }
                }
            }
        }
    }
}loaded = true
end

---@return Animation
function AnimationConfig.Get(name)
    if not loaded then
        LoadConfig()
    end
    return AnimationConfig.config[name]
end

---@return Animation[]
function AnimationConfig.GetAll()
    if not loaded then
        LoadConfig()
    end
    return AnimationConfig.config
end
return AnimationConfig
