local MainStorage = game:GetService('MainStorage')
local gg                = require(MainStorage.code.common.MGlobal)    ---@type gg
local Modifiers = require(MainStorage.code.common.config_type.modifier.Modifiers) ---@type Modifiers
    
---@class LevelConfig
local LevelConfig = {}
local loaded = false

local function LoadConfig()
    local LevelType = require(MainStorage.code.common.config_type.LevelType) ---@type LevelType
    LevelConfig.config ={
    ["新手关"] = LevelType.New({
        ["关卡ID"] = "新手关",
        ["前置关卡"] = nil,
        ["关卡波次"] = {
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = "呆滞僵尸",
                                ["比重"] = 50
                            }
                        },
                        ["持续时间"] = 1,
                        ["数量"] = 1,
                        ["最大数量"] = 1,
                        ["开始时间"] = 0
                    }
                },
                ["属性倍率"] = 1,
                ["开始时执行指令"] = {
                    [[focusOn {"聚焦UI":{"聚焦UI":[{"UI名":"BattleHud","控件路径":"UIImage","提示文本":"不好！僵尸入侵了你的房子","可点击任意位置":true},{"UI名":"BattleHud","控件路径":"开火","提示文本":"点击这里，向僵尸开炮！","可点击任意位置":true,"若是PC端则改为":{"UI名":"BattleHud","控件路径":"UIImage","提示文本":"点击鼠标左键，向僵尸开炮！","可点击任意位置":true}}],"完成时执行指令":[]}}]]
                },
                ["怪物等级"] = {
                    0,
                    0
                }
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = "呆滞僵尸",
                                ["比重"] = 50
                            }
                        },
                        ["持续时间"] = 1,
                        ["数量"] = 3,
                        ["最大数量"] = 3,
                        ["开始时间"] = 0
                    }
                },
                ["属性倍率"] = 1,
                ["开始时执行指令"] = {
                    [[focusOn {"聚焦UI":{"聚焦UI":[{"UI名":"BattleHud","控件路径":"开火","提示文本":"按住拖动，可以扫射开火！","可点击任意位置":false,"若是PC端则改为":{"UI名":"BattleHud","控件路径":"UIImage","提示文本":"移动鼠标，可以瞄准僵尸","可点击任意位置":true}}],"完成时执行指令":[]}}]]
                },
                ["怪物等级"] = {
                    0,
                    0
                }
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = "呆滞僵尸",
                                ["比重"] = 50
                            }
                        },
                        ["持续时间"] = 1,
                        ["数量"] = 6,
                        ["最大数量"] = 6,
                        ["开始时间"] = 0
                    }
                },
                ["属性倍率"] = 1,
                ["开始时执行指令"] = {
                    [[focusOn {"聚焦UI":{"聚焦UI":[{"UI名":"HudCards","控件路径":"副卡列表/卡片_1","提示文本":"丢出樱桃炸弹\\n炸飞一大波僵尸！","可点击任意位置":true,"若是PC端则改为":{"UI名":"HudCards","控件路径":"副卡列表/卡片_1","提示文本":"按下数字[1】键\\n丢出樱桃炸弹\\n炸飞一大波僵尸！","可点击任意位置":true}}],"完成时执行指令":[]}}]]
                },
                ["怪物等级"] = {
                    0,
                    0
                }
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = "僵尸",
                                ["比重"] = 50
                            }
                        },
                        ["持续时间"] = 30,
                        ["数量"] = 20,
                        ["最大数量"] = 20,
                        ["开始时间"] = 0
                    }
                },
                ["属性倍率"] = 1,
                ["开始时执行指令"] = {
                    [[focusOn {"聚焦UI":{"聚焦UI":[{"UI名":"BattleHud","控件路径":"UIImage","提示文本":"很好！现在击败剩下的僵尸吧","可点击任意位置":true}],"完成时执行指令":[]}}]]
                },
                ["怪物等级"] = {
                    0,
                    0
                }
            }
        },
        ["场景"] = "新手关",
        ["开始玩家"] = 1,
        ["增加额外玩家时间"] = 1,
        ["最大玩家数"] = 1,
        ["每个玩家增加数量倍率"] = 0
    }),
    ["1-1（1~100级）"] = LevelType.New({
        ["关卡ID"] = "1-1（1~100级）",
        ["前置关卡"] = nil,
        ["关卡波次"] = {
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = "僵尸",
                                ["比重"] = 50
                            }
                        },
                        ["持续时间"] = 30,
                        ["数量"] = 10,
                        ["最大数量"] = 30,
                        ["开始时间"] = 0
                    }
                },
                ["属性倍率"] = 1,
                ["怪物等级"] = {
                    0,
                    0
                },
                ["掉落物"] = {
                    {
                        ["物品"] = "仙人掌",
                        ["数量"] = "50",
                        ["比重"] = 0
                    }
                }
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = "僵尸",
                                ["比重"] = 50
                            }
                        },
                        ["持续时间"] = 30,
                        ["数量"] = 10,
                        ["最大数量"] = 30,
                        ["开始时间"] = 0
                    }
                },
                ["属性倍率"] = 1,
                ["怪物等级"] = {
                    0,
                    0
                }
            }
        },
        ["场景"] = "副本1",
        ["开始玩家"] = 1,
        ["增加额外玩家时间"] = 3,
        ["最大玩家数"] = 6,
        ["每个玩家增加数量倍率"] = 0,
        ["进入条件"] = Modifiers.New({
            {
                ["目标"] = "自己",
                ["条件类型"] = "HealthCondition",
                ["条件"] = {
                    ["百分比"] = true,
                    ["最小值"] = 0,
                    ["最大值"] = 100
                },
                ["动作"] = "必须"
            }
        }),
        ["掉落物数量修改"] = {
            {
                ["目标"] = "自己",
                ["条件类型"] = "WorldTimeCondition",
                ["条件"] = {
                    ["最小值"] = 6,
                    ["最大值"] = 18
                },
                ["反转"] = true,
                ["动作"] = "威力乘以",
                ["数量"] = "0.5"
            }
        },
        ["排名掉落物"] = {
            {
                ["名次"] = {
                    0,
                    3
                },
                ["物品"] = {
                    ["水晶"] = 100
                }
            }
        }
    }),
    ["1-2（100~200级）"] = LevelType.New({
        ["关卡ID"] = "1-2（100~200级）",
        ["前置关卡"] = nil,
        ["关卡波次"] = {
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = "僵尸",
                                ["比重"] = 50
                            },
                            {
                                ["怪物类型"] = "士兵僵尸",
                                ["比重"] = 50
                            }
                        },
                        ["持续时间"] = 20,
                        ["数量"] = 20,
                        ["最大数量"] = 50,
                        ["开始时间"] = 0
                    }
                },
                ["属性倍率"] = 1,
                ["怪物等级"] = {
                    0,
                    0
                }
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = "僵尸",
                                ["比重"] = 50
                            },
                            {
                                ["怪物类型"] = "士兵僵尸",
                                ["比重"] = 50
                            }
                        },
                        ["持续时间"] = 20,
                        ["数量"] = 20,
                        ["最大数量"] = 50,
                        ["开始时间"] = 0
                    }
                },
                ["属性倍率"] = 1,
                ["怪物等级"] = {
                    0,
                    0
                }
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = "士兵僵尸",
                                ["比重"] = 100
                            }
                        },
                        ["持续时间"] = 20,
                        ["数量"] = 30,
                        ["最大数量"] = 70,
                        ["开始时间"] = 0
                    }
                },
                ["属性倍率"] = 1,
                ["怪物等级"] = {
                    0,
                    0
                }
            }
        },
        ["场景"] = "副本1",
        ["开始玩家"] = 1,
        ["增加额外玩家时间"] = 5,
        ["最大玩家数"] = 6,
        ["每个玩家增加数量倍率"] = 0,
        ["进入条件"] = Modifiers.New({
            {
                ["目标"] = "自己",
                ["条件类型"] = "HealthCondition",
                ["条件"] = {
                    ["百分比"] = true,
                    ["最小值"] = 0,
                    ["最大值"] = 100
                },
                ["动作"] = "必须"
            }
        }),
        ["掉落物数量修改"] = {
            {
                ["目标"] = "自己",
                ["条件类型"] = "WorldTimeCondition",
                ["条件"] = {
                    ["最小值"] = 6,
                    ["最大值"] = 18
                },
                ["反转"] = true,
                ["动作"] = "威力乘以",
                ["数量"] = "0.5"
            }
        }
    }),
    ["1-3（200级~300级）"] = LevelType.New({
        ["关卡ID"] = "1-3（200级~300级）",
        ["前置关卡"] = nil,
        ["关卡波次"] = {
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = "摇滚僵尸",
                                ["比重"] = 100
                            }
                        },
                        ["持续时间"] = 20,
                        ["数量"] = 30,
                        ["最大数量"] = 70,
                        ["开始时间"] = 0
                    }
                },
                ["属性倍率"] = 1,
                ["怪物等级"] = {
                    0,
                    0
                }
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = "摇滚僵尸",
                                ["比重"] = 100
                            }
                        },
                        ["持续时间"] = 20,
                        ["数量"] = 30,
                        ["最大数量"] = 70,
                        ["开始时间"] = 0
                    }
                },
                ["属性倍率"] = 1,
                ["怪物等级"] = {
                    0,
                    0
                }
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = "摇滚僵尸",
                                ["比重"] = 100
                            }
                        },
                        ["持续时间"] = 20,
                        ["数量"] = 40,
                        ["最大数量"] = 90,
                        ["开始时间"] = 0
                    }
                },
                ["属性倍率"] = 1,
                ["怪物等级"] = {
                    0,
                    0
                }
            }
        },
        ["场景"] = "副本2",
        ["开始玩家"] = 1,
        ["增加额外玩家时间"] = 7,
        ["最大玩家数"] = 6,
        ["每个玩家增加数量倍率"] = 0,
        ["进入条件"] = Modifiers.New({
            {
                ["目标"] = "自己",
                ["条件类型"] = "HealthCondition",
                ["条件"] = {
                    ["百分比"] = true,
                    ["最小值"] = 0,
                    ["最大值"] = 100
                },
                ["动作"] = "必须"
            }
        }),
        ["掉落物数量修改"] = {
            {
                ["目标"] = "自己",
                ["条件类型"] = "WorldTimeCondition",
                ["条件"] = {
                    ["最小值"] = 6,
                    ["最大值"] = 18
                },
                ["反转"] = true,
                ["动作"] = "威力乘以",
                ["数量"] = "0.5"
            }
        }
    }),
    ["1-4（300级~400级）"] = LevelType.New({
        ["关卡ID"] = "1-4（300级~400级）",
        ["前置关卡"] = nil,
        ["关卡波次"] = {
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = "寒冰僵尸",
                                ["比重"] = 100
                            }
                        },
                        ["持续时间"] = 20,
                        ["数量"] = 40,
                        ["最大数量"] = 90,
                        ["开始时间"] = 0
                    }
                },
                ["属性倍率"] = 1,
                ["怪物等级"] = {
                    0,
                    0
                }
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = "寒冰僵尸",
                                ["比重"] = 100
                            }
                        },
                        ["持续时间"] = 20,
                        ["数量"] = 40,
                        ["最大数量"] = 90,
                        ["开始时间"] = 10
                    }
                },
                ["属性倍率"] = 1,
                ["怪物等级"] = {
                    0,
                    0
                }
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = "寒冰僵尸",
                                ["比重"] = 100
                            }
                        },
                        ["持续时间"] = 20,
                        ["数量"] = 10,
                        ["最大数量"] = 60,
                        ["开始时间"] = 0
                    }
                },
                ["属性倍率"] = 1,
                ["怪物等级"] = {
                    0,
                    0
                }
            }
        },
        ["场景"] = "副本3",
        ["开始玩家"] = 1,
        ["增加额外玩家时间"] = 9,
        ["最大玩家数"] = 6,
        ["每个玩家增加数量倍率"] = 0,
        ["进入条件"] = Modifiers.New({
            {
                ["目标"] = "自己",
                ["条件类型"] = "HealthCondition",
                ["条件"] = {
                    ["百分比"] = true,
                    ["最小值"] = 0,
                    ["最大值"] = 100
                },
                ["动作"] = "必须"
            }
        }),
        ["掉落物数量修改"] = {
            {
                ["目标"] = "自己",
                ["条件类型"] = "WorldTimeCondition",
                ["条件"] = {
                    ["最小值"] = 6,
                    ["最大值"] = 18
                },
                ["反转"] = true,
                ["动作"] = "威力乘以",
                ["数量"] = "0.5"
            }
        }
    }),
    ["1-5（400级~500级）"] = LevelType.New({
        ["关卡ID"] = "1-5（400级~500级）",
        ["前置关卡"] = nil,
        ["关卡波次"] = {
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = "绅士僵尸",
                                ["比重"] = 100
                            }
                        },
                        ["持续时间"] = 20,
                        ["数量"] = 10,
                        ["最大数量"] = 60,
                        ["开始时间"] = 0
                    }
                },
                ["属性倍率"] = 1,
                ["怪物等级"] = {
                    0,
                    0
                }
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = "绅士僵尸",
                                ["比重"] = 100
                            }
                        },
                        ["持续时间"] = 20,
                        ["数量"] = 10,
                        ["最大数量"] = 80,
                        ["开始时间"] = 0
                    }
                },
                ["属性倍率"] = 1,
                ["怪物等级"] = {
                    0,
                    0
                }
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = "绅士僵尸",
                                ["比重"] = 100
                            }
                        },
                        ["持续时间"] = 20,
                        ["数量"] = 10,
                        ["最大数量"] = 100,
                        ["开始时间"] = 10
                    }
                },
                ["属性倍率"] = 1,
                ["怪物等级"] = {
                    0,
                    0
                }
            }
        },
        ["场景"] = "副本4",
        ["开始玩家"] = 1,
        ["增加额外玩家时间"] = 11,
        ["最大玩家数"] = 6,
        ["每个玩家增加数量倍率"] = 0,
        ["进入条件"] = Modifiers.New({
            {
                ["目标"] = "自己",
                ["条件类型"] = "HealthCondition",
                ["条件"] = {
                    ["百分比"] = true,
                    ["最小值"] = 0,
                    ["最大值"] = 100
                },
                ["动作"] = "必须"
            }
        }),
        ["掉落物数量修改"] = {
            {
                ["目标"] = "自己",
                ["条件类型"] = "WorldTimeCondition",
                ["条件"] = {
                    ["最小值"] = 6,
                    ["最大值"] = 18
                },
                ["反转"] = true,
                ["动作"] = "威力乘以",
                ["数量"] = "0.5"
            }
        }
    }),
    ["测试关卡"] = LevelType.New({
        ["关卡ID"] = "测试关卡",
        ["前置关卡"] = nil,
        ["关卡波次"] = {
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = "野人",
                                ["比重"] = 50
                            }
                        },
                        ["持续时间"] = 20,
                        ["数量"] = 10,
                        ["最大数量"] = 20,
                        ["开始时间"] = 10
                    }
                },
                ["属性倍率"] = 1,
                ["怪物等级"] = {
                    0,
                    0
                }
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = "野人",
                                ["比重"] = 50
                            }
                        },
                        ["持续时间"] = 20,
                        ["数量"] = 10,
                        ["最大数量"] = 20,
                        ["开始时间"] = 10
                    }
                },
                ["属性倍率"] = 1,
                ["怪物等级"] = {
                    0,
                    0
                }
            }
        },
        ["场景"] = "副本1",
        ["开始玩家"] = 1,
        ["增加额外玩家时间"] = 10,
        ["最大玩家数"] = 6,
        ["每个玩家增加数量倍率"] = 0.5,
        ["每个玩家增加属性倍率"] = {
            ["生命"] = 0.5,
            ["攻击"] = 0.1
        },
        ["进入条件"] = Modifiers.New({
            {
                ["目标"] = "自己",
                ["条件类型"] = "HealthCondition",
                ["条件"] = {
                    ["百分比"] = true,
                    ["最小值"] = 0,
                    ["最大值"] = 100
                },
                ["动作"] = "必须"
            }
        })
    })
}loaded = true
end

---@param level string
---@return LevelType
function LevelConfig.Get(level)
    if not loaded then
        LoadConfig()
    end
    return LevelConfig.config[level]
end

---@return table<string, LevelType>
function LevelConfig.GetAll()
    if not loaded then
        LoadConfig()
    end
    return LevelConfig.config
end
return LevelConfig