local MainStorage = game:GetService('MainStorage')
local gg                = require(MainStorage.code.common.MGlobal)    ---@type gg
local Modifiers = require(MainStorage.code.common.config_type.modifier.Modifiers) ---@type Modifiers
    
---@class LevelConfig
local LevelConfig = {}
local loaded = false

local function LoadConfig()
    local LevelType = require(MainStorage.code.common.config_type.LevelType) ---@type LevelType
    LevelConfig.config ={
    ["新手关"] = LevelType.New({
        ["关卡ID"] = "新手关",
        ["前置关卡"] = nil,
        ["关卡波次"] = {
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = "呆滞僵尸",
                                ["比重"] = 50
                            }
                        },
                        ["持续时间"] = 1,
                        ["数量"] = 1,
                        ["最大数量"] = 1,
                        ["开始时间"] = 0
                    }
                },
                ["属性倍率"] = 1,
                ["开始时执行指令"] = {
                    [[focusOn {"聚焦UI":{"聚焦UI":[{"UI名":"BattleHud","控件路径":"UIImage","提示文本":"不好！僵尸入侵了你的房子","可点击任意位置":true},{"UI名":"BattleHud","控件路径":"开火","提示文本":"点击这里，向僵尸开炮！","可点击任意位置":false}],"完成时执行指令":[]}}]]
                },
                ["总计经验"] = 0
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = "呆滞僵尸",
                                ["比重"] = 50
                            }
                        },
                        ["持续时间"] = 1,
                        ["数量"] = 3,
                        ["最大数量"] = 3,
                        ["开始时间"] = 0
                    }
                },
                ["属性倍率"] = 1,
                ["开始时执行指令"] = {
                    [[focusOn {"聚焦UI":{"聚焦UI":[{"UI名":"BattleHud","控件路径":"开火","提示文本":"按住拖动，可以扫射开火！"}],"完成时执行指令":[]}}]]
                },
                ["总计经验"] = 0
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = "呆滞僵尸",
                                ["比重"] = 50
                            }
                        },
                        ["持续时间"] = 1,
                        ["数量"] = 6,
                        ["最大数量"] = 6,
                        ["开始时间"] = 0
                    }
                },
                ["属性倍率"] = 1,
                ["开始时执行指令"] = {
                    [[focusOn {"聚焦UI":{"聚焦UI":[{"UI名":"HudCards","控件路径":"副卡列表/卡片_1","提示文本":"丢出樱桃炸弹\\n炸飞一大波僵尸！"}],"完成时执行指令":[]}}]]
                },
                ["总计经验"] = 0
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = "僵尸",
                                ["比重"] = 50
                            }
                        },
                        ["持续时间"] = 30,
                        ["数量"] = 20,
                        ["最大数量"] = 20,
                        ["开始时间"] = 0
                    }
                },
                ["属性倍率"] = 1,
                ["开始时执行指令"] = {
                    [[focusOn {"聚焦UI":{"聚焦UI":[{"UI名":"BattleHud","控件路径":"UIImage","提示文本":"很好！现在击败剩下的僵尸吧","可点击任意位置":true}],"完成时执行指令":[]}}]]
                },
                ["总计经验"] = 0
            }
        },
        ["场景"] = "新手关",
        ["开始玩家"] = 1,
        ["增加额外玩家时间"] = 1,
        ["最大玩家数"] = 1,
        ["每个玩家增加数量倍率"] = 0,
        ["描述_2星"] = "生命大于30％",
        ["描述_3星"] = "生命大于70％",
        ["掉落物"] = nil,
        ["掉落物数量修改"] = nil,
        ["怪物等级"] = 1
    }),
    ["1-1（1~40级）"] = LevelType.New({
        ["关卡ID"] = "1-1（1~40级）",
        ["前置关卡"] = nil,
        ["关卡波次"] = {
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = "僵尸",
                                ["比重"] = 50
                            }
                        },
                        ["持续时间"] = 30,
                        ["数量"] = 10,
                        ["最大数量"] = 30,
                        ["开始时间"] = 0
                    }
                },
                ["属性倍率"] = 1,
                ["总计经验"] = 100
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = "僵尸",
                                ["比重"] = 50
                            }
                        },
                        ["持续时间"] = 30,
                        ["数量"] = 10,
                        ["最大数量"] = 30,
                        ["开始时间"] = 0
                    }
                },
                ["属性倍率"] = 1,
                ["总计经验"] = 100
            }
        },
        ["场景"] = "副本1",
        ["开始玩家"] = 1,
        ["增加额外玩家时间"] = 10,
        ["最大玩家数"] = 6,
        ["每个玩家增加数量倍率"] = 0,
        ["进入条件"] = Modifiers.New({
            {
                ["目标"] = "自己",
                ["条件类型"] = "HealthCondition",
                ["条件"] = {
                    ["百分比"] = true,
                    ["最小值"] = 0,
                    ["最大值"] = 100
                },
                ["动作"] = "必须"
            }
        }),
        ["描述_2星"] = "生命大于30％",
        ["描述_3星"] = "生命大于70％",
        ["条件_2星"] = {
            {
                ["目标"] = "自己",
                ["条件类型"] = "HealthCondition",
                ["条件"] = {
                    ["百分比"] = true,
                    ["最小值"] = 30,
                    ["最大值"] = 100
                },
                ["动作"] = "必须"
            }
        },
        ["条件_3星"] = {
            {
                ["目标"] = "自己",
                ["条件类型"] = "HealthCondition",
                ["条件"] = {
                    ["百分比"] = true,
                    ["最小值"] = 70,
                    ["最大值"] = 100
                },
                ["动作"] = "必须"
            }
        },
        ["掉落物"] = {
            {
                ["物品"] = "金币",
                ["数量"] = "30*LVL",
                ["比重"] = 100
            }
        },
        ["掉落物数量修改"] = {
            {
                ["目标"] = "自己",
                ["条件类型"] = "WorldTimeCondition",
                ["条件"] = {
                    ["最小值"] = 6,
                    ["最大值"] = 18
                },
                ["反转"] = true,
                ["动作"] = "威力乘以",
                ["数量"] = "0.5"
            }
        },
        ["怪物等级"] = 1
    }),
    ["1-2（41~80级）"] = LevelType.New({
        ["关卡ID"] = "1-2（41~80级）",
        ["前置关卡"] = nil,
        ["关卡波次"] = {
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = "僵尸",
                                ["比重"] = 50
                            },
                            {
                                ["怪物类型"] = "士兵僵尸",
                                ["比重"] = 50
                            }
                        },
                        ["持续时间"] = 20,
                        ["数量"] = 20,
                        ["最大数量"] = 50,
                        ["开始时间"] = 0
                    }
                },
                ["属性倍率"] = 1,
                ["总计经验"] = 100
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = "僵尸",
                                ["比重"] = 50
                            },
                            {
                                ["怪物类型"] = "士兵僵尸",
                                ["比重"] = 50
                            }
                        },
                        ["持续时间"] = 20,
                        ["数量"] = 20,
                        ["最大数量"] = 50,
                        ["开始时间"] = 0
                    }
                },
                ["属性倍率"] = 1,
                ["总计经验"] = 100
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = "士兵僵尸",
                                ["比重"] = 100
                            }
                        },
                        ["持续时间"] = 20,
                        ["数量"] = 30,
                        ["最大数量"] = 70,
                        ["开始时间"] = 0
                    }
                },
                ["属性倍率"] = 1,
                ["总计经验"] = 100
            }
        },
        ["场景"] = "副本1",
        ["开始玩家"] = 1,
        ["增加额外玩家时间"] = 10,
        ["最大玩家数"] = 6,
        ["每个玩家增加数量倍率"] = 0,
        ["进入条件"] = Modifiers.New({
            {
                ["目标"] = "自己",
                ["条件类型"] = "HealthCondition",
                ["条件"] = {
                    ["百分比"] = true,
                    ["最小值"] = 0,
                    ["最大值"] = 100
                },
                ["动作"] = "必须"
            }
        }),
        ["描述_2星"] = "生命大于30％",
        ["描述_3星"] = "生命大于70％",
        ["条件_2星"] = {
            {
                ["目标"] = "自己",
                ["条件类型"] = "HealthCondition",
                ["条件"] = {
                    ["百分比"] = true,
                    ["最小值"] = 30,
                    ["最大值"] = 100
                },
                ["动作"] = "必须"
            }
        },
        ["条件_3星"] = {
            {
                ["目标"] = "自己",
                ["条件类型"] = "HealthCondition",
                ["条件"] = {
                    ["百分比"] = true,
                    ["最小值"] = 70,
                    ["最大值"] = 100
                },
                ["动作"] = "必须"
            }
        },
        ["掉落物数量修改"] = {
            {
                ["目标"] = "自己",
                ["条件类型"] = "WorldTimeCondition",
                ["条件"] = {
                    ["最小值"] = 6,
                    ["最大值"] = 18
                },
                ["反转"] = true,
                ["动作"] = "威力乘以",
                ["数量"] = "0.5"
            }
        },
        ["怪物等级"] = 1
    }),
    ["1-3（81级~120级）"] = LevelType.New({
        ["关卡ID"] = "1-3（81级~120级）",
        ["前置关卡"] = nil,
        ["关卡波次"] = {
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = "摇滚僵尸",
                                ["比重"] = 100
                            }
                        },
                        ["持续时间"] = 20,
                        ["数量"] = 30,
                        ["最大数量"] = 70,
                        ["开始时间"] = 0
                    }
                },
                ["属性倍率"] = 1,
                ["总计经验"] = 100
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = "摇滚僵尸",
                                ["比重"] = 100
                            }
                        },
                        ["持续时间"] = 20,
                        ["数量"] = 30,
                        ["最大数量"] = 70,
                        ["开始时间"] = 0
                    }
                },
                ["属性倍率"] = 1,
                ["总计经验"] = 100
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = "摇滚僵尸",
                                ["比重"] = 100
                            }
                        },
                        ["持续时间"] = 20,
                        ["数量"] = 40,
                        ["最大数量"] = 90,
                        ["开始时间"] = 0
                    }
                },
                ["属性倍率"] = 1,
                ["总计经验"] = 100
            }
        },
        ["场景"] = "副本1",
        ["开始玩家"] = 1,
        ["增加额外玩家时间"] = 10,
        ["最大玩家数"] = 6,
        ["每个玩家增加数量倍率"] = 0,
        ["进入条件"] = Modifiers.New({
            {
                ["目标"] = "自己",
                ["条件类型"] = "HealthCondition",
                ["条件"] = {
                    ["百分比"] = true,
                    ["最小值"] = 0,
                    ["最大值"] = 100
                },
                ["动作"] = "必须"
            }
        }),
        ["描述_2星"] = "生命大于30％",
        ["描述_3星"] = "生命大于70％",
        ["条件_2星"] = {
            {
                ["目标"] = "自己",
                ["条件类型"] = "HealthCondition",
                ["条件"] = {
                    ["百分比"] = true,
                    ["最小值"] = 30,
                    ["最大值"] = 100
                },
                ["动作"] = "必须"
            }
        },
        ["条件_3星"] = {
            {
                ["目标"] = "自己",
                ["条件类型"] = "HealthCondition",
                ["条件"] = {
                    ["百分比"] = true,
                    ["最小值"] = 70,
                    ["最大值"] = 100
                },
                ["动作"] = "必须"
            }
        },
        ["掉落物数量修改"] = {
            {
                ["目标"] = "自己",
                ["条件类型"] = "WorldTimeCondition",
                ["条件"] = {
                    ["最小值"] = 6,
                    ["最大值"] = 18
                },
                ["反转"] = true,
                ["动作"] = "威力乘以",
                ["数量"] = "0.5"
            }
        },
        ["怪物等级"] = 1
    }),
    ["1-4（121级~160级）"] = LevelType.New({
        ["关卡ID"] = "1-4（121级~160级）",
        ["前置关卡"] = nil,
        ["关卡波次"] = {
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = "寒冰僵尸",
                                ["比重"] = 100
                            }
                        },
                        ["持续时间"] = 20,
                        ["数量"] = 40,
                        ["最大数量"] = 90,
                        ["开始时间"] = 0
                    }
                },
                ["属性倍率"] = 1,
                ["总计经验"] = 100
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = "寒冰僵尸",
                                ["比重"] = 100
                            }
                        },
                        ["持续时间"] = 20,
                        ["数量"] = 40,
                        ["最大数量"] = 90,
                        ["开始时间"] = 10
                    }
                },
                ["属性倍率"] = 1,
                ["总计经验"] = 100
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = "寒冰僵尸",
                                ["比重"] = 100
                            }
                        },
                        ["持续时间"] = 20,
                        ["数量"] = 10,
                        ["最大数量"] = 60,
                        ["开始时间"] = 0
                    }
                },
                ["属性倍率"] = 1,
                ["总计经验"] = 100
            }
        },
        ["场景"] = "副本1",
        ["开始玩家"] = 1,
        ["增加额外玩家时间"] = 10,
        ["最大玩家数"] = 6,
        ["每个玩家增加数量倍率"] = 0,
        ["进入条件"] = Modifiers.New({
            {
                ["目标"] = "自己",
                ["条件类型"] = "HealthCondition",
                ["条件"] = {
                    ["百分比"] = true,
                    ["最小值"] = 0,
                    ["最大值"] = 100
                },
                ["动作"] = "必须"
            }
        }),
        ["描述_2星"] = "生命大于30％",
        ["描述_3星"] = "生命大于70％",
        ["条件_2星"] = {
            {
                ["目标"] = "自己",
                ["条件类型"] = "HealthCondition",
                ["条件"] = {
                    ["百分比"] = true,
                    ["最小值"] = 30,
                    ["最大值"] = 100
                },
                ["动作"] = "必须"
            }
        },
        ["条件_3星"] = {
            {
                ["目标"] = "自己",
                ["条件类型"] = "HealthCondition",
                ["条件"] = {
                    ["百分比"] = true,
                    ["最小值"] = 70,
                    ["最大值"] = 100
                },
                ["动作"] = "必须"
            }
        },
        ["掉落物数量修改"] = {
            {
                ["目标"] = "自己",
                ["条件类型"] = "WorldTimeCondition",
                ["条件"] = {
                    ["最小值"] = 6,
                    ["最大值"] = 18
                },
                ["反转"] = true,
                ["动作"] = "威力乘以",
                ["数量"] = "0.5"
            }
        },
        ["怪物等级"] = 1
    }),
    ["1-5（161级~200级）"] = LevelType.New({
        ["关卡ID"] = "1-5（161级~200级）",
        ["前置关卡"] = nil,
        ["关卡波次"] = {
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = "绅士僵尸",
                                ["比重"] = 100
                            }
                        },
                        ["持续时间"] = 20,
                        ["数量"] = 10,
                        ["最大数量"] = 60,
                        ["开始时间"] = 0
                    }
                },
                ["属性倍率"] = 1,
                ["总计经验"] = 100
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = "绅士僵尸",
                                ["比重"] = 100
                            }
                        },
                        ["持续时间"] = 20,
                        ["数量"] = 10,
                        ["最大数量"] = 80,
                        ["开始时间"] = 0
                    }
                },
                ["属性倍率"] = 1,
                ["总计经验"] = 100
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = "绅士僵尸",
                                ["比重"] = 100
                            }
                        },
                        ["持续时间"] = 100,
                        ["数量"] = 10,
                        ["最大数量"] = 100,
                        ["开始时间"] = 10
                    }
                },
                ["属性倍率"] = 1,
                ["总计经验"] = 100
            }
        },
        ["场景"] = "副本1",
        ["开始玩家"] = 1,
        ["增加额外玩家时间"] = 10,
        ["最大玩家数"] = 6,
        ["每个玩家增加数量倍率"] = 0,
        ["进入条件"] = Modifiers.New({
            {
                ["目标"] = "自己",
                ["条件类型"] = "HealthCondition",
                ["条件"] = {
                    ["百分比"] = true,
                    ["最小值"] = 0,
                    ["最大值"] = 100
                },
                ["动作"] = "必须"
            }
        }),
        ["描述_2星"] = "生命大于30％",
        ["描述_3星"] = "生命大于70％",
        ["条件_2星"] = {
            {
                ["目标"] = "自己",
                ["条件类型"] = "HealthCondition",
                ["条件"] = {
                    ["百分比"] = true,
                    ["最小值"] = 30,
                    ["最大值"] = 100
                },
                ["动作"] = "必须"
            }
        },
        ["条件_3星"] = {
            {
                ["目标"] = "自己",
                ["条件类型"] = "HealthCondition",
                ["条件"] = {
                    ["百分比"] = true,
                    ["最小值"] = 70,
                    ["最大值"] = 100
                },
                ["动作"] = "必须"
            }
        },
        ["掉落物数量修改"] = {
            {
                ["目标"] = "自己",
                ["条件类型"] = "WorldTimeCondition",
                ["条件"] = {
                    ["最小值"] = 6,
                    ["最大值"] = 18
                },
                ["反转"] = true,
                ["动作"] = "威力乘以",
                ["数量"] = "0.5"
            }
        },
        ["怪物等级"] = 1
    }),
    ["测试关卡"] = LevelType.New({
        ["关卡ID"] = "测试关卡",
        ["前置关卡"] = nil,
        ["关卡波次"] = {
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = "野人",
                                ["比重"] = 50
                            }
                        },
                        ["持续时间"] = 20,
                        ["数量"] = 10,
                        ["最大数量"] = 20,
                        ["开始时间"] = 10
                    }
                },
                ["属性倍率"] = 1,
                ["总计经验"] = 100
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = "野人",
                                ["比重"] = 50
                            }
                        },
                        ["持续时间"] = 20,
                        ["数量"] = 10,
                        ["最大数量"] = 20,
                        ["开始时间"] = 10
                    }
                },
                ["属性倍率"] = 1,
                ["总计经验"] = 100
            }
        },
        ["场景"] = "副本1",
        ["进入位置"] = {
            "出生点/SpawnPos1",
            "出生点/SpawnPos2",
            "出生点/SpawnPos3",
            "出生点/SpawnPos4",
            "出生点/SpawnPos5",
            "出生点/SpawnPos6"
        },
        ["刷怪点"] = {
            "刷怪点/Cube",
            "刷怪点/Cube_copy",
            "刷怪点/Cube_copy_2",
            "刷怪点/Cube_copy_3",
            "刷怪点/Cube_copy_4",
            "刷怪点/Cube_copy_5",
            "刷怪点/Cube_copy_6",
            "刷怪点/Cube_copy_7"
        },
        ["开始玩家"] = 1,
        ["增加额外玩家时间"] = 10,
        ["最大玩家数"] = 6,
        ["每个玩家增加数量倍率"] = 0.5,
        ["每个玩家增加属性倍率"] = {
            ["生命"] = 0.5,
            ["攻击"] = 0.1
        },
        ["进入条件"] = Modifiers.New({
            {
                ["目标"] = "自己",
                ["条件类型"] = "HealthCondition",
                ["条件"] = {
                    ["百分比"] = true,
                    ["最小值"] = 0,
                    ["最大值"] = 100
                },
                ["动作"] = "必须"
            }
        }),
        ["描述_2星"] = "生命大于30％",
        ["描述_3星"] = "生命大于70％",
        ["条件_2星"] = {
            {
                ["目标"] = "自己",
                ["条件类型"] = "HealthCondition",
                ["条件"] = {
                    ["百分比"] = true,
                    ["最小值"] = 30,
                    ["最大值"] = 100
                },
                ["动作"] = "必须"
            }
        },
        ["条件_3星"] = {
            {
                ["目标"] = "自己",
                ["条件类型"] = "HealthCondition",
                ["条件"] = {
                    ["百分比"] = true,
                    ["最小值"] = 70,
                    ["最大值"] = 100
                },
                ["动作"] = "必须"
            }
        },
        ["掉落物"] = nil,
        ["掉落物数量修改"] = nil,
        ["怪物等级"] = 1
    })
}loaded = true
end

---@param level string
---@return LevelType
function LevelConfig.Get(level)
    if not loaded then
        LoadConfig()
    end
    return LevelConfig.config[level]
end

---@return table<string, LevelType>
function LevelConfig.GetAll()
    if not loaded then
        LoadConfig()
    end
    return LevelConfig.config
end
return LevelConfig