
    
local MainStorage = game:GetService('MainStorage')
local gg                = require(MainStorage.code.common.MGlobal)    ---@type gg


--- 关卡配置文件
---@class LevelConfig
local LevelConfig= { config = {
    ["1-1"] = Level.New({
        ["关卡ID"] = "1-1",
        ["分类"] = "主线",
        ["关卡波次"] = {
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "镰牙蜥",
                                    ["描述"] = "随处可见，普通小妖，轻松对付",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "镰牙蜥",
                                    ["基础等级"] = 1,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.005*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1*1.005*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "镰牙蜥",
                                    ["图鉴击杀数"] = 2438,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "镰牙蜥",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 50
                            }
                        },
                        ["持续时间"] = 6,
                        ["数量"] = 20,
                        ["最大数量"] = 20,
                        ["开始时间"] = 0
                    }
                },
                ["加空间概率"] = 20,
                ["加空间格数"] = 1.2,
                ["属性倍率"] = 1,
                ["给予灵蕴"] = 33,
                ["总计经验"] = 294
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "镰牙蜥",
                                    ["描述"] = "随处可见，普通小妖，轻松对付",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "镰牙蜥",
                                    ["基础等级"] = 1,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.005*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1*1.005*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "镰牙蜥",
                                    ["图鉴击杀数"] = 2438,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "镰牙蜥",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 50
                            }
                        },
                        ["持续时间"] = 6.33,
                        ["数量"] = 22,
                        ["最大数量"] = 22,
                        ["开始时间"] = 0
                    }
                },
                ["加空间概率"] = 20,
                ["加空间格数"] = 1.4,
                ["属性倍率"] = 1.11,
                ["给予灵蕴"] = 48,
                ["总计经验"] = 450
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "镰牙蜥",
                                    ["描述"] = "随处可见，普通小妖，轻松对付",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "镰牙蜥",
                                    ["基础等级"] = 1,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.005*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1*1.005*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "镰牙蜥",
                                    ["图鉴击杀数"] = 2438,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "镰牙蜥",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 50
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "黑翼蝠",
                                    ["描述"] = "夜行鬼魅，振翅迅捷，需要小心",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "黑翼蝠",
                                    ["基础等级"] = 2,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.01*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*0.8*1.01*1)^1.1",
                                        ["速度"] = "80 "
                                    },
                                    ["图鉴图标"] = "黑翼蝠",
                                    ["图鉴击杀数"] = 2889,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "黑翼蝠",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 20
                            }
                        },
                        ["持续时间"] = 6.66,
                        ["数量"] = 24,
                        ["最大数量"] = 24,
                        ["开始时间"] = 0
                    }
                },
                ["加空间概率"] = 20,
                ["加空间格数"] = 1.6,
                ["属性倍率"] = 1.22,
                ["给予灵蕴"] = 63,
                ["总计经验"] = 606
            }
        },
        ["完成奖励_1星"] = {
            [""] = 500
        },
        ["完成奖励_2星"] = {
            [""] = 500
        },
        ["完成奖励_3星"] = {
            [""] = 100
        },
        ["初始必加空间"] = true,
        ["等级"] = 1,
        ["初始背包宽"] = 4,
        ["初始背包高"] = 4,
        ["描述_2星"] = "生命大于30％",
        ["描述_3星"] = "生命大于70％",
        ["怪物等级"] = 2
    }),
    ["1-2"] = Level.New({
        ["关卡ID"] = "1-2",
        ["分类"] = "主线",
        ["关卡波次"] = {
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "镰牙蜥",
                                    ["描述"] = "随处可见，普通小妖，轻松对付",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "镰牙蜥",
                                    ["基础等级"] = 1,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.005*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1*1.005*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "镰牙蜥",
                                    ["图鉴击杀数"] = 2438,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "镰牙蜥",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 50
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "黑翼蝠",
                                    ["描述"] = "夜行鬼魅，振翅迅捷，需要小心",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "黑翼蝠",
                                    ["基础等级"] = 2,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.01*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*0.8*1.01*1)^1.1",
                                        ["速度"] = "80 "
                                    },
                                    ["图鉴图标"] = "黑翼蝠",
                                    ["图鉴击杀数"] = 2889,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "黑翼蝠",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 20
                            }
                        },
                        ["持续时间"] = 9,
                        ["数量"] = 25,
                        ["最大数量"] = 25,
                        ["开始时间"] = 0
                    }
                },
                ["加空间概率"] = 20,
                ["加空间格数"] = 1.2,
                ["属性倍率"] = 1,
                ["给予灵蕴"] = 31,
                ["总计经验"] = 278
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "镰牙蜥",
                                    ["描述"] = "随处可见，普通小妖，轻松对付",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "镰牙蜥",
                                    ["基础等级"] = 1,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.005*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1*1.005*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "镰牙蜥",
                                    ["图鉴击杀数"] = 2438,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "镰牙蜥",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 50
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "黑翼蝠",
                                    ["描述"] = "夜行鬼魅，振翅迅捷，需要小心",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "黑翼蝠",
                                    ["基础等级"] = 2,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.01*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*0.8*1.01*1)^1.1",
                                        ["速度"] = "80 "
                                    },
                                    ["图鉴图标"] = "黑翼蝠",
                                    ["图鉴击杀数"] = 2889,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "黑翼蝠",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 20
                            }
                        },
                        ["持续时间"] = 9.5175,
                        ["数量"] = 28,
                        ["最大数量"] = 28,
                        ["开始时间"] = 0
                    }
                },
                ["加空间概率"] = 20,
                ["加空间格数"] = 1.4,
                ["属性倍率"] = 1.115,
                ["给予灵蕴"] = 45,
                ["总计经验"] = 430
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "镰牙蜥",
                                    ["描述"] = "随处可见，普通小妖，轻松对付",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "镰牙蜥",
                                    ["基础等级"] = 1,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.005*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1*1.005*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "镰牙蜥",
                                    ["图鉴击杀数"] = 2438,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "镰牙蜥",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 50
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "黑翼蝠",
                                    ["描述"] = "夜行鬼魅，振翅迅捷，需要小心",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "黑翼蝠",
                                    ["基础等级"] = 2,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.01*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*0.8*1.01*1)^1.1",
                                        ["速度"] = "80 "
                                    },
                                    ["图鉴图标"] = "黑翼蝠",
                                    ["图鉴击杀数"] = 2889,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "黑翼蝠",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 20
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "灵狐",
                                    ["描述"] = "山间灵兽，狡黠如风，爪带寒芒",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "灵狐",
                                    ["基础等级"] = 4,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1.1*1.02*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1.1*1.02*1)^1.1",
                                        ["速度"] = "60 "
                                    },
                                    ["图鉴图标"] = "灵狐",
                                    ["图鉴击杀数"] = 3809,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "灵狐",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 20
                            }
                        },
                        ["持续时间"] = 10.035,
                        ["数量"] = 31,
                        ["最大数量"] = 31,
                        ["开始时间"] = 0
                    }
                },
                ["加空间概率"] = 20,
                ["加空间格数"] = 1.6,
                ["属性倍率"] = 1.23,
                ["给予灵蕴"] = 59,
                ["总计经验"] = 582
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "镰牙蜥",
                                    ["描述"] = "随处可见，普通小妖，轻松对付",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "镰牙蜥",
                                    ["基础等级"] = 1,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.005*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1*1.005*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "镰牙蜥",
                                    ["图鉴击杀数"] = 2438,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "镰牙蜥",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 50
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "黑翼蝠",
                                    ["描述"] = "夜行鬼魅，振翅迅捷，需要小心",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "黑翼蝠",
                                    ["基础等级"] = 2,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.01*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*0.8*1.01*1)^1.1",
                                        ["速度"] = "80 "
                                    },
                                    ["图鉴图标"] = "黑翼蝠",
                                    ["图鉴击杀数"] = 2889,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "黑翼蝠",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 20
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "灵狐",
                                    ["描述"] = "山间灵兽，狡黠如风，爪带寒芒",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "灵狐",
                                    ["基础等级"] = 4,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1.1*1.02*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1.1*1.02*1)^1.1",
                                        ["速度"] = "60 "
                                    },
                                    ["图鉴图标"] = "灵狐",
                                    ["图鉴击杀数"] = 3809,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "灵狐",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 20
                            }
                        },
                        ["持续时间"] = 10.5525,
                        ["数量"] = 34,
                        ["最大数量"] = 34,
                        ["开始时间"] = 0
                    }
                },
                ["加空间概率"] = 20,
                ["加空间格数"] = 1.8,
                ["属性倍率"] = 1.345,
                ["给予灵蕴"] = 73,
                ["总计经验"] = 734
            }
        },
        ["完成奖励_1星"] = {
            [""] = 500
        },
        ["完成奖励_2星"] = {
            [""] = 6
        },
        ["完成奖励_3星"] = {
            [""] = 100
        },
        ["初始必加空间"] = true,
        ["等级"] = 3,
        ["初始背包宽"] = 4,
        ["初始背包高"] = 4,
        ["描述_2星"] = "生命大于30％",
        ["描述_3星"] = "生命大于70％",
        ["怪物等级"] = 1
    }),
    ["1-3"] = Level.New({
        ["关卡ID"] = "1-3",
        ["分类"] = "主线",
        ["关卡波次"] = {
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "镰牙蜥",
                                    ["描述"] = "随处可见，普通小妖，轻松对付",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "镰牙蜥",
                                    ["基础等级"] = 1,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.005*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1*1.005*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "镰牙蜥",
                                    ["图鉴击杀数"] = 2438,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "镰牙蜥",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 50
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "黑翼蝠",
                                    ["描述"] = "夜行鬼魅，振翅迅捷，需要小心",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "黑翼蝠",
                                    ["基础等级"] = 2,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.01*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*0.8*1.01*1)^1.1",
                                        ["速度"] = "80 "
                                    },
                                    ["图鉴图标"] = "黑翼蝠",
                                    ["图鉴击杀数"] = 2889,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "黑翼蝠",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 20
                            }
                        },
                        ["持续时间"] = 12,
                        ["数量"] = 30,
                        ["最大数量"] = 30,
                        ["开始时间"] = 0
                    }
                },
                ["加空间概率"] = 20,
                ["加空间格数"] = 1.2,
                ["属性倍率"] = 1,
                ["给予灵蕴"] = 29,
                ["总计经验"] = 263
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "镰牙蜥",
                                    ["描述"] = "随处可见，普通小妖，轻松对付",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "镰牙蜥",
                                    ["基础等级"] = 1,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.005*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1*1.005*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "镰牙蜥",
                                    ["图鉴击杀数"] = 2438,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "镰牙蜥",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 50
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "黑翼蝠",
                                    ["描述"] = "夜行鬼魅，振翅迅捷，需要小心",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "黑翼蝠",
                                    ["基础等级"] = 2,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.01*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*0.8*1.01*1)^1.1",
                                        ["速度"] = "80 "
                                    },
                                    ["图鉴图标"] = "黑翼蝠",
                                    ["图鉴击杀数"] = 2889,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "黑翼蝠",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 20
                            }
                        },
                        ["持续时间"] = 12.72,
                        ["数量"] = 34,
                        ["最大数量"] = 34,
                        ["开始时间"] = 0
                    }
                },
                ["加空间概率"] = 20,
                ["加空间格数"] = 1.4,
                ["属性倍率"] = 1.12,
                ["给予灵蕴"] = 42,
                ["总计经验"] = 410
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "镰牙蜥",
                                    ["描述"] = "随处可见，普通小妖，轻松对付",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "镰牙蜥",
                                    ["基础等级"] = 1,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.005*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1*1.005*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "镰牙蜥",
                                    ["图鉴击杀数"] = 2438,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "镰牙蜥",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 50
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "黑翼蝠",
                                    ["描述"] = "夜行鬼魅，振翅迅捷，需要小心",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "黑翼蝠",
                                    ["基础等级"] = 2,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.01*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*0.8*1.01*1)^1.1",
                                        ["速度"] = "80 "
                                    },
                                    ["图鉴图标"] = "黑翼蝠",
                                    ["图鉴击杀数"] = 2889,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "黑翼蝠",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 20
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "灵狐",
                                    ["描述"] = "山间灵兽，狡黠如风，爪带寒芒",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "灵狐",
                                    ["基础等级"] = 4,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1.1*1.02*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1.1*1.02*1)^1.1",
                                        ["速度"] = "60 "
                                    },
                                    ["图鉴图标"] = "灵狐",
                                    ["图鉴击杀数"] = 3809,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "灵狐",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 20
                            }
                        },
                        ["持续时间"] = 13.4400005,
                        ["数量"] = 37,
                        ["最大数量"] = 37,
                        ["开始时间"] = 0
                    }
                },
                ["加空间概率"] = 20,
                ["加空间格数"] = 1.6,
                ["属性倍率"] = 1.24,
                ["给予灵蕴"] = 55,
                ["总计经验"] = 557
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "镰牙蜥",
                                    ["描述"] = "随处可见，普通小妖，轻松对付",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "镰牙蜥",
                                    ["基础等级"] = 1,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.005*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1*1.005*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "镰牙蜥",
                                    ["图鉴击杀数"] = 2438,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "镰牙蜥",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 50
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "黑翼蝠",
                                    ["描述"] = "夜行鬼魅，振翅迅捷，需要小心",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "黑翼蝠",
                                    ["基础等级"] = 2,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.01*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*0.8*1.01*1)^1.1",
                                        ["速度"] = "80 "
                                    },
                                    ["图鉴图标"] = "黑翼蝠",
                                    ["图鉴击杀数"] = 2889,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "黑翼蝠",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 20
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "灵狐",
                                    ["描述"] = "山间灵兽，狡黠如风，爪带寒芒",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "灵狐",
                                    ["基础等级"] = 4,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1.1*1.02*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1.1*1.02*1)^1.1",
                                        ["速度"] = "60 "
                                    },
                                    ["图鉴图标"] = "灵狐",
                                    ["图鉴击杀数"] = 3809,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "灵狐",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 20
                            }
                        },
                        ["持续时间"] = 14.16,
                        ["数量"] = 41,
                        ["最大数量"] = 41,
                        ["开始时间"] = 0
                    }
                },
                ["加空间概率"] = 20,
                ["加空间格数"] = 1.8,
                ["属性倍率"] = 1.36,
                ["给予灵蕴"] = 68,
                ["总计经验"] = 704
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "镰牙蜥",
                                    ["描述"] = "随处可见，普通小妖，轻松对付",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "镰牙蜥",
                                    ["基础等级"] = 1,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.005*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1*1.005*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "镰牙蜥",
                                    ["图鉴击杀数"] = 2438,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "镰牙蜥",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 50
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "黑翼蝠",
                                    ["描述"] = "夜行鬼魅，振翅迅捷，需要小心",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "黑翼蝠",
                                    ["基础等级"] = 2,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.01*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*0.8*1.01*1)^1.1",
                                        ["速度"] = "80 "
                                    },
                                    ["图鉴图标"] = "黑翼蝠",
                                    ["图鉴击杀数"] = 2889,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "黑翼蝠",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 20
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "灵狐",
                                    ["描述"] = "山间灵兽，狡黠如风，爪带寒芒",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "灵狐",
                                    ["基础等级"] = 4,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1.1*1.02*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1.1*1.02*1)^1.1",
                                        ["速度"] = "60 "
                                    },
                                    ["图鉴图标"] = "灵狐",
                                    ["图鉴击杀数"] = 3809,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "灵狐",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 20
                            }
                        },
                        ["持续时间"] = 14.88,
                        ["数量"] = 44,
                        ["最大数量"] = 44,
                        ["开始时间"] = 0
                    },
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "岩石傀儡",
                                    ["描述"] = "镇守古阵，身躯如山，拳崩岩裂",
                                    ["是首领"] = true,
                                    ["怪物ID"] = "岩石傀儡",
                                    ["基础等级"] = 5,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.025*20)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1*1.025*20)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "岩石傀儡",
                                    ["图鉴击杀数"] = 42,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "岩石傀儡",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 1
                            }
                        },
                        ["持续时间"] = 1,
                        ["数量"] = 1,
                        ["最大数量"] = 1,
                        ["开始时间"] = 7.44
                    }
                },
                ["加空间概率"] = 20,
                ["加空间格数"] = 2,
                ["属性倍率"] = 1.68000007,
                ["给予灵蕴"] = 81,
                ["总计经验"] = 851
            }
        },
        ["完成奖励_1星"] = {
            [""] = 500
        },
        ["完成奖励_2星"] = {
            [""] = 3
        },
        ["完成奖励_3星"] = {
            [""] = 100
        },
        ["初始必加空间"] = true,
        ["等级"] = 5,
        ["初始背包宽"] = 4,
        ["初始背包高"] = 4,
        ["描述_2星"] = "生命大于30％",
        ["描述_3星"] = "生命大于70％",
        ["怪物等级"] = 1
    }),
    ["1-4"] = Level.New({
        ["关卡ID"] = "1-4",
        ["分类"] = "主线",
        ["关卡波次"] = {
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "镰牙蜥",
                                    ["描述"] = "随处可见，普通小妖，轻松对付",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "镰牙蜥",
                                    ["基础等级"] = 1,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.005*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1*1.005*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "镰牙蜥",
                                    ["图鉴击杀数"] = 2438,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "镰牙蜥",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 50
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "黑翼蝠",
                                    ["描述"] = "夜行鬼魅，振翅迅捷，需要小心",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "黑翼蝠",
                                    ["基础等级"] = 2,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.01*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*0.8*1.01*1)^1.1",
                                        ["速度"] = "80 "
                                    },
                                    ["图鉴图标"] = "黑翼蝠",
                                    ["图鉴击杀数"] = 2889,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "黑翼蝠",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 10
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "灵狐",
                                    ["描述"] = "山间灵兽，狡黠如风，爪带寒芒",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "灵狐",
                                    ["基础等级"] = 4,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1.1*1.02*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1.1*1.02*1)^1.1",
                                        ["速度"] = "60 "
                                    },
                                    ["图鉴图标"] = "灵狐",
                                    ["图鉴击杀数"] = 3809,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "灵狐",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 20
                            }
                        },
                        ["持续时间"] = 15,
                        ["数量"] = 35,
                        ["最大数量"] = 35,
                        ["开始时间"] = 0
                    }
                },
                ["加空间概率"] = 20,
                ["加空间格数"] = 1.2,
                ["属性倍率"] = 1,
                ["给予灵蕴"] = 27,
                ["总计经验"] = 250
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "镰牙蜥",
                                    ["描述"] = "随处可见，普通小妖，轻松对付",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "镰牙蜥",
                                    ["基础等级"] = 1,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.005*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1*1.005*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "镰牙蜥",
                                    ["图鉴击杀数"] = 2438,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "镰牙蜥",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 50
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "黑翼蝠",
                                    ["描述"] = "夜行鬼魅，振翅迅捷，需要小心",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "黑翼蝠",
                                    ["基础等级"] = 2,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.01*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*0.8*1.01*1)^1.1",
                                        ["速度"] = "80 "
                                    },
                                    ["图鉴图标"] = "黑翼蝠",
                                    ["图鉴击杀数"] = 2889,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "黑翼蝠",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 10
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "灵狐",
                                    ["描述"] = "山间灵兽，狡黠如风，爪带寒芒",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "灵狐",
                                    ["基础等级"] = 4,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1.1*1.02*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1.1*1.02*1)^1.1",
                                        ["速度"] = "60 "
                                    },
                                    ["图鉴图标"] = "灵狐",
                                    ["图鉴击杀数"] = 3809,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "灵狐",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 20
                            }
                        },
                        ["持续时间"] = 15.9375,
                        ["数量"] = 39,
                        ["最大数量"] = 39,
                        ["开始时间"] = 0
                    }
                },
                ["加空间概率"] = 20,
                ["加空间格数"] = 1.4,
                ["属性倍率"] = 1.125,
                ["给予灵蕴"] = 38,
                ["总计经验"] = 393
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "镰牙蜥",
                                    ["描述"] = "随处可见，普通小妖，轻松对付",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "镰牙蜥",
                                    ["基础等级"] = 1,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.005*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1*1.005*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "镰牙蜥",
                                    ["图鉴击杀数"] = 2438,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "镰牙蜥",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 50
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "黑翼蝠",
                                    ["描述"] = "夜行鬼魅，振翅迅捷，需要小心",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "黑翼蝠",
                                    ["基础等级"] = 2,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.01*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*0.8*1.01*1)^1.1",
                                        ["速度"] = "80 "
                                    },
                                    ["图鉴图标"] = "黑翼蝠",
                                    ["图鉴击杀数"] = 2889,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "黑翼蝠",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 10
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "灵狐",
                                    ["描述"] = "山间灵兽，狡黠如风，爪带寒芒",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "灵狐",
                                    ["基础等级"] = 4,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1.1*1.02*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1.1*1.02*1)^1.1",
                                        ["速度"] = "60 "
                                    },
                                    ["图鉴图标"] = "灵狐",
                                    ["图鉴击杀数"] = 3809,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "灵狐",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 20
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "猛冲蜥",
                                    ["描述"] = "沙丘暴徒，略为强硬，不难解决",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "猛冲蜥",
                                    ["基础等级"] = 6,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.03*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1*1.03*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "猛冲蜥",
                                    ["图鉴击杀数"] = 4750,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "猛冲蜥",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 20
                            }
                        },
                        ["持续时间"] = 16.875,
                        ["数量"] = 44,
                        ["最大数量"] = 44,
                        ["开始时间"] = 0
                    }
                },
                ["加空间概率"] = 20,
                ["加空间格数"] = 1.6,
                ["属性倍率"] = 1.25,
                ["给予灵蕴"] = 49,
                ["总计经验"] = 536
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "镰牙蜥",
                                    ["描述"] = "随处可见，普通小妖，轻松对付",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "镰牙蜥",
                                    ["基础等级"] = 1,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.005*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1*1.005*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "镰牙蜥",
                                    ["图鉴击杀数"] = 2438,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "镰牙蜥",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 50
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "黑翼蝠",
                                    ["描述"] = "夜行鬼魅，振翅迅捷，需要小心",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "黑翼蝠",
                                    ["基础等级"] = 2,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.01*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*0.8*1.01*1)^1.1",
                                        ["速度"] = "80 "
                                    },
                                    ["图鉴图标"] = "黑翼蝠",
                                    ["图鉴击杀数"] = 2889,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "黑翼蝠",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 10
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "灵狐",
                                    ["描述"] = "山间灵兽，狡黠如风，爪带寒芒",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "灵狐",
                                    ["基础等级"] = 4,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1.1*1.02*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1.1*1.02*1)^1.1",
                                        ["速度"] = "60 "
                                    },
                                    ["图鉴图标"] = "灵狐",
                                    ["图鉴击杀数"] = 3809,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "灵狐",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 20
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "猛冲蜥",
                                    ["描述"] = "沙丘暴徒，略为强硬，不难解决",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "猛冲蜥",
                                    ["基础等级"] = 6,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.03*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1*1.03*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "猛冲蜥",
                                    ["图鉴击杀数"] = 4750,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "猛冲蜥",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 20
                            }
                        },
                        ["持续时间"] = 17.8125,
                        ["数量"] = 48,
                        ["最大数量"] = 48,
                        ["开始时间"] = 0
                    }
                },
                ["加空间概率"] = 20,
                ["加空间格数"] = 1.8,
                ["属性倍率"] = 1.375,
                ["给予灵蕴"] = 60,
                ["总计经验"] = 679
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "镰牙蜥",
                                    ["描述"] = "随处可见，普通小妖，轻松对付",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "镰牙蜥",
                                    ["基础等级"] = 1,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.005*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1*1.005*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "镰牙蜥",
                                    ["图鉴击杀数"] = 2438,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "镰牙蜥",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 50
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "黑翼蝠",
                                    ["描述"] = "夜行鬼魅，振翅迅捷，需要小心",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "黑翼蝠",
                                    ["基础等级"] = 2,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.01*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*0.8*1.01*1)^1.1",
                                        ["速度"] = "80 "
                                    },
                                    ["图鉴图标"] = "黑翼蝠",
                                    ["图鉴击杀数"] = 2889,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "黑翼蝠",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 10
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "灵狐",
                                    ["描述"] = "山间灵兽，狡黠如风，爪带寒芒",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "灵狐",
                                    ["基础等级"] = 4,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1.1*1.02*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1.1*1.02*1)^1.1",
                                        ["速度"] = "60 "
                                    },
                                    ["图鉴图标"] = "灵狐",
                                    ["图鉴击杀数"] = 3809,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "灵狐",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 20
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "猛冲蜥",
                                    ["描述"] = "沙丘暴徒，略为强硬，不难解决",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "猛冲蜥",
                                    ["基础等级"] = 6,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.03*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1*1.03*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "猛冲蜥",
                                    ["图鉴击杀数"] = 4750,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "猛冲蜥",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 20
                            }
                        },
                        ["持续时间"] = 18.75,
                        ["数量"] = 52,
                        ["最大数量"] = 52,
                        ["开始时间"] = 0
                    },
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "岩石傀儡",
                                    ["描述"] = "镇守古阵，身躯如山，拳崩岩裂",
                                    ["是首领"] = true,
                                    ["怪物ID"] = "岩石傀儡",
                                    ["基础等级"] = 5,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.025*20)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1*1.025*20)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "岩石傀儡",
                                    ["图鉴击杀数"] = 42,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "岩石傀儡",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 1
                            }
                        },
                        ["持续时间"] = 1,
                        ["数量"] = 1,
                        ["最大数量"] = 1,
                        ["开始时间"] = 9.375
                    }
                },
                ["加空间概率"] = 20,
                ["加空间格数"] = 2,
                ["属性倍率"] = 1.7,
                ["给予灵蕴"] = 71,
                ["总计经验"] = 822
            }
        },
        ["完成奖励_1星"] = {
            [""] = 500
        },
        ["完成奖励_2星"] = {
            [""] = 6
        },
        ["完成奖励_3星"] = {
            [""] = 100
        },
        ["初始必加空间"] = true,
        ["等级"] = 7,
        ["初始背包宽"] = 3,
        ["初始背包高"] = 4,
        ["描述_2星"] = "生命大于30％",
        ["描述_3星"] = "生命大于70％",
        ["怪物等级"] = 1
    }),
    ["1-5"] = Level.New({
        ["关卡ID"] = "1-5",
        ["分类"] = "主线",
        ["关卡波次"] = {
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "镰牙蜥",
                                    ["描述"] = "随处可见，普通小妖，轻松对付",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "镰牙蜥",
                                    ["基础等级"] = 1,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.005*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1*1.005*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "镰牙蜥",
                                    ["图鉴击杀数"] = 2438,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "镰牙蜥",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 50
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "黑翼蝠",
                                    ["描述"] = "夜行鬼魅，振翅迅捷，需要小心",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "黑翼蝠",
                                    ["基础等级"] = 2,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.01*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*0.8*1.01*1)^1.1",
                                        ["速度"] = "80 "
                                    },
                                    ["图鉴图标"] = "黑翼蝠",
                                    ["图鉴击杀数"] = 2889,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "黑翼蝠",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 10
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "灵狐",
                                    ["描述"] = "山间灵兽，狡黠如风，爪带寒芒",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "灵狐",
                                    ["基础等级"] = 4,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1.1*1.02*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1.1*1.02*1)^1.1",
                                        ["速度"] = "60 "
                                    },
                                    ["图鉴图标"] = "灵狐",
                                    ["图鉴击杀数"] = 3809,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "灵狐",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 20
                            }
                        },
                        ["持续时间"] = 18,
                        ["数量"] = 40,
                        ["最大数量"] = 40,
                        ["开始时间"] = 0
                    }
                },
                ["加空间概率"] = 13,
                ["加空间格数"] = 1.2,
                ["属性倍率"] = 1,
                ["给予灵蕴"] = 25,
                ["总计经验"] = 238
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "镰牙蜥",
                                    ["描述"] = "随处可见，普通小妖，轻松对付",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "镰牙蜥",
                                    ["基础等级"] = 1,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.005*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1*1.005*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "镰牙蜥",
                                    ["图鉴击杀数"] = 2438,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "镰牙蜥",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 50
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "黑翼蝠",
                                    ["描述"] = "夜行鬼魅，振翅迅捷，需要小心",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "黑翼蝠",
                                    ["基础等级"] = 2,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.01*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*0.8*1.01*1)^1.1",
                                        ["速度"] = "80 "
                                    },
                                    ["图鉴图标"] = "黑翼蝠",
                                    ["图鉴击杀数"] = 2889,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "黑翼蝠",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 10
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "灵狐",
                                    ["描述"] = "山间灵兽，狡黠如风，爪带寒芒",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "灵狐",
                                    ["基础等级"] = 4,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1.1*1.02*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1.1*1.02*1)^1.1",
                                        ["速度"] = "60 "
                                    },
                                    ["图鉴图标"] = "灵狐",
                                    ["图鉴击杀数"] = 3809,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "灵狐",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 20
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "猛冲蜥",
                                    ["描述"] = "沙丘暴徒，略为强硬，不难解决",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "猛冲蜥",
                                    ["基础等级"] = 6,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.03*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1*1.03*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "猛冲蜥",
                                    ["图鉴击杀数"] = 4750,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "猛冲蜥",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 10
                            }
                        },
                        ["持续时间"] = 19.17,
                        ["数量"] = 45,
                        ["最大数量"] = 45,
                        ["开始时间"] = 0
                    }
                },
                ["加空间概率"] = 13,
                ["加空间格数"] = 1.4,
                ["属性倍率"] = 1.13,
                ["给予灵蕴"] = 36,
                ["总计经验"] = 377
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "镰牙蜥",
                                    ["描述"] = "随处可见，普通小妖，轻松对付",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "镰牙蜥",
                                    ["基础等级"] = 1,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.005*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1*1.005*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "镰牙蜥",
                                    ["图鉴击杀数"] = 2438,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "镰牙蜥",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 50
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "黑翼蝠",
                                    ["描述"] = "夜行鬼魅，振翅迅捷，需要小心",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "黑翼蝠",
                                    ["基础等级"] = 2,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.01*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*0.8*1.01*1)^1.1",
                                        ["速度"] = "80 "
                                    },
                                    ["图鉴图标"] = "黑翼蝠",
                                    ["图鉴击杀数"] = 2889,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "黑翼蝠",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 10
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "灵狐",
                                    ["描述"] = "山间灵兽，狡黠如风，爪带寒芒",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "灵狐",
                                    ["基础等级"] = 4,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1.1*1.02*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1.1*1.02*1)^1.1",
                                        ["速度"] = "60 "
                                    },
                                    ["图鉴图标"] = "灵狐",
                                    ["图鉴击杀数"] = 3809,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "灵狐",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 20
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "猛冲蜥",
                                    ["描述"] = "沙丘暴徒，略为强硬，不难解决",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "猛冲蜥",
                                    ["基础等级"] = 6,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.03*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1*1.03*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "猛冲蜥",
                                    ["图鉴击杀数"] = 4750,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "猛冲蜥",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 10
                            }
                        },
                        ["持续时间"] = 20.34,
                        ["数量"] = 50,
                        ["最大数量"] = 50,
                        ["开始时间"] = 0
                    }
                },
                ["加空间概率"] = 13,
                ["加空间格数"] = 1.6,
                ["属性倍率"] = 1.26,
                ["给予灵蕴"] = 47,
                ["总计经验"] = 516
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "镰牙蜥",
                                    ["描述"] = "随处可见，普通小妖，轻松对付",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "镰牙蜥",
                                    ["基础等级"] = 1,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.005*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1*1.005*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "镰牙蜥",
                                    ["图鉴击杀数"] = 2438,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "镰牙蜥",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 50
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "黑翼蝠",
                                    ["描述"] = "夜行鬼魅，振翅迅捷，需要小心",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "黑翼蝠",
                                    ["基础等级"] = 2,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.01*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*0.8*1.01*1)^1.1",
                                        ["速度"] = "80 "
                                    },
                                    ["图鉴图标"] = "黑翼蝠",
                                    ["图鉴击杀数"] = 2889,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "黑翼蝠",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 10
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "灵狐",
                                    ["描述"] = "山间灵兽，狡黠如风，爪带寒芒",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "灵狐",
                                    ["基础等级"] = 4,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1.1*1.02*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1.1*1.02*1)^1.1",
                                        ["速度"] = "60 "
                                    },
                                    ["图鉴图标"] = "灵狐",
                                    ["图鉴击杀数"] = 3809,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "灵狐",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 20
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "猛冲蜥",
                                    ["描述"] = "沙丘暴徒，略为强硬，不难解决",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "猛冲蜥",
                                    ["基础等级"] = 6,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.03*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1*1.03*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "猛冲蜥",
                                    ["图鉴击杀数"] = 4750,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "猛冲蜥",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 10
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "浮游石",
                                    ["描述"] = "玄磁奇物，悬空缓行，坚不可摧",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "浮游石",
                                    ["基础等级"] = 8,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.04*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1.5*1.04*1)^1.1",
                                        ["速度"] = "30 "
                                    },
                                    ["图鉴图标"] = "浮游石",
                                    ["图鉴击杀数"] = 5708,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "浮游石",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 20
                            }
                        },
                        ["持续时间"] = 21.51,
                        ["数量"] = 56,
                        ["最大数量"] = 56,
                        ["开始时间"] = 0
                    }
                },
                ["加空间概率"] = 13,
                ["加空间格数"] = 1.8,
                ["属性倍率"] = 1.39,
                ["给予灵蕴"] = 58,
                ["总计经验"] = 655
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "镰牙蜥",
                                    ["描述"] = "随处可见，普通小妖，轻松对付",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "镰牙蜥",
                                    ["基础等级"] = 1,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.005*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1*1.005*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "镰牙蜥",
                                    ["图鉴击杀数"] = 2438,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "镰牙蜥",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 50
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "黑翼蝠",
                                    ["描述"] = "夜行鬼魅，振翅迅捷，需要小心",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "黑翼蝠",
                                    ["基础等级"] = 2,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.01*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*0.8*1.01*1)^1.1",
                                        ["速度"] = "80 "
                                    },
                                    ["图鉴图标"] = "黑翼蝠",
                                    ["图鉴击杀数"] = 2889,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "黑翼蝠",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 10
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "灵狐",
                                    ["描述"] = "山间灵兽，狡黠如风，爪带寒芒",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "灵狐",
                                    ["基础等级"] = 4,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1.1*1.02*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1.1*1.02*1)^1.1",
                                        ["速度"] = "60 "
                                    },
                                    ["图鉴图标"] = "灵狐",
                                    ["图鉴击杀数"] = 3809,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "灵狐",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 20
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "猛冲蜥",
                                    ["描述"] = "沙丘暴徒，略为强硬，不难解决",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "猛冲蜥",
                                    ["基础等级"] = 6,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.03*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1*1.03*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "猛冲蜥",
                                    ["图鉴击杀数"] = 4750,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "猛冲蜥",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 10
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "浮游石",
                                    ["描述"] = "玄磁奇物，悬空缓行，坚不可摧",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "浮游石",
                                    ["基础等级"] = 8,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.04*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1.5*1.04*1)^1.1",
                                        ["速度"] = "30 "
                                    },
                                    ["图鉴图标"] = "浮游石",
                                    ["图鉴击杀数"] = 5708,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "浮游石",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 20
                            }
                        },
                        ["持续时间"] = 22.68,
                        ["数量"] = 61,
                        ["最大数量"] = 61,
                        ["开始时间"] = 0
                    }
                },
                ["加空间概率"] = 13,
                ["加空间格数"] = 2,
                ["属性倍率"] = 1.72,
                ["给予灵蕴"] = 69,
                ["总计经验"] = 794
            }
        },
        ["完成奖励_1星"] = {
            [""] = 500
        },
        ["完成奖励_2星"] = {
            [""] = 5
        },
        ["完成奖励_3星"] = {
            [""] = 100
        },
        ["初始必加空间"] = true,
        ["等级"] = 9,
        ["初始背包宽"] = 3,
        ["初始背包高"] = 4,
        ["描述_2星"] = "生命大于30％",
        ["描述_3星"] = "生命大于70％",
        ["怪物等级"] = 1
    }),
    ["1-6"] = Level.New({
        ["关卡ID"] = "1-6",
        ["分类"] = "主线",
        ["关卡波次"] = {
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "镰牙蜥",
                                    ["描述"] = "随处可见，普通小妖，轻松对付",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "镰牙蜥",
                                    ["基础等级"] = 1,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.005*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1*1.005*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "镰牙蜥",
                                    ["图鉴击杀数"] = 2438,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "镰牙蜥",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 50
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "黑翼蝠",
                                    ["描述"] = "夜行鬼魅，振翅迅捷，需要小心",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "黑翼蝠",
                                    ["基础等级"] = 2,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.01*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*0.8*1.01*1)^1.1",
                                        ["速度"] = "80 "
                                    },
                                    ["图鉴图标"] = "黑翼蝠",
                                    ["图鉴击杀数"] = 2889,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "黑翼蝠",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 10
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "灵狐",
                                    ["描述"] = "山间灵兽，狡黠如风，爪带寒芒",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "灵狐",
                                    ["基础等级"] = 4,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1.1*1.02*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1.1*1.02*1)^1.1",
                                        ["速度"] = "60 "
                                    },
                                    ["图鉴图标"] = "灵狐",
                                    ["图鉴击杀数"] = 3809,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "灵狐",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 20
                            }
                        },
                        ["持续时间"] = 24,
                        ["数量"] = 50,
                        ["最大数量"] = 50,
                        ["开始时间"] = 0
                    }
                },
                ["加空间概率"] = 13,
                ["加空间格数"] = 1.2,
                ["属性倍率"] = 1,
                ["给予灵蕴"] = 24,
                ["总计经验"] = 227
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "镰牙蜥",
                                    ["描述"] = "随处可见，普通小妖，轻松对付",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "镰牙蜥",
                                    ["基础等级"] = 1,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.005*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1*1.005*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "镰牙蜥",
                                    ["图鉴击杀数"] = 2438,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "镰牙蜥",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 50
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "黑翼蝠",
                                    ["描述"] = "夜行鬼魅，振翅迅捷，需要小心",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "黑翼蝠",
                                    ["基础等级"] = 2,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.01*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*0.8*1.01*1)^1.1",
                                        ["速度"] = "80 "
                                    },
                                    ["图鉴图标"] = "黑翼蝠",
                                    ["图鉴击杀数"] = 2889,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "黑翼蝠",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 10
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "灵狐",
                                    ["描述"] = "山间灵兽，狡黠如风，爪带寒芒",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "灵狐",
                                    ["基础等级"] = 4,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1.1*1.02*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1.1*1.02*1)^1.1",
                                        ["速度"] = "60 "
                                    },
                                    ["图鉴图标"] = "灵狐",
                                    ["图鉴击杀数"] = 3809,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "灵狐",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 20
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "猛冲蜥",
                                    ["描述"] = "沙丘暴徒，略为强硬，不难解决",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "猛冲蜥",
                                    ["基础等级"] = 6,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.03*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1*1.03*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "猛冲蜥",
                                    ["图鉴击杀数"] = 4750,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "猛冲蜥",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 15
                            }
                        },
                        ["持续时间"] = 25.68,
                        ["数量"] = 57,
                        ["最大数量"] = 57,
                        ["开始时间"] = 0
                    }
                },
                ["加空间概率"] = 13,
                ["加空间格数"] = 1.4,
                ["属性倍率"] = 1.14,
                ["给予灵蕴"] = 34,
                ["总计经验"] = 362
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "镰牙蜥",
                                    ["描述"] = "随处可见，普通小妖，轻松对付",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "镰牙蜥",
                                    ["基础等级"] = 1,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.005*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1*1.005*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "镰牙蜥",
                                    ["图鉴击杀数"] = 2438,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "镰牙蜥",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 50
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "黑翼蝠",
                                    ["描述"] = "夜行鬼魅，振翅迅捷，需要小心",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "黑翼蝠",
                                    ["基础等级"] = 2,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.01*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*0.8*1.01*1)^1.1",
                                        ["速度"] = "80 "
                                    },
                                    ["图鉴图标"] = "黑翼蝠",
                                    ["图鉴击杀数"] = 2889,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "黑翼蝠",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 10
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "灵狐",
                                    ["描述"] = "山间灵兽，狡黠如风，爪带寒芒",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "灵狐",
                                    ["基础等级"] = 4,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1.1*1.02*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1.1*1.02*1)^1.1",
                                        ["速度"] = "60 "
                                    },
                                    ["图鉴图标"] = "灵狐",
                                    ["图鉴击杀数"] = 3809,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "灵狐",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 20
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "猛冲蜥",
                                    ["描述"] = "沙丘暴徒，略为强硬，不难解决",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "猛冲蜥",
                                    ["基础等级"] = 6,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.03*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1*1.03*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "猛冲蜥",
                                    ["图鉴击杀数"] = 4750,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "猛冲蜥",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 15
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "浮游石",
                                    ["描述"] = "玄磁奇物，悬空缓行，坚不可摧",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "浮游石",
                                    ["基础等级"] = 8,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.04*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1.5*1.04*1)^1.1",
                                        ["速度"] = "30 "
                                    },
                                    ["图鉴图标"] = "浮游石",
                                    ["图鉴击杀数"] = 5708,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "浮游石",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 15
                            }
                        },
                        ["持续时间"] = 27.36,
                        ["数量"] = 64,
                        ["最大数量"] = 64,
                        ["开始时间"] = 0
                    }
                },
                ["加空间概率"] = 13,
                ["加空间格数"] = 1.6,
                ["属性倍率"] = 1.28,
                ["给予灵蕴"] = 44,
                ["总计经验"] = 497
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "镰牙蜥",
                                    ["描述"] = "随处可见，普通小妖，轻松对付",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "镰牙蜥",
                                    ["基础等级"] = 1,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.005*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1*1.005*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "镰牙蜥",
                                    ["图鉴击杀数"] = 2438,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "镰牙蜥",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 50
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "黑翼蝠",
                                    ["描述"] = "夜行鬼魅，振翅迅捷，需要小心",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "黑翼蝠",
                                    ["基础等级"] = 2,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.01*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*0.8*1.01*1)^1.1",
                                        ["速度"] = "80 "
                                    },
                                    ["图鉴图标"] = "黑翼蝠",
                                    ["图鉴击杀数"] = 2889,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "黑翼蝠",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 10
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "灵狐",
                                    ["描述"] = "山间灵兽，狡黠如风，爪带寒芒",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "灵狐",
                                    ["基础等级"] = 4,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1.1*1.02*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1.1*1.02*1)^1.1",
                                        ["速度"] = "60 "
                                    },
                                    ["图鉴图标"] = "灵狐",
                                    ["图鉴击杀数"] = 3809,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "灵狐",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 20
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "猛冲蜥",
                                    ["描述"] = "沙丘暴徒，略为强硬，不难解决",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "猛冲蜥",
                                    ["基础等级"] = 6,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.03*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1*1.03*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "猛冲蜥",
                                    ["图鉴击杀数"] = 4750,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "猛冲蜥",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 15
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "浮游石",
                                    ["描述"] = "玄磁奇物，悬空缓行，坚不可摧",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "浮游石",
                                    ["基础等级"] = 8,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.04*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1.5*1.04*1)^1.1",
                                        ["速度"] = "30 "
                                    },
                                    ["图鉴图标"] = "浮游石",
                                    ["图鉴击杀数"] = 5708,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "浮游石",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 15
                            }
                        },
                        ["持续时间"] = 29.039999,
                        ["数量"] = 71,
                        ["最大数量"] = 71,
                        ["开始时间"] = 0
                    },
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "树妖",
                                    ["描述"] = "古木成精，根须噬魂，枝如铁鞭",
                                    ["是首领"] = true,
                                    ["怪物ID"] = "树妖",
                                    ["基础等级"] = 10,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.05*20)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1*1.05*20)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "树妖",
                                    ["图鉴击杀数"] = 66,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "树妖",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 1
                            }
                        },
                        ["持续时间"] = 1,
                        ["数量"] = 1,
                        ["最大数量"] = 1,
                        ["开始时间"] = 14.5199995
                    }
                },
                ["加空间概率"] = 13,
                ["加空间格数"] = 1.8,
                ["属性倍率"] = 1.42,
                ["给予灵蕴"] = 54,
                ["总计经验"] = 632
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "镰牙蜥",
                                    ["描述"] = "随处可见，普通小妖，轻松对付",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "镰牙蜥",
                                    ["基础等级"] = 1,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.005*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1*1.005*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "镰牙蜥",
                                    ["图鉴击杀数"] = 2438,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "镰牙蜥",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 50
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "黑翼蝠",
                                    ["描述"] = "夜行鬼魅，振翅迅捷，需要小心",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "黑翼蝠",
                                    ["基础等级"] = 2,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.01*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*0.8*1.01*1)^1.1",
                                        ["速度"] = "80 "
                                    },
                                    ["图鉴图标"] = "黑翼蝠",
                                    ["图鉴击杀数"] = 2889,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "黑翼蝠",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 10
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "灵狐",
                                    ["描述"] = "山间灵兽，狡黠如风，爪带寒芒",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "灵狐",
                                    ["基础等级"] = 4,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1.1*1.02*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1.1*1.02*1)^1.1",
                                        ["速度"] = "60 "
                                    },
                                    ["图鉴图标"] = "灵狐",
                                    ["图鉴击杀数"] = 3809,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "灵狐",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 20
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "猛冲蜥",
                                    ["描述"] = "沙丘暴徒，略为强硬，不难解决",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "猛冲蜥",
                                    ["基础等级"] = 6,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.03*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1*1.03*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "猛冲蜥",
                                    ["图鉴击杀数"] = 4750,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "猛冲蜥",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 15
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "浮游石",
                                    ["描述"] = "玄磁奇物，悬空缓行，坚不可摧",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "浮游石",
                                    ["基础等级"] = 8,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.04*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1.5*1.04*1)^1.1",
                                        ["速度"] = "30 "
                                    },
                                    ["图鉴图标"] = "浮游石",
                                    ["图鉴击杀数"] = 5708,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "浮游石",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 15
                            }
                        },
                        ["持续时间"] = 30.72,
                        ["数量"] = 78,
                        ["最大数量"] = 78,
                        ["开始时间"] = 0
                    }
                },
                ["加空间概率"] = 13,
                ["加空间格数"] = 2,
                ["属性倍率"] = 1.76,
                ["给予灵蕴"] = 64,
                ["总计经验"] = 767
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "镰牙蜥",
                                    ["描述"] = "随处可见，普通小妖，轻松对付",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "镰牙蜥",
                                    ["基础等级"] = 1,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.005*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1*1.005*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "镰牙蜥",
                                    ["图鉴击杀数"] = 2438,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "镰牙蜥",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 50
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "黑翼蝠",
                                    ["描述"] = "夜行鬼魅，振翅迅捷，需要小心",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "黑翼蝠",
                                    ["基础等级"] = 2,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.01*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*0.8*1.01*1)^1.1",
                                        ["速度"] = "80 "
                                    },
                                    ["图鉴图标"] = "黑翼蝠",
                                    ["图鉴击杀数"] = 2889,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "黑翼蝠",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 10
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "灵狐",
                                    ["描述"] = "山间灵兽，狡黠如风，爪带寒芒",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "灵狐",
                                    ["基础等级"] = 4,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1.1*1.02*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1.1*1.02*1)^1.1",
                                        ["速度"] = "60 "
                                    },
                                    ["图鉴图标"] = "灵狐",
                                    ["图鉴击杀数"] = 3809,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "灵狐",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 20
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "猛冲蜥",
                                    ["描述"] = "沙丘暴徒，略为强硬，不难解决",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "猛冲蜥",
                                    ["基础等级"] = 6,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.03*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1*1.03*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "猛冲蜥",
                                    ["图鉴击杀数"] = 4750,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "猛冲蜥",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 15
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "浮游石",
                                    ["描述"] = "玄磁奇物，悬空缓行，坚不可摧",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "浮游石",
                                    ["基础等级"] = 8,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.04*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1.5*1.04*1)^1.1",
                                        ["速度"] = "30 "
                                    },
                                    ["图鉴图标"] = "浮游石",
                                    ["图鉴击杀数"] = 5708,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "浮游石",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 15
                            }
                        },
                        ["持续时间"] = 32.4,
                        ["数量"] = 85,
                        ["最大数量"] = 85,
                        ["开始时间"] = 0
                    },
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "树妖",
                                    ["描述"] = "古木成精，根须噬魂，枝如铁鞭",
                                    ["是首领"] = true,
                                    ["怪物ID"] = "树妖",
                                    ["基础等级"] = 10,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.05*20)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1*1.05*20)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "树妖",
                                    ["图鉴击杀数"] = 66,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "树妖",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 1
                            }
                        },
                        ["持续时间"] = 1,
                        ["数量"] = 1,
                        ["最大数量"] = 1,
                        ["开始时间"] = 16.2
                    }
                },
                ["加空间概率"] = 13,
                ["加空间格数"] = 2.2,
                ["属性倍率"] = 1.9000001,
                ["给予灵蕴"] = 74,
                ["总计经验"] = 902
            }
        },
        ["完成奖励_1星"] = {
            [""] = 500
        },
        ["完成奖励_2星"] = {
            [""] = 18
        },
        ["完成奖励_3星"] = {
            [""] = 100
        },
        ["初始必加空间"] = true,
        ["等级"] = 13,
        ["初始背包宽"] = 3,
        ["初始背包高"] = 4,
        ["描述_2星"] = "生命大于30％",
        ["描述_3星"] = "生命大于70％",
        ["怪物等级"] = 1
    }),
    ["2-1"] = Level.New({
        ["关卡ID"] = "2-1",
        ["分类"] = "主线",
        ["关卡波次"] = {
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "雪山蜥",
                                    ["描述"] = "冰崖隐刃，仍乃小妖，随意应对",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "雪山蜥",
                                    ["基础等级"] = 11,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.055*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1*1.055*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "雪山蜥",
                                    ["图鉴击杀数"] = 7172,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "雪山蜥",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 50
                            }
                        },
                        ["持续时间"] = 21,
                        ["数量"] = 45,
                        ["最大数量"] = 45,
                        ["开始时间"] = 0
                    }
                },
                ["加空间概率"] = 13,
                ["加空间格数"] = 1.2,
                ["属性倍率"] = 1,
                ["给予灵蕴"] = 22,
                ["总计经验"] = 217
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "雪山蜥",
                                    ["描述"] = "冰崖隐刃，仍乃小妖，随意应对",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "雪山蜥",
                                    ["基础等级"] = 11,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.055*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1*1.055*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "雪山蜥",
                                    ["图鉴击杀数"] = 7172,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "雪山蜥",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 50
                            }
                        },
                        ["持续时间"] = 22.4175,
                        ["数量"] = 51,
                        ["最大数量"] = 51,
                        ["开始时间"] = 0
                    }
                },
                ["加空间概率"] = 13,
                ["加空间格数"] = 1.4,
                ["属性倍率"] = 1.135,
                ["给予灵蕴"] = 31,
                ["总计经验"] = 349
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "雪山蜥",
                                    ["描述"] = "冰崖隐刃，仍乃小妖，随意应对",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "雪山蜥",
                                    ["基础等级"] = 11,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.055*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1*1.055*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "雪山蜥",
                                    ["图鉴击杀数"] = 7172,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "雪山蜥",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 50
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "白雪灵狐",
                                    ["描述"] = "极地灵狐，踏雪无痕，冰息蚀骨",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "白雪灵狐",
                                    ["基础等级"] = 13,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1.1*1.065*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1.1*1.065*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "白雪灵狐",
                                    ["图鉴击杀数"] = 8165,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "白雪灵狐",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 20
                            }
                        },
                        ["持续时间"] = 23.835,
                        ["数量"] = 57,
                        ["最大数量"] = 57,
                        ["开始时间"] = 0
                    }
                },
                ["加空间概率"] = 13,
                ["加空间格数"] = 1.6,
                ["属性倍率"] = 1.27,
                ["给予灵蕴"] = 40,
                ["总计经验"] = 481
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "雪山蜥",
                                    ["描述"] = "冰崖隐刃，仍乃小妖，随意应对",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "雪山蜥",
                                    ["基础等级"] = 11,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.055*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1*1.055*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "雪山蜥",
                                    ["图鉴击杀数"] = 7172,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "雪山蜥",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 50
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "白雪灵狐",
                                    ["描述"] = "极地灵狐，踏雪无痕，冰息蚀骨",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "白雪灵狐",
                                    ["基础等级"] = 13,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1.1*1.065*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1.1*1.065*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "白雪灵狐",
                                    ["图鉴击杀数"] = 8165,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "白雪灵狐",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 20
                            }
                        },
                        ["持续时间"] = 25.2525,
                        ["数量"] = 63,
                        ["最大数量"] = 63,
                        ["开始时间"] = 0
                    }
                },
                ["加空间概率"] = 13,
                ["加空间格数"] = 1.8,
                ["属性倍率"] = 1.405,
                ["给予灵蕴"] = 49,
                ["总计经验"] = 613
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "雪山蜥",
                                    ["描述"] = "冰崖隐刃，仍乃小妖，随意应对",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "雪山蜥",
                                    ["基础等级"] = 11,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.055*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1*1.055*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "雪山蜥",
                                    ["图鉴击杀数"] = 7172,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "雪山蜥",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 50
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "白雪灵狐",
                                    ["描述"] = "极地灵狐，踏雪无痕，冰息蚀骨",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "白雪灵狐",
                                    ["基础等级"] = 13,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1.1*1.065*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1.1*1.065*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "白雪灵狐",
                                    ["图鉴击杀数"] = 8165,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "白雪灵狐",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 20
                            }
                        },
                        ["持续时间"] = 26.67,
                        ["数量"] = 69,
                        ["最大数量"] = 69,
                        ["开始时间"] = 0
                    }
                },
                ["加空间概率"] = 13,
                ["加空间格数"] = 2,
                ["属性倍率"] = 1.74,
                ["给予灵蕴"] = 58,
                ["总计经验"] = 745
            }
        },
        ["完成奖励_1星"] = {
            [""] = 1000
        },
        ["完成奖励_2星"] = {
            [""] = 3
        },
        ["完成奖励_3星"] = {
            [""] = 100
        },
        ["初始必加空间"] = true,
        ["等级"] = 11,
        ["初始背包宽"] = 3,
        ["初始背包高"] = 4,
        ["描述_2星"] = "生命大于30％",
        ["描述_3星"] = "生命大于70％",
        ["怪物等级"] = 1
    }),
    ["2-2"] = Level.New({
        ["关卡ID"] = "2-2",
        ["分类"] = "主线",
        ["关卡波次"] = {
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "雪山蜥",
                                    ["描述"] = "冰崖隐刃，仍乃小妖，随意应对",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "雪山蜥",
                                    ["基础等级"] = 11,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.055*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1*1.055*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "雪山蜥",
                                    ["图鉴击杀数"] = 7172,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "雪山蜥",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 50
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "黑翼蝠",
                                    ["描述"] = "夜行鬼魅，振翅迅捷，需要小心",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "黑翼蝠",
                                    ["基础等级"] = 2,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.01*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*0.8*1.01*1)^1.1",
                                        ["速度"] = "80 "
                                    },
                                    ["图鉴图标"] = "黑翼蝠",
                                    ["图鉴击杀数"] = 2889,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "黑翼蝠",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 10
                            }
                        },
                        ["持续时间"] = 24.9,
                        ["数量"] = 52,
                        ["最大数量"] = 52,
                        ["开始时间"] = 0
                    }
                },
                ["加空间概率"] = 13,
                ["加空间格数"] = 1.2,
                ["属性倍率"] = 1,
                ["给予灵蕴"] = 21,
                ["总计经验"] = 208
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "雪山蜥",
                                    ["描述"] = "冰崖隐刃，仍乃小妖，随意应对",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "雪山蜥",
                                    ["基础等级"] = 11,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.055*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1*1.055*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "雪山蜥",
                                    ["图鉴击杀数"] = 7172,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "雪山蜥",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 50
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "黑翼蝠",
                                    ["描述"] = "夜行鬼魅，振翅迅捷，需要小心",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "黑翼蝠",
                                    ["基础等级"] = 2,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.01*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*0.8*1.01*1)^1.1",
                                        ["速度"] = "80 "
                                    },
                                    ["图鉴图标"] = "黑翼蝠",
                                    ["图鉴击杀数"] = 2889,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "黑翼蝠",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 10
                            }
                        },
                        ["持续时间"] = 26.6616745,
                        ["数量"] = 59,
                        ["最大数量"] = 59,
                        ["开始时间"] = 0
                    }
                },
                ["加空间概率"] = 13,
                ["加空间格数"] = 1.4,
                ["属性倍率"] = 1.1415,
                ["给予灵蕴"] = 30,
                ["总计经验"] = 336
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "雪山蜥",
                                    ["描述"] = "冰崖隐刃，仍乃小妖，随意应对",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "雪山蜥",
                                    ["基础等级"] = 11,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.055*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1*1.055*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "雪山蜥",
                                    ["图鉴击杀数"] = 7172,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "雪山蜥",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 50
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "黑翼蝠",
                                    ["描述"] = "夜行鬼魅，振翅迅捷，需要小心",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "黑翼蝠",
                                    ["基础等级"] = 2,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.01*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*0.8*1.01*1)^1.1",
                                        ["速度"] = "80 "
                                    },
                                    ["图鉴图标"] = "黑翼蝠",
                                    ["图鉴击杀数"] = 2889,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "黑翼蝠",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 10
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "白雪灵狐",
                                    ["描述"] = "极地灵狐，踏雪无痕，冰息蚀骨",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "白雪灵狐",
                                    ["基础等级"] = 13,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1.1*1.065*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1.1*1.065*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "白雪灵狐",
                                    ["图鉴击杀数"] = 8165,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "白雪灵狐",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 21
                            }
                        },
                        ["持续时间"] = 28.42335,
                        ["数量"] = 66,
                        ["最大数量"] = 66,
                        ["开始时间"] = 0
                    }
                },
                ["加空间概率"] = 13,
                ["加空间格数"] = 1.6,
                ["属性倍率"] = 1.283,
                ["给予灵蕴"] = 39,
                ["总计经验"] = 464
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "雪山蜥",
                                    ["描述"] = "冰崖隐刃，仍乃小妖，随意应对",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "雪山蜥",
                                    ["基础等级"] = 11,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.055*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1*1.055*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "雪山蜥",
                                    ["图鉴击杀数"] = 7172,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "雪山蜥",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 50
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "黑翼蝠",
                                    ["描述"] = "夜行鬼魅，振翅迅捷，需要小心",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "黑翼蝠",
                                    ["基础等级"] = 2,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.01*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*0.8*1.01*1)^1.1",
                                        ["速度"] = "80 "
                                    },
                                    ["图鉴图标"] = "黑翼蝠",
                                    ["图鉴击杀数"] = 2889,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "黑翼蝠",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 10
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "白雪灵狐",
                                    ["描述"] = "极地灵狐，踏雪无痕，冰息蚀骨",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "白雪灵狐",
                                    ["基础等级"] = 13,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1.1*1.065*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1.1*1.065*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "白雪灵狐",
                                    ["图鉴击杀数"] = 8165,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "白雪灵狐",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 21
                            }
                        },
                        ["持续时间"] = 30.1850243,
                        ["数量"] = 73,
                        ["最大数量"] = 73,
                        ["开始时间"] = 0
                    }
                },
                ["加空间概率"] = 13,
                ["加空间格数"] = 1.8,
                ["属性倍率"] = 1.4245,
                ["给予灵蕴"] = 48,
                ["总计经验"] = 592
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "雪山蜥",
                                    ["描述"] = "冰崖隐刃，仍乃小妖，随意应对",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "雪山蜥",
                                    ["基础等级"] = 11,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.055*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1*1.055*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "雪山蜥",
                                    ["图鉴击杀数"] = 7172,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "雪山蜥",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 50
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "黑翼蝠",
                                    ["描述"] = "夜行鬼魅，振翅迅捷，需要小心",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "黑翼蝠",
                                    ["基础等级"] = 2,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.01*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*0.8*1.01*1)^1.1",
                                        ["速度"] = "80 "
                                    },
                                    ["图鉴图标"] = "黑翼蝠",
                                    ["图鉴击杀数"] = 2889,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "黑翼蝠",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 10
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "白雪灵狐",
                                    ["描述"] = "极地灵狐，踏雪无痕，冰息蚀骨",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "白雪灵狐",
                                    ["基础等级"] = 13,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1.1*1.065*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1.1*1.065*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "白雪灵狐",
                                    ["图鉴击杀数"] = 8165,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "白雪灵狐",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 21
                            }
                        },
                        ["持续时间"] = 31.9467,
                        ["数量"] = 81,
                        ["最大数量"] = 81,
                        ["开始时间"] = 0
                    }
                },
                ["加空间概率"] = 13,
                ["加空间格数"] = 2,
                ["属性倍率"] = 1.766,
                ["给予灵蕴"] = 57,
                ["总计经验"] = 720
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "雪山蜥",
                                    ["描述"] = "冰崖隐刃，仍乃小妖，随意应对",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "雪山蜥",
                                    ["基础等级"] = 11,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.055*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1*1.055*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "雪山蜥",
                                    ["图鉴击杀数"] = 7172,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "雪山蜥",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 50
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "黑翼蝠",
                                    ["描述"] = "夜行鬼魅，振翅迅捷，需要小心",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "黑翼蝠",
                                    ["基础等级"] = 2,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.01*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*0.8*1.01*1)^1.1",
                                        ["速度"] = "80 "
                                    },
                                    ["图鉴图标"] = "黑翼蝠",
                                    ["图鉴击杀数"] = 2889,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "黑翼蝠",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 10
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "白雪灵狐",
                                    ["描述"] = "极地灵狐，踏雪无痕，冰息蚀骨",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "白雪灵狐",
                                    ["基础等级"] = 13,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1.1*1.065*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1.1*1.065*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "白雪灵狐",
                                    ["图鉴击杀数"] = 8165,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "白雪灵狐",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 21
                            }
                        },
                        ["持续时间"] = 33.708374,
                        ["数量"] = 88,
                        ["最大数量"] = 88,
                        ["开始时间"] = 0
                    }
                },
                ["加空间概率"] = 13,
                ["加空间格数"] = 2.2,
                ["属性倍率"] = 1.9075,
                ["给予灵蕴"] = 66,
                ["总计经验"] = 848
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "雪山蜥",
                                    ["描述"] = "冰崖隐刃，仍乃小妖，随意应对",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "雪山蜥",
                                    ["基础等级"] = 11,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.055*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1*1.055*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "雪山蜥",
                                    ["图鉴击杀数"] = 7172,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "雪山蜥",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 50
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "黑翼蝠",
                                    ["描述"] = "夜行鬼魅，振翅迅捷，需要小心",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "黑翼蝠",
                                    ["基础等级"] = 2,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.01*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*0.8*1.01*1)^1.1",
                                        ["速度"] = "80 "
                                    },
                                    ["图鉴图标"] = "黑翼蝠",
                                    ["图鉴击杀数"] = 2889,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "黑翼蝠",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 10
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "白雪灵狐",
                                    ["描述"] = "极地灵狐，踏雪无痕，冰息蚀骨",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "白雪灵狐",
                                    ["基础等级"] = 13,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1.1*1.065*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1.1*1.065*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "白雪灵狐",
                                    ["图鉴击杀数"] = 8165,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "白雪灵狐",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 21
                            }
                        },
                        ["持续时间"] = 35.47005,
                        ["数量"] = 95,
                        ["最大数量"] = 95,
                        ["开始时间"] = 0
                    },
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "雪山巨人",
                                    ["描述"] = "冰渊霸主，拳撼雪崩，吐息成冰",
                                    ["是首领"] = true,
                                    ["怪物ID"] = "雪山巨人",
                                    ["基础等级"] = 15,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1.2*1.075*20)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1*1.075*20)^1.1",
                                        ["速度"] = "40 "
                                    },
                                    ["图鉴图标"] = "雪山巨人",
                                    ["图鉴击杀数"] = 90,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "雪山巨人",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 1
                            }
                        },
                        ["持续时间"] = 1,
                        ["数量"] = 1,
                        ["最大数量"] = 1,
                        ["开始时间"] = 17.7350254
                    }
                },
                ["加空间概率"] = 13,
                ["加空间格数"] = 2.4,
                ["属性倍率"] = 2.049,
                ["给予灵蕴"] = 75,
                ["总计经验"] = 976
            }
        },
        ["完成奖励_1星"] = {
            [""] = 1000
        },
        ["完成奖励_2星"] = {
            [""] = 5
        },
        ["完成奖励_3星"] = {
            [""] = 100
        },
        ["初始必加空间"] = true,
        ["等级"] = 0,
        ["初始背包宽"] = 3,
        ["初始背包高"] = 4,
        ["描述_2星"] = "生命大于30％",
        ["描述_3星"] = "生命大于70％",
        ["怪物等级"] = 1
    }),
    ["2-3"] = Level.New({
        ["关卡ID"] = "2-3",
        ["分类"] = "主线",
        ["关卡波次"] = {
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "雪山蜥",
                                    ["描述"] = "冰崖隐刃，仍乃小妖，随意应对",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "雪山蜥",
                                    ["基础等级"] = 11,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.055*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1*1.055*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "雪山蜥",
                                    ["图鉴击杀数"] = 7172,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "雪山蜥",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 50
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "黑翼蝠",
                                    ["描述"] = "夜行鬼魅，振翅迅捷，需要小心",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "黑翼蝠",
                                    ["基础等级"] = 2,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.01*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*0.8*1.01*1)^1.1",
                                        ["速度"] = "80 "
                                    },
                                    ["图鉴图标"] = "黑翼蝠",
                                    ["图鉴击杀数"] = 2889,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "黑翼蝠",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 10
                            }
                        },
                        ["持续时间"] = 28.8,
                        ["数量"] = 58,
                        ["最大数量"] = 58,
                        ["开始时间"] = 0
                    }
                },
                ["加空间概率"] = 13,
                ["加空间格数"] = 1.2,
                ["属性倍率"] = 1,
                ["给予灵蕴"] = 20,
                ["总计经验"] = 200
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "雪山蜥",
                                    ["描述"] = "冰崖隐刃，仍乃小妖，随意应对",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "雪山蜥",
                                    ["基础等级"] = 11,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.055*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1*1.055*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "雪山蜥",
                                    ["图鉴击杀数"] = 7172,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "雪山蜥",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 50
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "黑翼蝠",
                                    ["描述"] = "夜行鬼魅，振翅迅捷，需要小心",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "黑翼蝠",
                                    ["基础等级"] = 2,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.01*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*0.8*1.01*1)^1.1",
                                        ["速度"] = "80 "
                                    },
                                    ["图鉴图标"] = "黑翼蝠",
                                    ["图鉴击杀数"] = 2889,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "黑翼蝠",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 10
                            }
                        },
                        ["持续时间"] = 30.9312,
                        ["数量"] = 67,
                        ["最大数量"] = 67,
                        ["开始时间"] = 0
                    }
                },
                ["加空间概率"] = 13,
                ["加空间格数"] = 1.4,
                ["属性倍率"] = 1.148,
                ["给予灵蕴"] = 28,
                ["总计经验"] = 325
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "雪山蜥",
                                    ["描述"] = "冰崖隐刃，仍乃小妖，随意应对",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "雪山蜥",
                                    ["基础等级"] = 11,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.055*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1*1.055*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "雪山蜥",
                                    ["图鉴击杀数"] = 7172,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "雪山蜥",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 50
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "黑翼蝠",
                                    ["描述"] = "夜行鬼魅，振翅迅捷，需要小心",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "黑翼蝠",
                                    ["基础等级"] = 2,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.01*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*0.8*1.01*1)^1.1",
                                        ["速度"] = "80 "
                                    },
                                    ["图鉴图标"] = "黑翼蝠",
                                    ["图鉴击杀数"] = 2889,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "黑翼蝠",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 10
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "白雪灵狐",
                                    ["描述"] = "极地灵狐，踏雪无痕，冰息蚀骨",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "白雪灵狐",
                                    ["基础等级"] = 13,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1.1*1.065*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1.1*1.065*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "白雪灵狐",
                                    ["图鉴击杀数"] = 8165,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "白雪灵狐",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 20
                            }
                        },
                        ["持续时间"] = 33.0624,
                        ["数量"] = 75,
                        ["最大数量"] = 75,
                        ["开始时间"] = 0
                    }
                },
                ["加空间概率"] = 13,
                ["加空间格数"] = 1.6,
                ["属性倍率"] = 1.296,
                ["给予灵蕴"] = 36,
                ["总计经验"] = 450
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "雪山蜥",
                                    ["描述"] = "冰崖隐刃，仍乃小妖，随意应对",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "雪山蜥",
                                    ["基础等级"] = 11,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.055*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1*1.055*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "雪山蜥",
                                    ["图鉴击杀数"] = 7172,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "雪山蜥",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 50
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "黑翼蝠",
                                    ["描述"] = "夜行鬼魅，振翅迅捷，需要小心",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "黑翼蝠",
                                    ["基础等级"] = 2,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.01*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*0.8*1.01*1)^1.1",
                                        ["速度"] = "80 "
                                    },
                                    ["图鉴图标"] = "黑翼蝠",
                                    ["图鉴击杀数"] = 2889,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "黑翼蝠",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 10
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "白雪灵狐",
                                    ["描述"] = "极地灵狐，踏雪无痕，冰息蚀骨",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "白雪灵狐",
                                    ["基础等级"] = 13,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1.1*1.065*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1.1*1.065*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "白雪灵狐",
                                    ["图鉴击杀数"] = 8165,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "白雪灵狐",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 20
                            }
                        },
                        ["持续时间"] = 35.1936,
                        ["数量"] = 84,
                        ["最大数量"] = 84,
                        ["开始时间"] = 0
                    },
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "树妖",
                                    ["描述"] = "古木成精，根须噬魂，枝如铁鞭",
                                    ["是首领"] = true,
                                    ["怪物ID"] = "树妖",
                                    ["基础等级"] = 10,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.05*20)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1*1.05*20)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "树妖",
                                    ["图鉴击杀数"] = 66,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "树妖",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 1
                            }
                        },
                        ["持续时间"] = 1,
                        ["数量"] = 1,
                        ["最大数量"] = 1,
                        ["开始时间"] = 17.5968
                    }
                },
                ["加空间概率"] = 13,
                ["加空间格数"] = 1.8,
                ["属性倍率"] = 1.444,
                ["给予灵蕴"] = 44,
                ["总计经验"] = 575
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "雪山蜥",
                                    ["描述"] = "冰崖隐刃，仍乃小妖，随意应对",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "雪山蜥",
                                    ["基础等级"] = 11,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.055*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1*1.055*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "雪山蜥",
                                    ["图鉴击杀数"] = 7172,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "雪山蜥",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 50
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "黑翼蝠",
                                    ["描述"] = "夜行鬼魅，振翅迅捷，需要小心",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "黑翼蝠",
                                    ["基础等级"] = 2,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.01*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*0.8*1.01*1)^1.1",
                                        ["速度"] = "80 "
                                    },
                                    ["图鉴图标"] = "黑翼蝠",
                                    ["图鉴击杀数"] = 2889,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "黑翼蝠",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 10
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "白雪灵狐",
                                    ["描述"] = "极地灵狐，踏雪无痕，冰息蚀骨",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "白雪灵狐",
                                    ["基础等级"] = 13,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1.1*1.065*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1.1*1.065*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "白雪灵狐",
                                    ["图鉴击杀数"] = 8165,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "白雪灵狐",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 20
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "雪精石",
                                    ["描述"] = "寒髓凝晶，浮空缓移，冰壳难破",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "雪精石",
                                    ["基础等级"] = 18,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.09*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1.5*1.09*1)^1.1",
                                        ["速度"] = "30 "
                                    },
                                    ["图鉴图标"] = "雪精石",
                                    ["图鉴击杀数"] = 10691,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "雪精石",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 20
                            }
                        },
                        ["持续时间"] = 37.3248,
                        ["数量"] = 92,
                        ["最大数量"] = 92,
                        ["开始时间"] = 0
                    }
                },
                ["加空间概率"] = 13,
                ["加空间格数"] = 2,
                ["属性倍率"] = 1.792,
                ["给予灵蕴"] = 52,
                ["总计经验"] = 700
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "雪山蜥",
                                    ["描述"] = "冰崖隐刃，仍乃小妖，随意应对",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "雪山蜥",
                                    ["基础等级"] = 11,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.055*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1*1.055*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "雪山蜥",
                                    ["图鉴击杀数"] = 7172,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "雪山蜥",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 50
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "黑翼蝠",
                                    ["描述"] = "夜行鬼魅，振翅迅捷，需要小心",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "黑翼蝠",
                                    ["基础等级"] = 2,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.01*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*0.8*1.01*1)^1.1",
                                        ["速度"] = "80 "
                                    },
                                    ["图鉴图标"] = "黑翼蝠",
                                    ["图鉴击杀数"] = 2889,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "黑翼蝠",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 10
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "白雪灵狐",
                                    ["描述"] = "极地灵狐，踏雪无痕，冰息蚀骨",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "白雪灵狐",
                                    ["基础等级"] = 13,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1.1*1.065*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1.1*1.065*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "白雪灵狐",
                                    ["图鉴击杀数"] = 8165,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "白雪灵狐",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 20
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "雪精石",
                                    ["描述"] = "寒髓凝晶，浮空缓移，冰壳难破",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "雪精石",
                                    ["基础等级"] = 18,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.09*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1.5*1.09*1)^1.1",
                                        ["速度"] = "30 "
                                    },
                                    ["图鉴图标"] = "雪精石",
                                    ["图鉴击杀数"] = 10691,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "雪精石",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 20
                            }
                        },
                        ["持续时间"] = 39.456,
                        ["数量"] = 101,
                        ["最大数量"] = 101,
                        ["开始时间"] = 0
                    }
                },
                ["加空间概率"] = 13,
                ["加空间格数"] = 2.2,
                ["属性倍率"] = 1.94,
                ["给予灵蕴"] = 60,
                ["总计经验"] = 825
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "雪山蜥",
                                    ["描述"] = "冰崖隐刃，仍乃小妖，随意应对",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "雪山蜥",
                                    ["基础等级"] = 11,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.055*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1*1.055*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "雪山蜥",
                                    ["图鉴击杀数"] = 7172,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "雪山蜥",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 50
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "黑翼蝠",
                                    ["描述"] = "夜行鬼魅，振翅迅捷，需要小心",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "黑翼蝠",
                                    ["基础等级"] = 2,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.01*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*0.8*1.01*1)^1.1",
                                        ["速度"] = "80 "
                                    },
                                    ["图鉴图标"] = "黑翼蝠",
                                    ["图鉴击杀数"] = 2889,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "黑翼蝠",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 10
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "白雪灵狐",
                                    ["描述"] = "极地灵狐，踏雪无痕，冰息蚀骨",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "白雪灵狐",
                                    ["基础等级"] = 13,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1.1*1.065*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1.1*1.065*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "白雪灵狐",
                                    ["图鉴击杀数"] = 8165,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "白雪灵狐",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 20
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "雪精石",
                                    ["描述"] = "寒髓凝晶，浮空缓移，冰壳难破",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "雪精石",
                                    ["基础等级"] = 18,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.09*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1.5*1.09*1)^1.1",
                                        ["速度"] = "30 "
                                    },
                                    ["图鉴图标"] = "雪精石",
                                    ["图鉴击杀数"] = 10691,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "雪精石",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 20
                            }
                        },
                        ["持续时间"] = 41.5872,
                        ["数量"] = 110,
                        ["最大数量"] = 110,
                        ["开始时间"] = 0
                    },
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "雪山巨人",
                                    ["描述"] = "冰渊霸主，拳撼雪崩，吐息成冰",
                                    ["是首领"] = true,
                                    ["怪物ID"] = "雪山巨人",
                                    ["基础等级"] = 15,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1.2*1.075*20)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1*1.075*20)^1.1",
                                        ["速度"] = "40 "
                                    },
                                    ["图鉴图标"] = "雪山巨人",
                                    ["图鉴击杀数"] = 90,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "雪山巨人",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 1
                            }
                        },
                        ["持续时间"] = 1,
                        ["数量"] = 1,
                        ["最大数量"] = 1,
                        ["开始时间"] = 20.7936
                    }
                },
                ["加空间概率"] = 13,
                ["加空间格数"] = 2.4,
                ["属性倍率"] = 2.088,
                ["给予灵蕴"] = 68,
                ["总计经验"] = 950
            }
        },
        ["完成奖励_1星"] = {
            [""] = 1000
        },
        ["完成奖励_2星"] = {
            [""] = 10
        },
        ["完成奖励_3星"] = {
            [""] = 100
        },
        ["初始必加空间"] = true,
        ["等级"] = 0,
        ["初始背包宽"] = 3,
        ["初始背包高"] = 4,
        ["描述_2星"] = "生命大于30％",
        ["描述_3星"] = "生命大于70％",
        ["怪物等级"] = 1
    }),
    ["2-4"] = Level.New({
        ["关卡ID"] = "2-4",
        ["分类"] = "主线",
        ["关卡波次"] = {
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "雪山蜥",
                                    ["描述"] = "冰崖隐刃，仍乃小妖，随意应对",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "雪山蜥",
                                    ["基础等级"] = 11,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.055*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1*1.055*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "雪山蜥",
                                    ["图鉴击杀数"] = 7172,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "雪山蜥",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 50
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "黑翼蝠",
                                    ["描述"] = "夜行鬼魅，振翅迅捷，需要小心",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "黑翼蝠",
                                    ["基础等级"] = 2,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.01*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*0.8*1.01*1)^1.1",
                                        ["速度"] = "80 "
                                    },
                                    ["图鉴图标"] = "黑翼蝠",
                                    ["图鉴击杀数"] = 2889,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "黑翼蝠",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 10
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "白雪灵狐",
                                    ["描述"] = "极地灵狐，踏雪无痕，冰息蚀骨",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "白雪灵狐",
                                    ["基础等级"] = 13,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1.1*1.065*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1.1*1.065*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "白雪灵狐",
                                    ["图鉴击杀数"] = 8165,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "白雪灵狐",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 20
                            }
                        },
                        ["持续时间"] = 33,
                        ["数量"] = 65,
                        ["最大数量"] = 65,
                        ["开始时间"] = 0
                    }
                },
                ["加空间概率"] = 9,
                ["加空间格数"] = 1.2,
                ["属性倍率"] = 1,
                ["给予灵蕴"] = 19,
                ["总计经验"] = 192
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "雪山蜥",
                                    ["描述"] = "冰崖隐刃，仍乃小妖，随意应对",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "雪山蜥",
                                    ["基础等级"] = 11,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.055*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1*1.055*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "雪山蜥",
                                    ["图鉴击杀数"] = 7172,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "雪山蜥",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 50
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "黑翼蝠",
                                    ["描述"] = "夜行鬼魅，振翅迅捷，需要小心",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "黑翼蝠",
                                    ["基础等级"] = 2,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.01*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*0.8*1.01*1)^1.1",
                                        ["速度"] = "80 "
                                    },
                                    ["图鉴图标"] = "黑翼蝠",
                                    ["图鉴击杀数"] = 2889,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "黑翼蝠",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 10
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "白雪灵狐",
                                    ["描述"] = "极地灵狐，踏雪无痕，冰息蚀骨",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "白雪灵狐",
                                    ["基础等级"] = 13,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1.1*1.065*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1.1*1.065*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "白雪灵狐",
                                    ["图鉴击杀数"] = 8165,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "白雪灵狐",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 20
                            }
                        },
                        ["持续时间"] = 35.5575,
                        ["数量"] = 75,
                        ["最大数量"] = 75,
                        ["开始时间"] = 0
                    }
                },
                ["加空间概率"] = 9,
                ["加空间格数"] = 1.4,
                ["属性倍率"] = 1.155,
                ["给予灵蕴"] = 27,
                ["总计经验"] = 314
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "雪山蜥",
                                    ["描述"] = "冰崖隐刃，仍乃小妖，随意应对",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "雪山蜥",
                                    ["基础等级"] = 11,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.055*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1*1.055*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "雪山蜥",
                                    ["图鉴击杀数"] = 7172,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "雪山蜥",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 50
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "黑翼蝠",
                                    ["描述"] = "夜行鬼魅，振翅迅捷，需要小心",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "黑翼蝠",
                                    ["基础等级"] = 2,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.01*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*0.8*1.01*1)^1.1",
                                        ["速度"] = "80 "
                                    },
                                    ["图鉴图标"] = "黑翼蝠",
                                    ["图鉴击杀数"] = 2889,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "黑翼蝠",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 10
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "白雪灵狐",
                                    ["描述"] = "极地灵狐，踏雪无痕，冰息蚀骨",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "白雪灵狐",
                                    ["基础等级"] = 13,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1.1*1.065*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1.1*1.065*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "白雪灵狐",
                                    ["图鉴击杀数"] = 8165,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "白雪灵狐",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 20
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "浮游石",
                                    ["描述"] = "玄磁奇物，悬空缓行，坚不可摧",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "浮游石",
                                    ["基础等级"] = 8,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.04*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1.5*1.04*1)^1.1",
                                        ["速度"] = "30 "
                                    },
                                    ["图鉴图标"] = "浮游石",
                                    ["图鉴击杀数"] = 5708,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "浮游石",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 10
                            }
                        },
                        ["持续时间"] = 38.1149979,
                        ["数量"] = 85,
                        ["最大数量"] = 85,
                        ["开始时间"] = 0
                    }
                },
                ["加空间概率"] = 9,
                ["加空间格数"] = 1.6,
                ["属性倍率"] = 1.31,
                ["给予灵蕴"] = 35,
                ["总计经验"] = 436
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "雪山蜥",
                                    ["描述"] = "冰崖隐刃，仍乃小妖，随意应对",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "雪山蜥",
                                    ["基础等级"] = 11,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.055*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1*1.055*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "雪山蜥",
                                    ["图鉴击杀数"] = 7172,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "雪山蜥",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 50
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "黑翼蝠",
                                    ["描述"] = "夜行鬼魅，振翅迅捷，需要小心",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "黑翼蝠",
                                    ["基础等级"] = 2,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.01*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*0.8*1.01*1)^1.1",
                                        ["速度"] = "80 "
                                    },
                                    ["图鉴图标"] = "黑翼蝠",
                                    ["图鉴击杀数"] = 2889,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "黑翼蝠",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 10
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "白雪灵狐",
                                    ["描述"] = "极地灵狐，踏雪无痕，冰息蚀骨",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "白雪灵狐",
                                    ["基础等级"] = 13,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1.1*1.065*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1.1*1.065*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "白雪灵狐",
                                    ["图鉴击杀数"] = 8165,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "白雪灵狐",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 20
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "浮游石",
                                    ["描述"] = "玄磁奇物，悬空缓行，坚不可摧",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "浮游石",
                                    ["基础等级"] = 8,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.04*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1.5*1.04*1)^1.1",
                                        ["速度"] = "30 "
                                    },
                                    ["图鉴图标"] = "浮游石",
                                    ["图鉴击杀数"] = 5708,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "浮游石",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 10
                            }
                        },
                        ["持续时间"] = 40.6725,
                        ["数量"] = 95,
                        ["最大数量"] = 95,
                        ["开始时间"] = 0
                    },
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "雪山巨人",
                                    ["描述"] = "冰渊霸主，拳撼雪崩，吐息成冰",
                                    ["是首领"] = true,
                                    ["怪物ID"] = "雪山巨人",
                                    ["基础等级"] = 15,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1.2*1.075*20)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1*1.075*20)^1.1",
                                        ["速度"] = "40 "
                                    },
                                    ["图鉴图标"] = "雪山巨人",
                                    ["图鉴击杀数"] = 90,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "雪山巨人",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 1
                            }
                        },
                        ["持续时间"] = 1,
                        ["数量"] = 1,
                        ["最大数量"] = 1,
                        ["开始时间"] = 20.33625
                    }
                },
                ["加空间概率"] = 9,
                ["加空间格数"] = 1.8,
                ["属性倍率"] = 1.465,
                ["给予灵蕴"] = 43,
                ["总计经验"] = 558
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "雪山蜥",
                                    ["描述"] = "冰崖隐刃，仍乃小妖，随意应对",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "雪山蜥",
                                    ["基础等级"] = 11,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.055*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1*1.055*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "雪山蜥",
                                    ["图鉴击杀数"] = 7172,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "雪山蜥",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 50
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "黑翼蝠",
                                    ["描述"] = "夜行鬼魅，振翅迅捷，需要小心",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "黑翼蝠",
                                    ["基础等级"] = 2,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.01*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*0.8*1.01*1)^1.1",
                                        ["速度"] = "80 "
                                    },
                                    ["图鉴图标"] = "黑翼蝠",
                                    ["图鉴击杀数"] = 2889,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "黑翼蝠",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 10
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "白雪灵狐",
                                    ["描述"] = "极地灵狐，踏雪无痕，冰息蚀骨",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "白雪灵狐",
                                    ["基础等级"] = 13,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1.1*1.065*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1.1*1.065*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "白雪灵狐",
                                    ["图鉴击杀数"] = 8165,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "白雪灵狐",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 20
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "浮游石",
                                    ["描述"] = "玄磁奇物，悬空缓行，坚不可摧",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "浮游石",
                                    ["基础等级"] = 8,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.04*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1.5*1.04*1)^1.1",
                                        ["速度"] = "30 "
                                    },
                                    ["图鉴图标"] = "浮游石",
                                    ["图鉴击杀数"] = 5708,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "浮游石",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 10
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "雪精石",
                                    ["描述"] = "寒髓凝晶，浮空缓移，冰壳难破",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "雪精石",
                                    ["基础等级"] = 18,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.09*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1.5*1.09*1)^1.1",
                                        ["速度"] = "30 "
                                    },
                                    ["图鉴图标"] = "雪精石",
                                    ["图鉴击杀数"] = 10691,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "雪精石",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 15
                            }
                        },
                        ["持续时间"] = 43.23,
                        ["数量"] = 105,
                        ["最大数量"] = 105,
                        ["开始时间"] = 0
                    }
                },
                ["加空间概率"] = 9,
                ["加空间格数"] = 2,
                ["属性倍率"] = 1.82,
                ["给予灵蕴"] = 51,
                ["总计经验"] = 680
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "雪山蜥",
                                    ["描述"] = "冰崖隐刃，仍乃小妖，随意应对",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "雪山蜥",
                                    ["基础等级"] = 11,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.055*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1*1.055*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "雪山蜥",
                                    ["图鉴击杀数"] = 7172,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "雪山蜥",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 50
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "黑翼蝠",
                                    ["描述"] = "夜行鬼魅，振翅迅捷，需要小心",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "黑翼蝠",
                                    ["基础等级"] = 2,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.01*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*0.8*1.01*1)^1.1",
                                        ["速度"] = "80 "
                                    },
                                    ["图鉴图标"] = "黑翼蝠",
                                    ["图鉴击杀数"] = 2889,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "黑翼蝠",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 10
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "白雪灵狐",
                                    ["描述"] = "极地灵狐，踏雪无痕，冰息蚀骨",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "白雪灵狐",
                                    ["基础等级"] = 13,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1.1*1.065*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1.1*1.065*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "白雪灵狐",
                                    ["图鉴击杀数"] = 8165,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "白雪灵狐",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 20
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "浮游石",
                                    ["描述"] = "玄磁奇物，悬空缓行，坚不可摧",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "浮游石",
                                    ["基础等级"] = 8,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.04*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1.5*1.04*1)^1.1",
                                        ["速度"] = "30 "
                                    },
                                    ["图鉴图标"] = "浮游石",
                                    ["图鉴击杀数"] = 5708,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "浮游石",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 10
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "雪精石",
                                    ["描述"] = "寒髓凝晶，浮空缓移，冰壳难破",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "雪精石",
                                    ["基础等级"] = 18,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.09*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1.5*1.09*1)^1.1",
                                        ["速度"] = "30 "
                                    },
                                    ["图鉴图标"] = "雪精石",
                                    ["图鉴击杀数"] = 10691,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "雪精石",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 15
                            }
                        },
                        ["持续时间"] = 45.7875,
                        ["数量"] = 115,
                        ["最大数量"] = 115,
                        ["开始时间"] = 0
                    }
                },
                ["加空间概率"] = 9,
                ["加空间格数"] = 2.2,
                ["属性倍率"] = 1.975,
                ["给予灵蕴"] = 59,
                ["总计经验"] = 802
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "雪山蜥",
                                    ["描述"] = "冰崖隐刃，仍乃小妖，随意应对",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "雪山蜥",
                                    ["基础等级"] = 11,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.055*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1*1.055*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "雪山蜥",
                                    ["图鉴击杀数"] = 7172,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "雪山蜥",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 50
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "黑翼蝠",
                                    ["描述"] = "夜行鬼魅，振翅迅捷，需要小心",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "黑翼蝠",
                                    ["基础等级"] = 2,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.01*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*0.8*1.01*1)^1.1",
                                        ["速度"] = "80 "
                                    },
                                    ["图鉴图标"] = "黑翼蝠",
                                    ["图鉴击杀数"] = 2889,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "黑翼蝠",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 10
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "白雪灵狐",
                                    ["描述"] = "极地灵狐，踏雪无痕，冰息蚀骨",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "白雪灵狐",
                                    ["基础等级"] = 13,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1.1*1.065*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1.1*1.065*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "白雪灵狐",
                                    ["图鉴击杀数"] = 8165,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "白雪灵狐",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 20
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "浮游石",
                                    ["描述"] = "玄磁奇物，悬空缓行，坚不可摧",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "浮游石",
                                    ["基础等级"] = 8,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.04*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1.5*1.04*1)^1.1",
                                        ["速度"] = "30 "
                                    },
                                    ["图鉴图标"] = "浮游石",
                                    ["图鉴击杀数"] = 5708,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "浮游石",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 10
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "雪精石",
                                    ["描述"] = "寒髓凝晶，浮空缓移，冰壳难破",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "雪精石",
                                    ["基础等级"] = 18,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.09*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1.5*1.09*1)^1.1",
                                        ["速度"] = "30 "
                                    },
                                    ["图鉴图标"] = "雪精石",
                                    ["图鉴击杀数"] = 10691,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "雪精石",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 15
                            }
                        },
                        ["持续时间"] = 48.345,
                        ["数量"] = 125,
                        ["最大数量"] = 125,
                        ["开始时间"] = 0
                    },
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "晶石傀儡",
                                    ["描述"] = "玄冰秘精，通体金刚，碎敌须臾",
                                    ["是首领"] = true,
                                    ["怪物ID"] = "晶石傀儡",
                                    ["基础等级"] = 20,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.1*20)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1*1.1*20)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "晶石傀儡",
                                    ["图鉴击杀数"] = 115,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "晶石傀儡",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 1
                            }
                        },
                        ["持续时间"] = 1,
                        ["数量"] = 1,
                        ["最大数量"] = 1,
                        ["开始时间"] = 24.1725
                    }
                },
                ["加空间概率"] = 9,
                ["加空间格数"] = 2.4,
                ["属性倍率"] = 2.13,
                ["给予灵蕴"] = 67,
                ["总计经验"] = 924
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "雪山蜥",
                                    ["描述"] = "冰崖隐刃，仍乃小妖，随意应对",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "雪山蜥",
                                    ["基础等级"] = 11,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.055*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1*1.055*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "雪山蜥",
                                    ["图鉴击杀数"] = 7172,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "雪山蜥",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 50
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "黑翼蝠",
                                    ["描述"] = "夜行鬼魅，振翅迅捷，需要小心",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "黑翼蝠",
                                    ["基础等级"] = 2,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.01*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*0.8*1.01*1)^1.1",
                                        ["速度"] = "80 "
                                    },
                                    ["图鉴图标"] = "黑翼蝠",
                                    ["图鉴击杀数"] = 2889,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "黑翼蝠",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 10
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "白雪灵狐",
                                    ["描述"] = "极地灵狐，踏雪无痕，冰息蚀骨",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "白雪灵狐",
                                    ["基础等级"] = 13,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1.1*1.065*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1.1*1.065*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "白雪灵狐",
                                    ["图鉴击杀数"] = 8165,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "白雪灵狐",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 20
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "浮游石",
                                    ["描述"] = "玄磁奇物，悬空缓行，坚不可摧",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "浮游石",
                                    ["基础等级"] = 8,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.04*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1.5*1.04*1)^1.1",
                                        ["速度"] = "30 "
                                    },
                                    ["图鉴图标"] = "浮游石",
                                    ["图鉴击杀数"] = 5708,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "浮游石",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 10
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "雪精石",
                                    ["描述"] = "寒髓凝晶，浮空缓移，冰壳难破",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "雪精石",
                                    ["基础等级"] = 18,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.09*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1.5*1.09*1)^1.1",
                                        ["速度"] = "30 "
                                    },
                                    ["图鉴图标"] = "雪精石",
                                    ["图鉴击杀数"] = 10691,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "雪精石",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 15
                            }
                        },
                        ["持续时间"] = 50.9025,
                        ["数量"] = 136,
                        ["最大数量"] = 136,
                        ["开始时间"] = 0
                    }
                },
                ["加空间概率"] = 9,
                ["加空间格数"] = 2.6,
                ["属性倍率"] = 2.285,
                ["给予灵蕴"] = 75,
                ["总计经验"] = 1046
            }
        },
        ["完成奖励_1星"] = {
            [""] = 1000
        },
        ["完成奖励_2星"] = {
            [""] = 5
        },
        ["完成奖励_3星"] = {
            [""] = 100
        },
        ["初始必加空间"] = true,
        ["等级"] = 19,
        ["初始背包宽"] = 3,
        ["初始背包高"] = 3,
        ["描述_2星"] = "生命大于30％",
        ["描述_3星"] = "生命大于70％",
        ["怪物等级"] = 1
    }),
    ["2-5"] = Level.New({
        ["关卡ID"] = "2-5",
        ["分类"] = "主线",
        ["关卡波次"] = {
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "雪山蜥",
                                    ["描述"] = "冰崖隐刃，仍乃小妖，随意应对",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "雪山蜥",
                                    ["基础等级"] = 11,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.055*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1*1.055*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "雪山蜥",
                                    ["图鉴击杀数"] = 7172,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "雪山蜥",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 50
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "黑翼蝠",
                                    ["描述"] = "夜行鬼魅，振翅迅捷，需要小心",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "黑翼蝠",
                                    ["基础等级"] = 2,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.01*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*0.8*1.01*1)^1.1",
                                        ["速度"] = "80 "
                                    },
                                    ["图鉴图标"] = "黑翼蝠",
                                    ["图鉴击杀数"] = 2889,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "黑翼蝠",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 10
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "白雪灵狐",
                                    ["描述"] = "极地灵狐，踏雪无痕，冰息蚀骨",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "白雪灵狐",
                                    ["基础等级"] = 13,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1.1*1.065*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1.1*1.065*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "白雪灵狐",
                                    ["图鉴击杀数"] = 8165,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "白雪灵狐",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 20
                            }
                        },
                        ["持续时间"] = 36,
                        ["数量"] = 70,
                        ["最大数量"] = 70,
                        ["开始时间"] = 0
                    }
                },
                ["加空间概率"] = 9,
                ["加空间格数"] = 1.2,
                ["属性倍率"] = 1,
                ["给予灵蕴"] = 18,
                ["总计经验"] = 185
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "雪山蜥",
                                    ["描述"] = "冰崖隐刃，仍乃小妖，随意应对",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "雪山蜥",
                                    ["基础等级"] = 11,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.055*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1*1.055*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "雪山蜥",
                                    ["图鉴击杀数"] = 7172,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "雪山蜥",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 50
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "黑翼蝠",
                                    ["描述"] = "夜行鬼魅，振翅迅捷，需要小心",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "黑翼蝠",
                                    ["基础等级"] = 2,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.01*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*0.8*1.01*1)^1.1",
                                        ["速度"] = "80 "
                                    },
                                    ["图鉴图标"] = "黑翼蝠",
                                    ["图鉴击杀数"] = 2889,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "黑翼蝠",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 10
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "白雪灵狐",
                                    ["描述"] = "极地灵狐，踏雪无痕，冰息蚀骨",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "白雪灵狐",
                                    ["基础等级"] = 13,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1.1*1.065*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1.1*1.065*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "白雪灵狐",
                                    ["图鉴击杀数"] = 8165,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "白雪灵狐",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 20
                            }
                        },
                        ["持续时间"] = 38.88,
                        ["数量"] = 81,
                        ["最大数量"] = 81,
                        ["开始时间"] = 0
                    },
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "岩石傀儡",
                                    ["描述"] = "镇守古阵，身躯如山，拳崩岩裂",
                                    ["是首领"] = true,
                                    ["怪物ID"] = "岩石傀儡",
                                    ["基础等级"] = 5,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.025*20)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1*1.025*20)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "岩石傀儡",
                                    ["图鉴击杀数"] = 42,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "岩石傀儡",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 1
                            }
                        },
                        ["持续时间"] = 1,
                        ["数量"] = 1,
                        ["最大数量"] = 1,
                        ["开始时间"] = 19.44
                    }
                },
                ["加空间概率"] = 9,
                ["加空间格数"] = 1.4,
                ["属性倍率"] = 1.16,
                ["给予灵蕴"] = 25,
                ["总计经验"] = 304
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "雪山蜥",
                                    ["描述"] = "冰崖隐刃，仍乃小妖，随意应对",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "雪山蜥",
                                    ["基础等级"] = 11,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.055*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1*1.055*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "雪山蜥",
                                    ["图鉴击杀数"] = 7172,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "雪山蜥",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 50
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "黑翼蝠",
                                    ["描述"] = "夜行鬼魅，振翅迅捷，需要小心",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "黑翼蝠",
                                    ["基础等级"] = 2,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.01*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*0.8*1.01*1)^1.1",
                                        ["速度"] = "80 "
                                    },
                                    ["图鉴图标"] = "黑翼蝠",
                                    ["图鉴击杀数"] = 2889,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "黑翼蝠",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 10
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "白雪灵狐",
                                    ["描述"] = "极地灵狐，踏雪无痕，冰息蚀骨",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "白雪灵狐",
                                    ["基础等级"] = 13,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1.1*1.065*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1.1*1.065*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "白雪灵狐",
                                    ["图鉴击杀数"] = 8165,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "白雪灵狐",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 20
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "浮游石",
                                    ["描述"] = "玄磁奇物，悬空缓行，坚不可摧",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "浮游石",
                                    ["基础等级"] = 8,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.04*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1.5*1.04*1)^1.1",
                                        ["速度"] = "30 "
                                    },
                                    ["图鉴图标"] = "浮游石",
                                    ["图鉴击杀数"] = 5708,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "浮游石",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 10
                            }
                        },
                        ["持续时间"] = 41.7600021,
                        ["数量"] = 92,
                        ["最大数量"] = 92,
                        ["开始时间"] = 0
                    }
                },
                ["加空间概率"] = 9,
                ["加空间格数"] = 1.6,
                ["属性倍率"] = 1.31999993,
                ["给予灵蕴"] = 32,
                ["总计经验"] = 423
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "雪山蜥",
                                    ["描述"] = "冰崖隐刃，仍乃小妖，随意应对",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "雪山蜥",
                                    ["基础等级"] = 11,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.055*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1*1.055*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "雪山蜥",
                                    ["图鉴击杀数"] = 7172,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "雪山蜥",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 50
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "黑翼蝠",
                                    ["描述"] = "夜行鬼魅，振翅迅捷，需要小心",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "黑翼蝠",
                                    ["基础等级"] = 2,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.01*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*0.8*1.01*1)^1.1",
                                        ["速度"] = "80 "
                                    },
                                    ["图鉴图标"] = "黑翼蝠",
                                    ["图鉴击杀数"] = 2889,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "黑翼蝠",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 10
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "白雪灵狐",
                                    ["描述"] = "极地灵狐，踏雪无痕，冰息蚀骨",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "白雪灵狐",
                                    ["基础等级"] = 13,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1.1*1.065*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1.1*1.065*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "白雪灵狐",
                                    ["图鉴击杀数"] = 8165,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "白雪灵狐",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 20
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "浮游石",
                                    ["描述"] = "玄磁奇物，悬空缓行，坚不可摧",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "浮游石",
                                    ["基础等级"] = 8,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.04*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1.5*1.04*1)^1.1",
                                        ["速度"] = "30 "
                                    },
                                    ["图鉴图标"] = "浮游石",
                                    ["图鉴击杀数"] = 5708,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "浮游石",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 10
                            }
                        },
                        ["持续时间"] = 44.64,
                        ["数量"] = 104,
                        ["最大数量"] = 104,
                        ["开始时间"] = 0
                    },
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "岩石傀儡",
                                    ["描述"] = "镇守古阵，身躯如山，拳崩岩裂",
                                    ["是首领"] = true,
                                    ["怪物ID"] = "岩石傀儡",
                                    ["基础等级"] = 5,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.025*20)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1*1.025*20)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "岩石傀儡",
                                    ["图鉴击杀数"] = 42,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "岩石傀儡",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 1
                            }
                        },
                        ["持续时间"] = 1,
                        ["数量"] = 1,
                        ["最大数量"] = 1,
                        ["开始时间"] = 22.32
                    }
                },
                ["加空间概率"] = 9,
                ["加空间格数"] = 1.8,
                ["属性倍率"] = 1.48,
                ["给予灵蕴"] = 39,
                ["总计经验"] = 542
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "雪山蜥",
                                    ["描述"] = "冰崖隐刃，仍乃小妖，随意应对",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "雪山蜥",
                                    ["基础等级"] = 11,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.055*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1*1.055*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "雪山蜥",
                                    ["图鉴击杀数"] = 7172,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "雪山蜥",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 50
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "黑翼蝠",
                                    ["描述"] = "夜行鬼魅，振翅迅捷，需要小心",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "黑翼蝠",
                                    ["基础等级"] = 2,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.01*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*0.8*1.01*1)^1.1",
                                        ["速度"] = "80 "
                                    },
                                    ["图鉴图标"] = "黑翼蝠",
                                    ["图鉴击杀数"] = 2889,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "黑翼蝠",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 10
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "白雪灵狐",
                                    ["描述"] = "极地灵狐，踏雪无痕，冰息蚀骨",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "白雪灵狐",
                                    ["基础等级"] = 13,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1.1*1.065*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1.1*1.065*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "白雪灵狐",
                                    ["图鉴击杀数"] = 8165,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "白雪灵狐",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 20
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "浮游石",
                                    ["描述"] = "玄磁奇物，悬空缓行，坚不可摧",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "浮游石",
                                    ["基础等级"] = 8,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.04*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1.5*1.04*1)^1.1",
                                        ["速度"] = "30 "
                                    },
                                    ["图鉴图标"] = "浮游石",
                                    ["图鉴击杀数"] = 5708,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "浮游石",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 10
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "雪精石",
                                    ["描述"] = "寒髓凝晶，浮空缓移，冰壳难破",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "雪精石",
                                    ["基础等级"] = 18,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.09*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1.5*1.09*1)^1.1",
                                        ["速度"] = "30 "
                                    },
                                    ["图鉴图标"] = "雪精石",
                                    ["图鉴击杀数"] = 10691,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "雪精石",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 15
                            }
                        },
                        ["持续时间"] = 47.52,
                        ["数量"] = 115,
                        ["最大数量"] = 115,
                        ["开始时间"] = 0
                    }
                },
                ["加空间概率"] = 9,
                ["加空间格数"] = 2,
                ["属性倍率"] = 1.84,
                ["给予灵蕴"] = 46,
                ["总计经验"] = 661
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "雪山蜥",
                                    ["描述"] = "冰崖隐刃，仍乃小妖，随意应对",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "雪山蜥",
                                    ["基础等级"] = 11,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.055*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1*1.055*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "雪山蜥",
                                    ["图鉴击杀数"] = 7172,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "雪山蜥",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 50
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "黑翼蝠",
                                    ["描述"] = "夜行鬼魅，振翅迅捷，需要小心",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "黑翼蝠",
                                    ["基础等级"] = 2,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.01*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*0.8*1.01*1)^1.1",
                                        ["速度"] = "80 "
                                    },
                                    ["图鉴图标"] = "黑翼蝠",
                                    ["图鉴击杀数"] = 2889,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "黑翼蝠",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 10
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "白雪灵狐",
                                    ["描述"] = "极地灵狐，踏雪无痕，冰息蚀骨",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "白雪灵狐",
                                    ["基础等级"] = 13,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1.1*1.065*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1.1*1.065*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "白雪灵狐",
                                    ["图鉴击杀数"] = 8165,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "白雪灵狐",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 20
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "浮游石",
                                    ["描述"] = "玄磁奇物，悬空缓行，坚不可摧",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "浮游石",
                                    ["基础等级"] = 8,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.04*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1.5*1.04*1)^1.1",
                                        ["速度"] = "30 "
                                    },
                                    ["图鉴图标"] = "浮游石",
                                    ["图鉴击杀数"] = 5708,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "浮游石",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 10
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "雪精石",
                                    ["描述"] = "寒髓凝晶，浮空缓移，冰壳难破",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "雪精石",
                                    ["基础等级"] = 18,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.09*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1.5*1.09*1)^1.1",
                                        ["速度"] = "30 "
                                    },
                                    ["图鉴图标"] = "雪精石",
                                    ["图鉴击杀数"] = 10691,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "雪精石",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 15
                            }
                        },
                        ["持续时间"] = 50.4,
                        ["数量"] = 126,
                        ["最大数量"] = 126,
                        ["开始时间"] = 0
                    },
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "雪山巨人",
                                    ["描述"] = "冰渊霸主，拳撼雪崩，吐息成冰",
                                    ["是首领"] = true,
                                    ["怪物ID"] = "雪山巨人",
                                    ["基础等级"] = 15,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1.2*1.075*20)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1*1.075*20)^1.1",
                                        ["速度"] = "40 "
                                    },
                                    ["图鉴图标"] = "雪山巨人",
                                    ["图鉴击杀数"] = 90,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "雪山巨人",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 1
                            }
                        },
                        ["持续时间"] = 1,
                        ["数量"] = 1,
                        ["最大数量"] = 1,
                        ["开始时间"] = 25.2
                    }
                },
                ["加空间概率"] = 9,
                ["加空间格数"] = 2.2,
                ["属性倍率"] = 2,
                ["给予灵蕴"] = 53,
                ["总计经验"] = 780
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "雪山蜥",
                                    ["描述"] = "冰崖隐刃，仍乃小妖，随意应对",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "雪山蜥",
                                    ["基础等级"] = 11,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.055*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1*1.055*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "雪山蜥",
                                    ["图鉴击杀数"] = 7172,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "雪山蜥",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 50
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "黑翼蝠",
                                    ["描述"] = "夜行鬼魅，振翅迅捷，需要小心",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "黑翼蝠",
                                    ["基础等级"] = 2,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.01*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*0.8*1.01*1)^1.1",
                                        ["速度"] = "80 "
                                    },
                                    ["图鉴图标"] = "黑翼蝠",
                                    ["图鉴击杀数"] = 2889,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "黑翼蝠",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 10
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "白雪灵狐",
                                    ["描述"] = "极地灵狐，踏雪无痕，冰息蚀骨",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "白雪灵狐",
                                    ["基础等级"] = 13,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1.1*1.065*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1.1*1.065*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "白雪灵狐",
                                    ["图鉴击杀数"] = 8165,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "白雪灵狐",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 20
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "浮游石",
                                    ["描述"] = "玄磁奇物，悬空缓行，坚不可摧",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "浮游石",
                                    ["基础等级"] = 8,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.04*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1.5*1.04*1)^1.1",
                                        ["速度"] = "30 "
                                    },
                                    ["图鉴图标"] = "浮游石",
                                    ["图鉴击杀数"] = 5708,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "浮游石",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 10
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "雪精石",
                                    ["描述"] = "寒髓凝晶，浮空缓移，冰壳难破",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "雪精石",
                                    ["基础等级"] = 18,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.09*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1.5*1.09*1)^1.1",
                                        ["速度"] = "30 "
                                    },
                                    ["图鉴图标"] = "雪精石",
                                    ["图鉴击杀数"] = 10691,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "雪精石",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 15
                            }
                        },
                        ["持续时间"] = 53.28,
                        ["数量"] = 137,
                        ["最大数量"] = 137,
                        ["开始时间"] = 0
                    }
                },
                ["加空间概率"] = 9,
                ["加空间格数"] = 2.4,
                ["属性倍率"] = 2.16,
                ["给予灵蕴"] = 60,
                ["总计经验"] = 899
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "雪山蜥",
                                    ["描述"] = "冰崖隐刃，仍乃小妖，随意应对",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "雪山蜥",
                                    ["基础等级"] = 11,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.055*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1*1.055*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "雪山蜥",
                                    ["图鉴击杀数"] = 7172,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "雪山蜥",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 50
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "黑翼蝠",
                                    ["描述"] = "夜行鬼魅，振翅迅捷，需要小心",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "黑翼蝠",
                                    ["基础等级"] = 2,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.01*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*0.8*1.01*1)^1.1",
                                        ["速度"] = "80 "
                                    },
                                    ["图鉴图标"] = "黑翼蝠",
                                    ["图鉴击杀数"] = 2889,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "黑翼蝠",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 10
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "白雪灵狐",
                                    ["描述"] = "极地灵狐，踏雪无痕，冰息蚀骨",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "白雪灵狐",
                                    ["基础等级"] = 13,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1.1*1.065*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1.1*1.065*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "白雪灵狐",
                                    ["图鉴击杀数"] = 8165,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "白雪灵狐",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 20
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "浮游石",
                                    ["描述"] = "玄磁奇物，悬空缓行，坚不可摧",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "浮游石",
                                    ["基础等级"] = 8,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.04*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1.5*1.04*1)^1.1",
                                        ["速度"] = "30 "
                                    },
                                    ["图鉴图标"] = "浮游石",
                                    ["图鉴击杀数"] = 5708,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "浮游石",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 10
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "雪精石",
                                    ["描述"] = "寒髓凝晶，浮空缓移，冰壳难破",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "雪精石",
                                    ["基础等级"] = 18,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.09*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1.5*1.09*1)^1.1",
                                        ["速度"] = "30 "
                                    },
                                    ["图鉴图标"] = "雪精石",
                                    ["图鉴击杀数"] = 10691,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "雪精石",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 15
                            }
                        },
                        ["持续时间"] = 56.16,
                        ["数量"] = 148,
                        ["最大数量"] = 148,
                        ["开始时间"] = 0
                    },
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "晶石傀儡",
                                    ["描述"] = "玄冰秘精，通体金刚，碎敌须臾",
                                    ["是首领"] = true,
                                    ["怪物ID"] = "晶石傀儡",
                                    ["基础等级"] = 20,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.1*20)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1*1.1*20)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "晶石傀儡",
                                    ["图鉴击杀数"] = 115,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "晶石傀儡",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 1
                            }
                        },
                        ["持续时间"] = 1,
                        ["数量"] = 1,
                        ["最大数量"] = 1,
                        ["开始时间"] = 28.08
                    }
                },
                ["加空间概率"] = 9,
                ["加空间格数"] = 2.6,
                ["属性倍率"] = 2.32,
                ["给予灵蕴"] = 67,
                ["总计经验"] = 1018
            }
        },
        ["完成奖励_1星"] = {
            [""] = 1000
        },
        ["完成奖励_2星"] = {
            [""] = 5
        },
        ["完成奖励_3星"] = {
            [""] = 100
        },
        ["初始必加空间"] = true,
        ["等级"] = 21,
        ["初始背包宽"] = 3,
        ["初始背包高"] = 3,
        ["描述_2星"] = "生命大于30％",
        ["描述_3星"] = "生命大于70％",
        ["怪物等级"] = 1
    }),
    ["2-6"] = Level.New({
        ["关卡ID"] = "2-6",
        ["分类"] = "主线",
        ["关卡波次"] = {
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "雪山蜥",
                                    ["描述"] = "冰崖隐刃，仍乃小妖，随意应对",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "雪山蜥",
                                    ["基础等级"] = 11,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.055*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1*1.055*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "雪山蜥",
                                    ["图鉴击杀数"] = 7172,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "雪山蜥",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 50
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "黑翼蝠",
                                    ["描述"] = "夜行鬼魅，振翅迅捷，需要小心",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "黑翼蝠",
                                    ["基础等级"] = 2,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.01*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*0.8*1.01*1)^1.1",
                                        ["速度"] = "80 "
                                    },
                                    ["图鉴图标"] = "黑翼蝠",
                                    ["图鉴击杀数"] = 2889,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "黑翼蝠",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 10
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "白雪灵狐",
                                    ["描述"] = "极地灵狐，踏雪无痕，冰息蚀骨",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "白雪灵狐",
                                    ["基础等级"] = 13,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1.1*1.065*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1.1*1.065*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "白雪灵狐",
                                    ["图鉴击杀数"] = 8165,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "白雪灵狐",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 21
                            }
                        },
                        ["持续时间"] = 42,
                        ["数量"] = 80,
                        ["最大数量"] = 80,
                        ["开始时间"] = 0
                    }
                },
                ["加空间概率"] = 10,
                ["加空间格数"] = 1.3,
                ["属性倍率"] = 1,
                ["给予灵蕴"] = 17,
                ["总计经验"] = 179
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "雪山蜥",
                                    ["描述"] = "冰崖隐刃，仍乃小妖，随意应对",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "雪山蜥",
                                    ["基础等级"] = 11,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.055*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1*1.055*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "雪山蜥",
                                    ["图鉴击杀数"] = 7172,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "雪山蜥",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 50
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "黑翼蝠",
                                    ["描述"] = "夜行鬼魅，振翅迅捷，需要小心",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "黑翼蝠",
                                    ["基础等级"] = 2,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.01*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*0.8*1.01*1)^1.1",
                                        ["速度"] = "80 "
                                    },
                                    ["图鉴图标"] = "黑翼蝠",
                                    ["图鉴击杀数"] = 2889,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "黑翼蝠",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 10
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "白雪灵狐",
                                    ["描述"] = "极地灵狐，踏雪无痕，冰息蚀骨",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "白雪灵狐",
                                    ["基础等级"] = 13,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1.1*1.065*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1.1*1.065*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "白雪灵狐",
                                    ["图鉴击杀数"] = 8165,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "白雪灵狐",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 21
                            }
                        },
                        ["持续时间"] = 45.57,
                        ["数量"] = 94,
                        ["最大数量"] = 94,
                        ["开始时间"] = 0
                    },
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "岩石傀儡",
                                    ["描述"] = "镇守古阵，身躯如山，拳崩岩裂",
                                    ["是首领"] = true,
                                    ["怪物ID"] = "岩石傀儡",
                                    ["基础等级"] = 5,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.025*20)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1*1.025*20)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "岩石傀儡",
                                    ["图鉴击杀数"] = 42,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "岩石傀儡",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 1
                            }
                        },
                        ["持续时间"] = 1,
                        ["数量"] = 1,
                        ["最大数量"] = 1,
                        ["开始时间"] = 22.785
                    }
                },
                ["加空间概率"] = 10,
                ["加空间格数"] = 1.6,
                ["属性倍率"] = 1.17,
                ["给予灵蕴"] = 24,
                ["总计经验"] = 295
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "雪山蜥",
                                    ["描述"] = "冰崖隐刃，仍乃小妖，随意应对",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "雪山蜥",
                                    ["基础等级"] = 11,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.055*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1*1.055*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "雪山蜥",
                                    ["图鉴击杀数"] = 7172,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "雪山蜥",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 50
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "黑翼蝠",
                                    ["描述"] = "夜行鬼魅，振翅迅捷，需要小心",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "黑翼蝠",
                                    ["基础等级"] = 2,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.01*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*0.8*1.01*1)^1.1",
                                        ["速度"] = "80 "
                                    },
                                    ["图鉴图标"] = "黑翼蝠",
                                    ["图鉴击杀数"] = 2889,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "黑翼蝠",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 10
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "白雪灵狐",
                                    ["描述"] = "极地灵狐，踏雪无痕，冰息蚀骨",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "白雪灵狐",
                                    ["基础等级"] = 13,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1.1*1.065*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1.1*1.065*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "白雪灵狐",
                                    ["图鉴击杀数"] = 8165,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "白雪灵狐",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 21
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "浮游石",
                                    ["描述"] = "玄磁奇物，悬空缓行，坚不可摧",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "浮游石",
                                    ["基础等级"] = 8,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.04*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1.5*1.04*1)^1.1",
                                        ["速度"] = "30 "
                                    },
                                    ["图鉴图标"] = "浮游石",
                                    ["图鉴击杀数"] = 5708,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "浮游石",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 10
                            }
                        },
                        ["持续时间"] = 49.14,
                        ["数量"] = 107,
                        ["最大数量"] = 107,
                        ["开始时间"] = 0
                    }
                },
                ["加空间概率"] = 10,
                ["加空间格数"] = 1.9,
                ["属性倍率"] = 1.34,
                ["给予灵蕴"] = 31,
                ["总计经验"] = 411
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "雪山蜥",
                                    ["描述"] = "冰崖隐刃，仍乃小妖，随意应对",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "雪山蜥",
                                    ["基础等级"] = 11,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.055*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1*1.055*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "雪山蜥",
                                    ["图鉴击杀数"] = 7172,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "雪山蜥",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 50
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "黑翼蝠",
                                    ["描述"] = "夜行鬼魅，振翅迅捷，需要小心",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "黑翼蝠",
                                    ["基础等级"] = 2,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.01*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*0.8*1.01*1)^1.1",
                                        ["速度"] = "80 "
                                    },
                                    ["图鉴图标"] = "黑翼蝠",
                                    ["图鉴击杀数"] = 2889,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "黑翼蝠",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 10
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "白雪灵狐",
                                    ["描述"] = "极地灵狐，踏雪无痕，冰息蚀骨",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "白雪灵狐",
                                    ["基础等级"] = 13,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1.1*1.065*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1.1*1.065*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "白雪灵狐",
                                    ["图鉴击杀数"] = 8165,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "白雪灵狐",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 21
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "浮游石",
                                    ["描述"] = "玄磁奇物，悬空缓行，坚不可摧",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "浮游石",
                                    ["基础等级"] = 8,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.04*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1.5*1.04*1)^1.1",
                                        ["速度"] = "30 "
                                    },
                                    ["图鉴图标"] = "浮游石",
                                    ["图鉴击杀数"] = 5708,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "浮游石",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 10
                            }
                        },
                        ["持续时间"] = 52.71,
                        ["数量"] = 121,
                        ["最大数量"] = 121,
                        ["开始时间"] = 0
                    },
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "雪山巨人",
                                    ["描述"] = "冰渊霸主，拳撼雪崩，吐息成冰",
                                    ["是首领"] = true,
                                    ["怪物ID"] = "雪山巨人",
                                    ["基础等级"] = 15,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1.2*1.075*20)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1*1.075*20)^1.1",
                                        ["速度"] = "40 "
                                    },
                                    ["图鉴图标"] = "雪山巨人",
                                    ["图鉴击杀数"] = 90,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "雪山巨人",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 1
                            }
                        },
                        ["持续时间"] = 1,
                        ["数量"] = 1,
                        ["最大数量"] = 1,
                        ["开始时间"] = 26.355
                    }
                },
                ["加空间概率"] = 10,
                ["加空间格数"] = 2.2,
                ["属性倍率"] = 1.51,
                ["给予灵蕴"] = 38,
                ["总计经验"] = 527
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "雪山蜥",
                                    ["描述"] = "冰崖隐刃，仍乃小妖，随意应对",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "雪山蜥",
                                    ["基础等级"] = 11,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.055*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1*1.055*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "雪山蜥",
                                    ["图鉴击杀数"] = 7172,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "雪山蜥",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 50
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "黑翼蝠",
                                    ["描述"] = "夜行鬼魅，振翅迅捷，需要小心",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "黑翼蝠",
                                    ["基础等级"] = 2,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.01*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*0.8*1.01*1)^1.1",
                                        ["速度"] = "80 "
                                    },
                                    ["图鉴图标"] = "黑翼蝠",
                                    ["图鉴击杀数"] = 2889,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "黑翼蝠",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 10
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "白雪灵狐",
                                    ["描述"] = "极地灵狐，踏雪无痕，冰息蚀骨",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "白雪灵狐",
                                    ["基础等级"] = 13,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1.1*1.065*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1.1*1.065*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "白雪灵狐",
                                    ["图鉴击杀数"] = 8165,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "白雪灵狐",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 21
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "浮游石",
                                    ["描述"] = "玄磁奇物，悬空缓行，坚不可摧",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "浮游石",
                                    ["基础等级"] = 8,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.04*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1.5*1.04*1)^1.1",
                                        ["速度"] = "30 "
                                    },
                                    ["图鉴图标"] = "浮游石",
                                    ["图鉴击杀数"] = 5708,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "浮游石",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 10
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "雪精石",
                                    ["描述"] = "寒髓凝晶，浮空缓移，冰壳难破",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "雪精石",
                                    ["基础等级"] = 18,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.09*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1.5*1.09*1)^1.1",
                                        ["速度"] = "30 "
                                    },
                                    ["图鉴图标"] = "雪精石",
                                    ["图鉴击杀数"] = 10691,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "雪精石",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 15
                            }
                        },
                        ["持续时间"] = 56.28,
                        ["数量"] = 134,
                        ["最大数量"] = 134,
                        ["开始时间"] = 0
                    }
                },
                ["加空间概率"] = 10,
                ["加空间格数"] = 2.5,
                ["属性倍率"] = 1.88000011,
                ["给予灵蕴"] = 45,
                ["总计经验"] = 643
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "雪山蜥",
                                    ["描述"] = "冰崖隐刃，仍乃小妖，随意应对",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "雪山蜥",
                                    ["基础等级"] = 11,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.055*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1*1.055*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "雪山蜥",
                                    ["图鉴击杀数"] = 7172,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "雪山蜥",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 50
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "黑翼蝠",
                                    ["描述"] = "夜行鬼魅，振翅迅捷，需要小心",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "黑翼蝠",
                                    ["基础等级"] = 2,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.01*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*0.8*1.01*1)^1.1",
                                        ["速度"] = "80 "
                                    },
                                    ["图鉴图标"] = "黑翼蝠",
                                    ["图鉴击杀数"] = 2889,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "黑翼蝠",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 10
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "白雪灵狐",
                                    ["描述"] = "极地灵狐，踏雪无痕，冰息蚀骨",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "白雪灵狐",
                                    ["基础等级"] = 13,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1.1*1.065*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1.1*1.065*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "白雪灵狐",
                                    ["图鉴击杀数"] = 8165,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "白雪灵狐",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 21
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "浮游石",
                                    ["描述"] = "玄磁奇物，悬空缓行，坚不可摧",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "浮游石",
                                    ["基础等级"] = 8,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.04*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1.5*1.04*1)^1.1",
                                        ["速度"] = "30 "
                                    },
                                    ["图鉴图标"] = "浮游石",
                                    ["图鉴击杀数"] = 5708,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "浮游石",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 10
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "雪精石",
                                    ["描述"] = "寒髓凝晶，浮空缓移，冰壳难破",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "雪精石",
                                    ["基础等级"] = 18,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.09*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1.5*1.09*1)^1.1",
                                        ["速度"] = "30 "
                                    },
                                    ["图鉴图标"] = "雪精石",
                                    ["图鉴击杀数"] = 10691,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "雪精石",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 15
                            }
                        },
                        ["持续时间"] = 59.85,
                        ["数量"] = 148,
                        ["最大数量"] = 148,
                        ["开始时间"] = 0
                    },
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "雪山巨人",
                                    ["描述"] = "冰渊霸主，拳撼雪崩，吐息成冰",
                                    ["是首领"] = true,
                                    ["怪物ID"] = "雪山巨人",
                                    ["基础等级"] = 15,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1.2*1.075*20)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1*1.075*20)^1.1",
                                        ["速度"] = "40 "
                                    },
                                    ["图鉴图标"] = "雪山巨人",
                                    ["图鉴击杀数"] = 90,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "雪山巨人",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 1
                            }
                        },
                        ["持续时间"] = 1,
                        ["数量"] = 1,
                        ["最大数量"] = 1,
                        ["开始时间"] = 29.925
                    }
                },
                ["加空间概率"] = 10,
                ["加空间格数"] = 2.8,
                ["属性倍率"] = 2.05,
                ["给予灵蕴"] = 52,
                ["总计经验"] = 759
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "雪山蜥",
                                    ["描述"] = "冰崖隐刃，仍乃小妖，随意应对",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "雪山蜥",
                                    ["基础等级"] = 11,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.055*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1*1.055*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "雪山蜥",
                                    ["图鉴击杀数"] = 7172,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "雪山蜥",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 50
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "黑翼蝠",
                                    ["描述"] = "夜行鬼魅，振翅迅捷，需要小心",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "黑翼蝠",
                                    ["基础等级"] = 2,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.01*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*0.8*1.01*1)^1.1",
                                        ["速度"] = "80 "
                                    },
                                    ["图鉴图标"] = "黑翼蝠",
                                    ["图鉴击杀数"] = 2889,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "黑翼蝠",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 10
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "白雪灵狐",
                                    ["描述"] = "极地灵狐，踏雪无痕，冰息蚀骨",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "白雪灵狐",
                                    ["基础等级"] = 13,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1.1*1.065*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1.1*1.065*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "白雪灵狐",
                                    ["图鉴击杀数"] = 8165,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "白雪灵狐",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 21
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "浮游石",
                                    ["描述"] = "玄磁奇物，悬空缓行，坚不可摧",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "浮游石",
                                    ["基础等级"] = 8,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.04*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1.5*1.04*1)^1.1",
                                        ["速度"] = "30 "
                                    },
                                    ["图鉴图标"] = "浮游石",
                                    ["图鉴击杀数"] = 5708,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "浮游石",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 10
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "雪精石",
                                    ["描述"] = "寒髓凝晶，浮空缓移，冰壳难破",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "雪精石",
                                    ["基础等级"] = 18,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.09*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1.5*1.09*1)^1.1",
                                        ["速度"] = "30 "
                                    },
                                    ["图鉴图标"] = "雪精石",
                                    ["图鉴击杀数"] = 10691,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "雪精石",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 15
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "猛冲蜥",
                                    ["描述"] = "沙丘暴徒，略为强硬，不难解决",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "猛冲蜥",
                                    ["基础等级"] = 6,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.03*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1*1.03*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "猛冲蜥",
                                    ["图鉴击杀数"] = 4750,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "猛冲蜥",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 20
                            }
                        },
                        ["持续时间"] = 63.42,
                        ["数量"] = 162,
                        ["最大数量"] = 162,
                        ["开始时间"] = 0
                    }
                },
                ["加空间概率"] = 10,
                ["加空间格数"] = 3.1,
                ["属性倍率"] = 2.22,
                ["给予灵蕴"] = 59,
                ["总计经验"] = 875
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "雪山蜥",
                                    ["描述"] = "冰崖隐刃，仍乃小妖，随意应对",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "雪山蜥",
                                    ["基础等级"] = 11,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.055*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1*1.055*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "雪山蜥",
                                    ["图鉴击杀数"] = 7172,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "雪山蜥",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 50
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "黑翼蝠",
                                    ["描述"] = "夜行鬼魅，振翅迅捷，需要小心",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "黑翼蝠",
                                    ["基础等级"] = 2,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.01*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*0.8*1.01*1)^1.1",
                                        ["速度"] = "80 "
                                    },
                                    ["图鉴图标"] = "黑翼蝠",
                                    ["图鉴击杀数"] = 2889,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "黑翼蝠",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 10
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "白雪灵狐",
                                    ["描述"] = "极地灵狐，踏雪无痕，冰息蚀骨",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "白雪灵狐",
                                    ["基础等级"] = 13,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1.1*1.065*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1.1*1.065*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "白雪灵狐",
                                    ["图鉴击杀数"] = 8165,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "白雪灵狐",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 21
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "浮游石",
                                    ["描述"] = "玄磁奇物，悬空缓行，坚不可摧",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "浮游石",
                                    ["基础等级"] = 8,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.04*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1.5*1.04*1)^1.1",
                                        ["速度"] = "30 "
                                    },
                                    ["图鉴图标"] = "浮游石",
                                    ["图鉴击杀数"] = 5708,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "浮游石",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 10
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "雪精石",
                                    ["描述"] = "寒髓凝晶，浮空缓移，冰壳难破",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "雪精石",
                                    ["基础等级"] = 18,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.09*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1.5*1.09*1)^1.1",
                                        ["速度"] = "30 "
                                    },
                                    ["图鉴图标"] = "雪精石",
                                    ["图鉴击杀数"] = 10691,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "雪精石",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 15
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "猛冲蜥",
                                    ["描述"] = "沙丘暴徒，略为强硬，不难解决",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "猛冲蜥",
                                    ["基础等级"] = 6,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.03*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1*1.03*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "猛冲蜥",
                                    ["图鉴击杀数"] = 4750,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "猛冲蜥",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 20
                            }
                        },
                        ["持续时间"] = 66.99,
                        ["数量"] = 175,
                        ["最大数量"] = 175,
                        ["开始时间"] = 0
                    },
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "晶石傀儡",
                                    ["描述"] = "玄冰秘精，通体金刚，碎敌须臾",
                                    ["是首领"] = true,
                                    ["怪物ID"] = "晶石傀儡",
                                    ["基础等级"] = 20,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.1*20)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1*1.1*20)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "晶石傀儡",
                                    ["图鉴击杀数"] = 115,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "晶石傀儡",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 1
                            }
                        },
                        ["持续时间"] = 1,
                        ["数量"] = 1,
                        ["最大数量"] = 1,
                        ["开始时间"] = 33.495
                    }
                },
                ["加空间概率"] = 10,
                ["加空间格数"] = 3.4,
                ["属性倍率"] = 2.39,
                ["给予灵蕴"] = 66,
                ["总计经验"] = 991
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "雪山蜥",
                                    ["描述"] = "冰崖隐刃，仍乃小妖，随意应对",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "雪山蜥",
                                    ["基础等级"] = 11,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.055*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1*1.055*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "雪山蜥",
                                    ["图鉴击杀数"] = 7172,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "雪山蜥",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 50
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "黑翼蝠",
                                    ["描述"] = "夜行鬼魅，振翅迅捷，需要小心",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "黑翼蝠",
                                    ["基础等级"] = 2,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.01*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*0.8*1.01*1)^1.1",
                                        ["速度"] = "80 "
                                    },
                                    ["图鉴图标"] = "黑翼蝠",
                                    ["图鉴击杀数"] = 2889,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "黑翼蝠",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 10
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "白雪灵狐",
                                    ["描述"] = "极地灵狐，踏雪无痕，冰息蚀骨",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "白雪灵狐",
                                    ["基础等级"] = 13,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1.1*1.065*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1.1*1.065*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "白雪灵狐",
                                    ["图鉴击杀数"] = 8165,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "白雪灵狐",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 21
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "浮游石",
                                    ["描述"] = "玄磁奇物，悬空缓行，坚不可摧",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "浮游石",
                                    ["基础等级"] = 8,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.04*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1.5*1.04*1)^1.1",
                                        ["速度"] = "30 "
                                    },
                                    ["图鉴图标"] = "浮游石",
                                    ["图鉴击杀数"] = 5708,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "浮游石",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 10
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "雪精石",
                                    ["描述"] = "寒髓凝晶，浮空缓移，冰壳难破",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "雪精石",
                                    ["基础等级"] = 18,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.09*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1.5*1.09*1)^1.1",
                                        ["速度"] = "30 "
                                    },
                                    ["图鉴图标"] = "雪精石",
                                    ["图鉴击杀数"] = 10691,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "雪精石",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 15
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "猛冲蜥",
                                    ["描述"] = "沙丘暴徒，略为强硬，不难解决",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "猛冲蜥",
                                    ["基础等级"] = 6,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.03*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1*1.03*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "猛冲蜥",
                                    ["图鉴击杀数"] = 4750,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "猛冲蜥",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 20
                            }
                        },
                        ["持续时间"] = 70.56,
                        ["数量"] = 189,
                        ["最大数量"] = 189,
                        ["开始时间"] = 0
                    },
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "晶石傀儡",
                                    ["描述"] = "玄冰秘精，通体金刚，碎敌须臾",
                                    ["是首领"] = true,
                                    ["怪物ID"] = "晶石傀儡",
                                    ["基础等级"] = 20,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.1*20)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1*1.1*20)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "晶石傀儡",
                                    ["图鉴击杀数"] = 115,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "晶石傀儡",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 1
                            }
                        },
                        ["持续时间"] = 1,
                        ["数量"] = 1,
                        ["最大数量"] = 1,
                        ["开始时间"] = 56.447998
                    },
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "岩石傀儡",
                                    ["描述"] = "镇守古阵，身躯如山，拳崩岩裂",
                                    ["是首领"] = true,
                                    ["怪物ID"] = "岩石傀儡",
                                    ["基础等级"] = 5,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.025*20)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1*1.025*20)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "岩石傀儡",
                                    ["图鉴击杀数"] = 42,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "岩石傀儡",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 1
                            }
                        },
                        ["持续时间"] = 1,
                        ["数量"] = 1,
                        ["最大数量"] = 1,
                        ["开始时间"] = 35.28
                    },
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "岩石傀儡",
                                    ["描述"] = "镇守古阵，身躯如山，拳崩岩裂",
                                    ["是首领"] = true,
                                    ["怪物ID"] = "岩石傀儡",
                                    ["基础等级"] = 5,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.025*20)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1*1.025*20)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "岩石傀儡",
                                    ["图鉴击杀数"] = 42,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "岩石傀儡",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 1
                            }
                        },
                        ["持续时间"] = 1,
                        ["数量"] = 1,
                        ["最大数量"] = 1,
                        ["开始时间"] = 35.28
                    }
                },
                ["加空间概率"] = 10,
                ["加空间格数"] = 3.7,
                ["属性倍率"] = 2.56000018,
                ["给予灵蕴"] = 73,
                ["总计经验"] = 1107
            }
        },
        ["完成奖励_1星"] = {
            [""] = 1000
        },
        ["完成奖励_2星"] = {
            [""] = 5
        },
        ["完成奖励_3星"] = {
            [""] = 100
        },
        ["初始必加空间"] = true,
        ["等级"] = 25,
        ["初始背包宽"] = 4,
        ["初始背包高"] = 4,
        ["描述_2星"] = "生命大于30％",
        ["描述_3星"] = "生命大于70％",
        ["怪物等级"] = 1
    }),
    ["3-1"] = Level.New({
        ["关卡ID"] = "3-1",
        ["分类"] = "主线",
        ["关卡波次"] = {
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "镰牙蜥",
                                    ["描述"] = "随处可见，普通小妖，轻松对付",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "镰牙蜥",
                                    ["基础等级"] = 1,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.005*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1*1.005*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "镰牙蜥",
                                    ["图鉴击杀数"] = 2438,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "镰牙蜥",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 30
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "猛冲蜥",
                                    ["描述"] = "沙丘暴徒，略为强硬，不难解决",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "猛冲蜥",
                                    ["基础等级"] = 6,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.03*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1*1.03*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "猛冲蜥",
                                    ["图鉴击杀数"] = 4750,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "猛冲蜥",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 10
                            }
                        },
                        ["持续时间"] = 39,
                        ["数量"] = 75,
                        ["最大数量"] = 75,
                        ["开始时间"] = 0
                    }
                },
                ["加空间概率"] = 9,
                ["加空间格数"] = 1.2,
                ["属性倍率"] = 1,
                ["给予灵蕴"] = 17,
                ["总计经验"] = 172
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "镰牙蜥",
                                    ["描述"] = "随处可见，普通小妖，轻松对付",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "镰牙蜥",
                                    ["基础等级"] = 1,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.005*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1*1.005*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "镰牙蜥",
                                    ["图鉴击杀数"] = 2438,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "镰牙蜥",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 30
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "猛冲蜥",
                                    ["描述"] = "沙丘暴徒，略为强硬，不难解决",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "猛冲蜥",
                                    ["基础等级"] = 6,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.03*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1*1.03*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "猛冲蜥",
                                    ["图鉴击杀数"] = 4750,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "猛冲蜥",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 10
                            }
                        },
                        ["持续时间"] = 42.2175,
                        ["数量"] = 87,
                        ["最大数量"] = 87,
                        ["开始时间"] = 0
                    }
                },
                ["加空间概率"] = 9,
                ["加空间格数"] = 1.4,
                ["属性倍率"] = 1.165,
                ["给予灵蕴"] = 23,
                ["总计经验"] = 286
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "镰牙蜥",
                                    ["描述"] = "随处可见，普通小妖，轻松对付",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "镰牙蜥",
                                    ["基础等级"] = 1,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.005*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1*1.005*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "镰牙蜥",
                                    ["图鉴击杀数"] = 2438,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "镰牙蜥",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 30
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "猛冲蜥",
                                    ["描述"] = "沙丘暴徒，略为强硬，不难解决",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "猛冲蜥",
                                    ["基础等级"] = 6,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.03*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1*1.03*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "猛冲蜥",
                                    ["图鉴击杀数"] = 4750,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "猛冲蜥",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 10
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "火焰灵狐",
                                    ["描述"] = "熔火狐妖，尾燎焦土，爪裂金石",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "火焰灵狐",
                                    ["基础等级"] = 21,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1.1*1.105*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1.1*1.105*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "火焰灵狐",
                                    ["图鉴击杀数"] = 12235,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "火焰灵狐",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 30
                            }
                        },
                        ["持续时间"] = 45.435,
                        ["数量"] = 100,
                        ["最大数量"] = 100,
                        ["开始时间"] = 0
                    }
                },
                ["加空间概率"] = 9,
                ["加空间格数"] = 1.6,
                ["属性倍率"] = 1.33,
                ["给予灵蕴"] = 29,
                ["总计经验"] = 400
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "镰牙蜥",
                                    ["描述"] = "随处可见，普通小妖，轻松对付",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "镰牙蜥",
                                    ["基础等级"] = 1,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.005*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1*1.005*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "镰牙蜥",
                                    ["图鉴击杀数"] = 2438,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "镰牙蜥",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 30
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "猛冲蜥",
                                    ["描述"] = "沙丘暴徒，略为强硬，不难解决",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "猛冲蜥",
                                    ["基础等级"] = 6,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.03*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1*1.03*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "猛冲蜥",
                                    ["图鉴击杀数"] = 4750,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "猛冲蜥",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 10
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "火焰灵狐",
                                    ["描述"] = "熔火狐妖，尾燎焦土，爪裂金石",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "火焰灵狐",
                                    ["基础等级"] = 21,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1.1*1.105*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1.1*1.105*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "火焰灵狐",
                                    ["图鉴击杀数"] = 12235,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "火焰灵狐",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 30
                            }
                        },
                        ["持续时间"] = 48.6525,
                        ["数量"] = 112,
                        ["最大数量"] = 112,
                        ["开始时间"] = 0
                    }
                },
                ["加空间概率"] = 9,
                ["加空间格数"] = 1.8,
                ["属性倍率"] = 1.495,
                ["给予灵蕴"] = 35,
                ["总计经验"] = 514
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "镰牙蜥",
                                    ["描述"] = "随处可见，普通小妖，轻松对付",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "镰牙蜥",
                                    ["基础等级"] = 1,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.005*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1*1.005*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "镰牙蜥",
                                    ["图鉴击杀数"] = 2438,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "镰牙蜥",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 30
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "猛冲蜥",
                                    ["描述"] = "沙丘暴徒，略为强硬，不难解决",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "猛冲蜥",
                                    ["基础等级"] = 6,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.03*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1*1.03*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "猛冲蜥",
                                    ["图鉴击杀数"] = 4750,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "猛冲蜥",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 10
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "火焰灵狐",
                                    ["描述"] = "熔火狐妖，尾燎焦土，爪裂金石",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "火焰灵狐",
                                    ["基础等级"] = 21,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1.1*1.105*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1.1*1.105*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "火焰灵狐",
                                    ["图鉴击杀数"] = 12235,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "火焰灵狐",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 30
                            }
                        },
                        ["持续时间"] = 51.87,
                        ["数量"] = 125,
                        ["最大数量"] = 125,
                        ["开始时间"] = 0
                    },
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "岩浆徘行者",
                                    ["描述"] = "地心魔物，步履熔岩，所过皆烬",
                                    ["是首领"] = true,
                                    ["怪物ID"] = "岩浆徘行者",
                                    ["基础等级"] = 26,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.13*20)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1*1.13*20)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "岩浆徘行者",
                                    ["图鉴击杀数"] = 146,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "岩浆徘行者",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 1
                            }
                        },
                        ["持续时间"] = 1,
                        ["数量"] = 1,
                        ["最大数量"] = 1,
                        ["开始时间"] = 25.935
                    }
                },
                ["加空间概率"] = 9,
                ["加空间格数"] = 2,
                ["属性倍率"] = 1.86000013,
                ["给予灵蕴"] = 41,
                ["总计经验"] = 628
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "镰牙蜥",
                                    ["描述"] = "随处可见，普通小妖，轻松对付",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "镰牙蜥",
                                    ["基础等级"] = 1,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.005*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1*1.005*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "镰牙蜥",
                                    ["图鉴击杀数"] = 2438,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "镰牙蜥",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 30
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "猛冲蜥",
                                    ["描述"] = "沙丘暴徒，略为强硬，不难解决",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "猛冲蜥",
                                    ["基础等级"] = 6,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.03*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1*1.03*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "猛冲蜥",
                                    ["图鉴击杀数"] = 4750,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "猛冲蜥",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 10
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "火焰灵狐",
                                    ["描述"] = "熔火狐妖，尾燎焦土，爪裂金石",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "火焰灵狐",
                                    ["基础等级"] = 21,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1.1*1.105*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1.1*1.105*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "火焰灵狐",
                                    ["图鉴击杀数"] = 12235,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "火焰灵狐",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 30
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "火岩龙蜥",
                                    ["描述"] = "地脉暴君，甲厚如山，喷焰焚林",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "火岩龙蜥",
                                    ["基础等级"] = 24,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*0.7*1.12*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*2*1.12*1)^1.1",
                                        ["速度"] = "30 "
                                    },
                                    ["图鉴图标"] = "火岩龙蜥",
                                    ["图鉴击杀数"] = 13797,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "火岩龙蜥",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 20
                            }
                        },
                        ["持续时间"] = 55.0875,
                        ["数量"] = 137,
                        ["最大数量"] = 137,
                        ["开始时间"] = 0
                    }
                },
                ["加空间概率"] = 9,
                ["加空间格数"] = 2.2,
                ["属性倍率"] = 2.025,
                ["给予灵蕴"] = 47,
                ["总计经验"] = 742
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "镰牙蜥",
                                    ["描述"] = "随处可见，普通小妖，轻松对付",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "镰牙蜥",
                                    ["基础等级"] = 1,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.005*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1*1.005*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "镰牙蜥",
                                    ["图鉴击杀数"] = 2438,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "镰牙蜥",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 30
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "猛冲蜥",
                                    ["描述"] = "沙丘暴徒，略为强硬，不难解决",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "猛冲蜥",
                                    ["基础等级"] = 6,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.03*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1*1.03*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "猛冲蜥",
                                    ["图鉴击杀数"] = 4750,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "猛冲蜥",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 10
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "火焰灵狐",
                                    ["描述"] = "熔火狐妖，尾燎焦土，爪裂金石",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "火焰灵狐",
                                    ["基础等级"] = 21,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1.1*1.105*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1.1*1.105*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "火焰灵狐",
                                    ["图鉴击杀数"] = 12235,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "火焰灵狐",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 30
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "火岩龙蜥",
                                    ["描述"] = "地脉暴君，甲厚如山，喷焰焚林",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "火岩龙蜥",
                                    ["基础等级"] = 24,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*0.7*1.12*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*2*1.12*1)^1.1",
                                        ["速度"] = "30 "
                                    },
                                    ["图鉴图标"] = "火岩龙蜥",
                                    ["图鉴击杀数"] = 13797,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "火岩龙蜥",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 20
                            }
                        },
                        ["持续时间"] = 58.305,
                        ["数量"] = 149,
                        ["最大数量"] = 149,
                        ["开始时间"] = 0
                    }
                },
                ["加空间概率"] = 9,
                ["加空间格数"] = 2.4,
                ["属性倍率"] = 2.19,
                ["给予灵蕴"] = 53,
                ["总计经验"] = 856
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "镰牙蜥",
                                    ["描述"] = "随处可见，普通小妖，轻松对付",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "镰牙蜥",
                                    ["基础等级"] = 1,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.005*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1*1.005*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "镰牙蜥",
                                    ["图鉴击杀数"] = 2438,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "镰牙蜥",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 30
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "猛冲蜥",
                                    ["描述"] = "沙丘暴徒，略为强硬，不难解决",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "猛冲蜥",
                                    ["基础等级"] = 6,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.03*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1*1.03*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "猛冲蜥",
                                    ["图鉴击杀数"] = 4750,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "猛冲蜥",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 10
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "火焰灵狐",
                                    ["描述"] = "熔火狐妖，尾燎焦土，爪裂金石",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "火焰灵狐",
                                    ["基础等级"] = 21,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1.1*1.105*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1.1*1.105*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "火焰灵狐",
                                    ["图鉴击杀数"] = 12235,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "火焰灵狐",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 30
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "火岩龙蜥",
                                    ["描述"] = "地脉暴君，甲厚如山，喷焰焚林",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "火岩龙蜥",
                                    ["基础等级"] = 24,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*0.7*1.12*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*2*1.12*1)^1.1",
                                        ["速度"] = "30 "
                                    },
                                    ["图鉴图标"] = "火岩龙蜥",
                                    ["图鉴击杀数"] = 13797,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "火岩龙蜥",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 20
                            }
                        },
                        ["持续时间"] = 61.5225,
                        ["数量"] = 162,
                        ["最大数量"] = 162,
                        ["开始时间"] = 0
                    }
                },
                ["加空间概率"] = 9,
                ["加空间格数"] = 2.6,
                ["属性倍率"] = 2.355,
                ["给予灵蕴"] = 59,
                ["总计经验"] = 970
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "镰牙蜥",
                                    ["描述"] = "随处可见，普通小妖，轻松对付",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "镰牙蜥",
                                    ["基础等级"] = 1,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.005*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1*1.005*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "镰牙蜥",
                                    ["图鉴击杀数"] = 2438,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "镰牙蜥",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 30
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "猛冲蜥",
                                    ["描述"] = "沙丘暴徒，略为强硬，不难解决",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "猛冲蜥",
                                    ["基础等级"] = 6,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.03*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1*1.03*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "猛冲蜥",
                                    ["图鉴击杀数"] = 4750,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "猛冲蜥",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 10
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "火焰灵狐",
                                    ["描述"] = "熔火狐妖，尾燎焦土，爪裂金石",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "火焰灵狐",
                                    ["基础等级"] = 21,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1.1*1.105*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1.1*1.105*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "火焰灵狐",
                                    ["图鉴击杀数"] = 12235,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "火焰灵狐",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 30
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "火岩龙蜥",
                                    ["描述"] = "地脉暴君，甲厚如山，喷焰焚林",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "火岩龙蜥",
                                    ["基础等级"] = 24,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*0.7*1.12*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*2*1.12*1)^1.1",
                                        ["速度"] = "30 "
                                    },
                                    ["图鉴图标"] = "火岩龙蜥",
                                    ["图鉴击杀数"] = 13797,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "火岩龙蜥",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 20
                            }
                        },
                        ["持续时间"] = 64.74,
                        ["数量"] = 174,
                        ["最大数量"] = 174,
                        ["开始时间"] = 0
                    }
                },
                ["加空间概率"] = 9,
                ["加空间格数"] = 2.8,
                ["属性倍率"] = 2.52000022,
                ["给予灵蕴"] = 65,
                ["总计经验"] = 1084
            }
        },
        ["完成奖励_1星"] = {
            [""] = 1500
        },
        ["完成奖励_3星"] = {
            [""] = 100
        },
        ["初始必加空间"] = true,
        ["等级"] = 23,
        ["初始背包宽"] = 3,
        ["初始背包高"] = 3,
        ["描述_2星"] = "生命大于30％",
        ["描述_3星"] = "生命大于70％",
        ["怪物等级"] = 1
    }),
    ["3-2"] = Level.New({
        ["关卡ID"] = "3-2",
        ["分类"] = "主线",
        ["关卡波次"] = {
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "火焰灵狐",
                                    ["描述"] = "熔火狐妖，尾燎焦土，爪裂金石",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "火焰灵狐",
                                    ["基础等级"] = 21,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1.1*1.105*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1.1*1.105*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "火焰灵狐",
                                    ["图鉴击杀数"] = 12235,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "火焰灵狐",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 50
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "镰牙蜥",
                                    ["描述"] = "随处可见，普通小妖，轻松对付",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "镰牙蜥",
                                    ["基础等级"] = 1,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.005*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1*1.005*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "镰牙蜥",
                                    ["图鉴击杀数"] = 2438,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "镰牙蜥",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 20
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "猛冲蜥",
                                    ["描述"] = "沙丘暴徒，略为强硬，不难解决",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "猛冲蜥",
                                    ["基础等级"] = 6,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.03*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1*1.03*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "猛冲蜥",
                                    ["图鉴击杀数"] = 4750,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "猛冲蜥",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 10
                            }
                        },
                        ["持续时间"] = 42.9,
                        ["数量"] = 82,
                        ["最大数量"] = 82,
                        ["开始时间"] = 0
                    }
                },
                ["加空间概率"] = 9,
                ["加空间格数"] = 1.2,
                ["属性倍率"] = 1,
                ["给予灵蕴"] = 16,
                ["总计经验"] = 167
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "火焰灵狐",
                                    ["描述"] = "熔火狐妖，尾燎焦土，爪裂金石",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "火焰灵狐",
                                    ["基础等级"] = 21,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1.1*1.105*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1.1*1.105*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "火焰灵狐",
                                    ["图鉴击杀数"] = 12235,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "火焰灵狐",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 50
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "镰牙蜥",
                                    ["描述"] = "随处可见，普通小妖，轻松对付",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "镰牙蜥",
                                    ["基础等级"] = 1,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.005*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1*1.005*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "镰牙蜥",
                                    ["图鉴击杀数"] = 2438,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "镰牙蜥",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 20
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "猛冲蜥",
                                    ["描述"] = "沙丘暴徒，略为强硬，不难解决",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "猛冲蜥",
                                    ["基础等级"] = 6,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.03*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1*1.03*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "猛冲蜥",
                                    ["图鉴击杀数"] = 4750,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "猛冲蜥",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 10
                            }
                        },
                        ["持续时间"] = 46.57868,
                        ["数量"] = 95,
                        ["最大数量"] = 95,
                        ["开始时间"] = 0
                    }
                },
                ["加空间概率"] = 9,
                ["加空间格数"] = 1.4,
                ["属性倍率"] = 1.1715,
                ["给予灵蕴"] = 22,
                ["总计经验"] = 278
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "火焰灵狐",
                                    ["描述"] = "熔火狐妖，尾燎焦土，爪裂金石",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "火焰灵狐",
                                    ["基础等级"] = 21,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1.1*1.105*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1.1*1.105*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "火焰灵狐",
                                    ["图鉴击杀数"] = 12235,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "火焰灵狐",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 50
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "镰牙蜥",
                                    ["描述"] = "随处可见，普通小妖，轻松对付",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "镰牙蜥",
                                    ["基础等级"] = 1,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.005*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1*1.005*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "镰牙蜥",
                                    ["图鉴击杀数"] = 2438,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "镰牙蜥",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 20
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "猛冲蜥",
                                    ["描述"] = "沙丘暴徒，略为强硬，不难解决",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "猛冲蜥",
                                    ["基础等级"] = 6,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.03*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1*1.03*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "猛冲蜥",
                                    ["图鉴击杀数"] = 4750,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "猛冲蜥",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 10
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "火岩龙蜥",
                                    ["描述"] = "地脉暴君，甲厚如山，喷焰焚林",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "火岩龙蜥",
                                    ["基础等级"] = 24,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*0.7*1.12*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*2*1.12*1)^1.1",
                                        ["速度"] = "30 "
                                    },
                                    ["图鉴图标"] = "火岩龙蜥",
                                    ["图鉴击杀数"] = 13797,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "火岩龙蜥",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 21
                            }
                        },
                        ["持续时间"] = 50.25735,
                        ["数量"] = 109,
                        ["最大数量"] = 109,
                        ["开始时间"] = 0
                    }
                },
                ["加空间概率"] = 9,
                ["加空间格数"] = 1.6,
                ["属性倍率"] = 1.34299994,
                ["给予灵蕴"] = 28,
                ["总计经验"] = 389
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "火焰灵狐",
                                    ["描述"] = "熔火狐妖，尾燎焦土，爪裂金石",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "火焰灵狐",
                                    ["基础等级"] = 21,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1.1*1.105*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1.1*1.105*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "火焰灵狐",
                                    ["图鉴击杀数"] = 12235,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "火焰灵狐",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 50
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "镰牙蜥",
                                    ["描述"] = "随处可见，普通小妖，轻松对付",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "镰牙蜥",
                                    ["基础等级"] = 1,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.005*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1*1.005*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "镰牙蜥",
                                    ["图鉴击杀数"] = 2438,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "镰牙蜥",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 20
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "猛冲蜥",
                                    ["描述"] = "沙丘暴徒，略为强硬，不难解决",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "猛冲蜥",
                                    ["基础等级"] = 6,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.03*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1*1.03*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "猛冲蜥",
                                    ["图鉴击杀数"] = 4750,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "猛冲蜥",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 10
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "火岩龙蜥",
                                    ["描述"] = "地脉暴君，甲厚如山，喷焰焚林",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "火岩龙蜥",
                                    ["基础等级"] = 24,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*0.7*1.12*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*2*1.12*1)^1.1",
                                        ["速度"] = "30 "
                                    },
                                    ["图鉴图标"] = "火岩龙蜥",
                                    ["图鉴击杀数"] = 13797,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "火岩龙蜥",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 21
                            }
                        },
                        ["持续时间"] = 53.9360275,
                        ["数量"] = 123,
                        ["最大数量"] = 123,
                        ["开始时间"] = 0
                    }
                },
                ["加空间概率"] = 9,
                ["加空间格数"] = 1.8,
                ["属性倍率"] = 1.5145,
                ["给予灵蕴"] = 34,
                ["总计经验"] = 500
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "火焰灵狐",
                                    ["描述"] = "熔火狐妖，尾燎焦土，爪裂金石",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "火焰灵狐",
                                    ["基础等级"] = 21,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1.1*1.105*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1.1*1.105*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "火焰灵狐",
                                    ["图鉴击杀数"] = 12235,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "火焰灵狐",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 50
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "镰牙蜥",
                                    ["描述"] = "随处可见，普通小妖，轻松对付",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "镰牙蜥",
                                    ["基础等级"] = 1,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.005*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1*1.005*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "镰牙蜥",
                                    ["图鉴击杀数"] = 2438,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "镰牙蜥",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 20
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "猛冲蜥",
                                    ["描述"] = "沙丘暴徒，略为强硬，不难解决",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "猛冲蜥",
                                    ["基础等级"] = 6,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.03*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1*1.03*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "猛冲蜥",
                                    ["图鉴击杀数"] = 4750,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "猛冲蜥",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 10
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "火岩龙蜥",
                                    ["描述"] = "地脉暴君，甲厚如山，喷焰焚林",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "火岩龙蜥",
                                    ["基础等级"] = 24,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*0.7*1.12*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*2*1.12*1)^1.1",
                                        ["速度"] = "30 "
                                    },
                                    ["图鉴图标"] = "火岩龙蜥",
                                    ["图鉴击杀数"] = 13797,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "火岩龙蜥",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 21
                            }
                        },
                        ["持续时间"] = 57.6147,
                        ["数量"] = 137,
                        ["最大数量"] = 137,
                        ["开始时间"] = 0
                    },
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "岩浆徘行者",
                                    ["描述"] = "地心魔物，步履熔岩，所过皆烬",
                                    ["是首领"] = true,
                                    ["怪物ID"] = "岩浆徘行者",
                                    ["基础等级"] = 26,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.13*20)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1*1.13*20)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "岩浆徘行者",
                                    ["图鉴击杀数"] = 146,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "岩浆徘行者",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 1
                            }
                        },
                        ["持续时间"] = 1,
                        ["数量"] = 1,
                        ["最大数量"] = 1,
                        ["开始时间"] = 28.80735
                    }
                },
                ["加空间概率"] = 9,
                ["加空间格数"] = 2,
                ["属性倍率"] = 1.886,
                ["给予灵蕴"] = 40,
                ["总计经验"] = 611
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "火焰灵狐",
                                    ["描述"] = "熔火狐妖，尾燎焦土，爪裂金石",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "火焰灵狐",
                                    ["基础等级"] = 21,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1.1*1.105*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1.1*1.105*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "火焰灵狐",
                                    ["图鉴击杀数"] = 12235,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "火焰灵狐",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 50
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "镰牙蜥",
                                    ["描述"] = "随处可见，普通小妖，轻松对付",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "镰牙蜥",
                                    ["基础等级"] = 1,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.005*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1*1.005*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "镰牙蜥",
                                    ["图鉴击杀数"] = 2438,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "镰牙蜥",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 20
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "猛冲蜥",
                                    ["描述"] = "沙丘暴徒，略为强硬，不难解决",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "猛冲蜥",
                                    ["基础等级"] = 6,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.03*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1*1.03*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "猛冲蜥",
                                    ["图鉴击杀数"] = 4750,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "猛冲蜥",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 10
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "火岩龙蜥",
                                    ["描述"] = "地脉暴君，甲厚如山，喷焰焚林",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "火岩龙蜥",
                                    ["基础等级"] = 24,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*0.7*1.12*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*2*1.12*1)^1.1",
                                        ["速度"] = "30 "
                                    },
                                    ["图鉴图标"] = "火岩龙蜥",
                                    ["图鉴击杀数"] = 13797,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "火岩龙蜥",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 21
                            }
                        },
                        ["持续时间"] = 61.2933769,
                        ["数量"] = 151,
                        ["最大数量"] = 151,
                        ["开始时间"] = 0
                    }
                },
                ["加空间概率"] = 9,
                ["加空间格数"] = 2.2,
                ["属性倍率"] = 2.0575,
                ["给予灵蕴"] = 46,
                ["总计经验"] = 722
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "火焰灵狐",
                                    ["描述"] = "熔火狐妖，尾燎焦土，爪裂金石",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "火焰灵狐",
                                    ["基础等级"] = 21,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1.1*1.105*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1.1*1.105*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "火焰灵狐",
                                    ["图鉴击杀数"] = 12235,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "火焰灵狐",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 50
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "镰牙蜥",
                                    ["描述"] = "随处可见，普通小妖，轻松对付",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "镰牙蜥",
                                    ["基础等级"] = 1,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.005*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1*1.005*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "镰牙蜥",
                                    ["图鉴击杀数"] = 2438,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "镰牙蜥",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 20
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "猛冲蜥",
                                    ["描述"] = "沙丘暴徒，略为强硬，不难解决",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "猛冲蜥",
                                    ["基础等级"] = 6,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.03*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1*1.03*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "猛冲蜥",
                                    ["图鉴击杀数"] = 4750,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "猛冲蜥",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 10
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "火岩龙蜥",
                                    ["描述"] = "地脉暴君，甲厚如山，喷焰焚林",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "火岩龙蜥",
                                    ["基础等级"] = 24,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*0.7*1.12*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*2*1.12*1)^1.1",
                                        ["速度"] = "30 "
                                    },
                                    ["图鉴图标"] = "火岩龙蜥",
                                    ["图鉴击杀数"] = 13797,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "火岩龙蜥",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 21
                            }
                        },
                        ["持续时间"] = 64.97205,
                        ["数量"] = 165,
                        ["最大数量"] = 165,
                        ["开始时间"] = 0
                    }
                },
                ["加空间概率"] = 9,
                ["加空间格数"] = 2.4,
                ["属性倍率"] = 2.229,
                ["给予灵蕴"] = 52,
                ["总计经验"] = 833
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "火焰灵狐",
                                    ["描述"] = "熔火狐妖，尾燎焦土，爪裂金石",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "火焰灵狐",
                                    ["基础等级"] = 21,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1.1*1.105*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1.1*1.105*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "火焰灵狐",
                                    ["图鉴击杀数"] = 12235,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "火焰灵狐",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 50
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "镰牙蜥",
                                    ["描述"] = "随处可见，普通小妖，轻松对付",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "镰牙蜥",
                                    ["基础等级"] = 1,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.005*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1*1.005*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "镰牙蜥",
                                    ["图鉴击杀数"] = 2438,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "镰牙蜥",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 20
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "猛冲蜥",
                                    ["描述"] = "沙丘暴徒，略为强硬，不难解决",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "猛冲蜥",
                                    ["基础等级"] = 6,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.03*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1*1.03*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "猛冲蜥",
                                    ["图鉴击杀数"] = 4750,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "猛冲蜥",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 10
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "火岩龙蜥",
                                    ["描述"] = "地脉暴君，甲厚如山，喷焰焚林",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "火岩龙蜥",
                                    ["基础等级"] = 24,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*0.7*1.12*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*2*1.12*1)^1.1",
                                        ["速度"] = "30 "
                                    },
                                    ["图鉴图标"] = "火岩龙蜥",
                                    ["图鉴击杀数"] = 13797,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "火岩龙蜥",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 21
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "毒窟蝠",
                                    ["描述"] = "瘴穴妖蝠，翼带剧毒，快若鬼影",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "毒窟蝠",
                                    ["基础等级"] = 28,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.14*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*0.7*1.14*1)^1.1",
                                        ["速度"] = "100 "
                                    },
                                    ["图鉴图标"] = "毒窟蝠",
                                    ["图鉴击杀数"] = 15904,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "毒窟蝠",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 30
                            }
                        },
                        ["持续时间"] = 68.65073,
                        ["数量"] = 179,
                        ["最大数量"] = 179,
                        ["开始时间"] = 0
                    }
                },
                ["加空间概率"] = 9,
                ["加空间格数"] = 2.6,
                ["属性倍率"] = 2.4005,
                ["给予灵蕴"] = 58,
                ["总计经验"] = 944
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "火焰灵狐",
                                    ["描述"] = "熔火狐妖，尾燎焦土，爪裂金石",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "火焰灵狐",
                                    ["基础等级"] = 21,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1.1*1.105*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1.1*1.105*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "火焰灵狐",
                                    ["图鉴击杀数"] = 12235,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "火焰灵狐",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 50
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "镰牙蜥",
                                    ["描述"] = "随处可见，普通小妖，轻松对付",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "镰牙蜥",
                                    ["基础等级"] = 1,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.005*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1*1.005*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "镰牙蜥",
                                    ["图鉴击杀数"] = 2438,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "镰牙蜥",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 20
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "猛冲蜥",
                                    ["描述"] = "沙丘暴徒，略为强硬，不难解决",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "猛冲蜥",
                                    ["基础等级"] = 6,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.03*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1*1.03*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "猛冲蜥",
                                    ["图鉴击杀数"] = 4750,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "猛冲蜥",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 10
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "火岩龙蜥",
                                    ["描述"] = "地脉暴君，甲厚如山，喷焰焚林",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "火岩龙蜥",
                                    ["基础等级"] = 24,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*0.7*1.12*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*2*1.12*1)^1.1",
                                        ["速度"] = "30 "
                                    },
                                    ["图鉴图标"] = "火岩龙蜥",
                                    ["图鉴击杀数"] = 13797,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "火岩龙蜥",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 21
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "毒窟蝠",
                                    ["描述"] = "瘴穴妖蝠，翼带剧毒，快若鬼影",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "毒窟蝠",
                                    ["基础等级"] = 28,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.14*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*0.7*1.14*1)^1.1",
                                        ["速度"] = "100 "
                                    },
                                    ["图鉴图标"] = "毒窟蝠",
                                    ["图鉴击杀数"] = 15904,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "毒窟蝠",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 30
                            }
                        },
                        ["持续时间"] = 72.3294,
                        ["数量"] = 193,
                        ["最大数量"] = 193,
                        ["开始时间"] = 0
                    }
                },
                ["加空间概率"] = 9,
                ["加空间格数"] = 2.8,
                ["属性倍率"] = 2.572,
                ["给予灵蕴"] = 64,
                ["总计经验"] = 1055
            }
        },
        ["完成奖励_1星"] = {
            [""] = 1500
        },
        ["完成奖励_3星"] = {
            [""] = 100
        },
        ["初始必加空间"] = true,
        ["等级"] = 0,
        ["初始背包宽"] = 3,
        ["初始背包高"] = 3,
        ["描述_2星"] = "生命大于30％",
        ["描述_3星"] = "生命大于70％",
        ["怪物等级"] = 1
    }),
    ["3-3"] = Level.New({
        ["关卡ID"] = "3-3",
        ["分类"] = "主线",
        ["关卡波次"] = {
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "火焰灵狐",
                                    ["描述"] = "熔火狐妖，尾燎焦土，爪裂金石",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "火焰灵狐",
                                    ["基础等级"] = 21,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1.1*1.105*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1.1*1.105*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "火焰灵狐",
                                    ["图鉴击杀数"] = 12235,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "火焰灵狐",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 50
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "镰牙蜥",
                                    ["描述"] = "随处可见，普通小妖，轻松对付",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "镰牙蜥",
                                    ["基础等级"] = 1,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.005*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1*1.005*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "镰牙蜥",
                                    ["图鉴击杀数"] = 2438,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "镰牙蜥",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 20
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "猛冲蜥",
                                    ["描述"] = "沙丘暴徒，略为强硬，不难解决",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "猛冲蜥",
                                    ["基础等级"] = 6,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.03*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1*1.03*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "猛冲蜥",
                                    ["图鉴击杀数"] = 4750,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "猛冲蜥",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 10
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "黑翼蝠",
                                    ["描述"] = "夜行鬼魅，振翅迅捷，需要小心",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "黑翼蝠",
                                    ["基础等级"] = 2,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.01*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*0.8*1.01*1)^1.1",
                                        ["速度"] = "80 "
                                    },
                                    ["图鉴图标"] = "黑翼蝠",
                                    ["图鉴击杀数"] = 2889,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "黑翼蝠",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 5
                            }
                        },
                        ["持续时间"] = 46.8,
                        ["数量"] = 88,
                        ["最大数量"] = 88,
                        ["开始时间"] = 0
                    }
                },
                ["加空间概率"] = 8,
                ["加空间格数"] = 1.2,
                ["属性倍率"] = 1,
                ["给予灵蕴"] = 15,
                ["总计经验"] = 161
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "火焰灵狐",
                                    ["描述"] = "熔火狐妖，尾燎焦土，爪裂金石",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "火焰灵狐",
                                    ["基础等级"] = 21,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1.1*1.105*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1.1*1.105*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "火焰灵狐",
                                    ["图鉴击杀数"] = 12235,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "火焰灵狐",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 50
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "镰牙蜥",
                                    ["描述"] = "随处可见，普通小妖，轻松对付",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "镰牙蜥",
                                    ["基础等级"] = 1,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.005*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1*1.005*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "镰牙蜥",
                                    ["图鉴击杀数"] = 2438,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "镰牙蜥",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 20
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "猛冲蜥",
                                    ["描述"] = "沙丘暴徒，略为强硬，不难解决",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "猛冲蜥",
                                    ["基础等级"] = 6,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.03*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1*1.03*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "猛冲蜥",
                                    ["图鉴击杀数"] = 4750,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "猛冲蜥",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 10
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "黑翼蝠",
                                    ["描述"] = "夜行鬼魅，振翅迅捷，需要小心",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "黑翼蝠",
                                    ["基础等级"] = 2,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.01*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*0.8*1.01*1)^1.1",
                                        ["速度"] = "80 "
                                    },
                                    ["图鉴图标"] = "黑翼蝠",
                                    ["图鉴击杀数"] = 2889,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "黑翼蝠",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 5
                            }
                        },
                        ["持续时间"] = 50.9652,
                        ["数量"] = 104,
                        ["最大数量"] = 104,
                        ["开始时间"] = 0
                    }
                },
                ["加空间概率"] = 8,
                ["加空间格数"] = 1.4,
                ["属性倍率"] = 1.178,
                ["给予灵蕴"] = 21,
                ["总计经验"] = 270
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "火焰灵狐",
                                    ["描述"] = "熔火狐妖，尾燎焦土，爪裂金石",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "火焰灵狐",
                                    ["基础等级"] = 21,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1.1*1.105*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1.1*1.105*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "火焰灵狐",
                                    ["图鉴击杀数"] = 12235,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "火焰灵狐",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 50
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "镰牙蜥",
                                    ["描述"] = "随处可见，普通小妖，轻松对付",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "镰牙蜥",
                                    ["基础等级"] = 1,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.005*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1*1.005*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "镰牙蜥",
                                    ["图鉴击杀数"] = 2438,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "镰牙蜥",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 20
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "猛冲蜥",
                                    ["描述"] = "沙丘暴徒，略为强硬，不难解决",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "猛冲蜥",
                                    ["基础等级"] = 6,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.03*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1*1.03*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "猛冲蜥",
                                    ["图鉴击杀数"] = 4750,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "猛冲蜥",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 10
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "黑翼蝠",
                                    ["描述"] = "夜行鬼魅，振翅迅捷，需要小心",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "黑翼蝠",
                                    ["基础等级"] = 2,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.01*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*0.8*1.01*1)^1.1",
                                        ["速度"] = "80 "
                                    },
                                    ["图鉴图标"] = "黑翼蝠",
                                    ["图鉴击杀数"] = 2889,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "黑翼蝠",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 5
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "火岩龙蜥",
                                    ["描述"] = "地脉暴君，甲厚如山，喷焰焚林",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "火岩龙蜥",
                                    ["基础等级"] = 24,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*0.7*1.12*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*2*1.12*1)^1.1",
                                        ["速度"] = "30 "
                                    },
                                    ["图鉴图标"] = "火岩龙蜥",
                                    ["图鉴击杀数"] = 13797,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "火岩龙蜥",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 21
                            }
                        },
                        ["持续时间"] = 55.1304,
                        ["数量"] = 119,
                        ["最大数量"] = 119,
                        ["开始时间"] = 0
                    }
                },
                ["加空间概率"] = 8,
                ["加空间格数"] = 1.6,
                ["属性倍率"] = 1.356,
                ["给予灵蕴"] = 27,
                ["总计经验"] = 379
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "火焰灵狐",
                                    ["描述"] = "熔火狐妖，尾燎焦土，爪裂金石",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "火焰灵狐",
                                    ["基础等级"] = 21,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1.1*1.105*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1.1*1.105*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "火焰灵狐",
                                    ["图鉴击杀数"] = 12235,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "火焰灵狐",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 50
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "镰牙蜥",
                                    ["描述"] = "随处可见，普通小妖，轻松对付",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "镰牙蜥",
                                    ["基础等级"] = 1,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.005*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1*1.005*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "镰牙蜥",
                                    ["图鉴击杀数"] = 2438,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "镰牙蜥",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 20
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "猛冲蜥",
                                    ["描述"] = "沙丘暴徒，略为强硬，不难解决",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "猛冲蜥",
                                    ["基础等级"] = 6,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.03*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1*1.03*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "猛冲蜥",
                                    ["图鉴击杀数"] = 4750,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "猛冲蜥",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 10
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "黑翼蝠",
                                    ["描述"] = "夜行鬼魅，振翅迅捷，需要小心",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "黑翼蝠",
                                    ["基础等级"] = 2,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.01*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*0.8*1.01*1)^1.1",
                                        ["速度"] = "80 "
                                    },
                                    ["图鉴图标"] = "黑翼蝠",
                                    ["图鉴击杀数"] = 2889,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "黑翼蝠",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 5
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "火岩龙蜥",
                                    ["描述"] = "地脉暴君，甲厚如山，喷焰焚林",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "火岩龙蜥",
                                    ["基础等级"] = 24,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*0.7*1.12*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*2*1.12*1)^1.1",
                                        ["速度"] = "30 "
                                    },
                                    ["图鉴图标"] = "火岩龙蜥",
                                    ["图鉴击杀数"] = 13797,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "火岩龙蜥",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 21
                            }
                        },
                        ["持续时间"] = 59.2956,
                        ["数量"] = 135,
                        ["最大数量"] = 135,
                        ["开始时间"] = 0
                    }
                },
                ["加空间概率"] = 8,
                ["加空间格数"] = 1.8,
                ["属性倍率"] = 1.534,
                ["给予灵蕴"] = 33,
                ["总计经验"] = 488
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "火焰灵狐",
                                    ["描述"] = "熔火狐妖，尾燎焦土，爪裂金石",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "火焰灵狐",
                                    ["基础等级"] = 21,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1.1*1.105*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1.1*1.105*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "火焰灵狐",
                                    ["图鉴击杀数"] = 12235,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "火焰灵狐",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 50
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "镰牙蜥",
                                    ["描述"] = "随处可见，普通小妖，轻松对付",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "镰牙蜥",
                                    ["基础等级"] = 1,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.005*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1*1.005*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "镰牙蜥",
                                    ["图鉴击杀数"] = 2438,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "镰牙蜥",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 20
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "猛冲蜥",
                                    ["描述"] = "沙丘暴徒，略为强硬，不难解决",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "猛冲蜥",
                                    ["基础等级"] = 6,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.03*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1*1.03*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "猛冲蜥",
                                    ["图鉴击杀数"] = 4750,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "猛冲蜥",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 10
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "黑翼蝠",
                                    ["描述"] = "夜行鬼魅，振翅迅捷，需要小心",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "黑翼蝠",
                                    ["基础等级"] = 2,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.01*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*0.8*1.01*1)^1.1",
                                        ["速度"] = "80 "
                                    },
                                    ["图鉴图标"] = "黑翼蝠",
                                    ["图鉴击杀数"] = 2889,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "黑翼蝠",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 5
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "火岩龙蜥",
                                    ["描述"] = "地脉暴君，甲厚如山，喷焰焚林",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "火岩龙蜥",
                                    ["基础等级"] = 24,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*0.7*1.12*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*2*1.12*1)^1.1",
                                        ["速度"] = "30 "
                                    },
                                    ["图鉴图标"] = "火岩龙蜥",
                                    ["图鉴击杀数"] = 13797,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "火岩龙蜥",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 21
                            }
                        },
                        ["持续时间"] = 63.4608,
                        ["数量"] = 151,
                        ["最大数量"] = 151,
                        ["开始时间"] = 0
                    },
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "岩浆徘行者",
                                    ["描述"] = "地心魔物，步履熔岩，所过皆烬",
                                    ["是首领"] = true,
                                    ["怪物ID"] = "岩浆徘行者",
                                    ["基础等级"] = 26,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.13*20)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1*1.13*20)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "岩浆徘行者",
                                    ["图鉴击杀数"] = 146,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "岩浆徘行者",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 1
                            }
                        },
                        ["持续时间"] = 1,
                        ["数量"] = 1,
                        ["最大数量"] = 1,
                        ["开始时间"] = 31.7304
                    }
                },
                ["加空间概率"] = 8,
                ["加空间格数"] = 2,
                ["属性倍率"] = 1.91200006,
                ["给予灵蕴"] = 39,
                ["总计经验"] = 597
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "火焰灵狐",
                                    ["描述"] = "熔火狐妖，尾燎焦土，爪裂金石",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "火焰灵狐",
                                    ["基础等级"] = 21,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1.1*1.105*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1.1*1.105*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "火焰灵狐",
                                    ["图鉴击杀数"] = 12235,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "火焰灵狐",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 50
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "镰牙蜥",
                                    ["描述"] = "随处可见，普通小妖，轻松对付",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "镰牙蜥",
                                    ["基础等级"] = 1,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.005*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1*1.005*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "镰牙蜥",
                                    ["图鉴击杀数"] = 2438,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "镰牙蜥",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 20
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "猛冲蜥",
                                    ["描述"] = "沙丘暴徒，略为强硬，不难解决",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "猛冲蜥",
                                    ["基础等级"] = 6,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.03*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1*1.03*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "猛冲蜥",
                                    ["图鉴击杀数"] = 4750,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "猛冲蜥",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 10
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "黑翼蝠",
                                    ["描述"] = "夜行鬼魅，振翅迅捷，需要小心",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "黑翼蝠",
                                    ["基础等级"] = 2,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.01*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*0.8*1.01*1)^1.1",
                                        ["速度"] = "80 "
                                    },
                                    ["图鉴图标"] = "黑翼蝠",
                                    ["图鉴击杀数"] = 2889,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "黑翼蝠",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 5
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "火岩龙蜥",
                                    ["描述"] = "地脉暴君，甲厚如山，喷焰焚林",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "火岩龙蜥",
                                    ["基础等级"] = 24,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*0.7*1.12*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*2*1.12*1)^1.1",
                                        ["速度"] = "30 "
                                    },
                                    ["图鉴图标"] = "火岩龙蜥",
                                    ["图鉴击杀数"] = 13797,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "火岩龙蜥",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 21
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "毒窟蝠",
                                    ["描述"] = "瘴穴妖蝠，翼带剧毒，快若鬼影",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "毒窟蝠",
                                    ["基础等级"] = 28,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.14*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*0.7*1.14*1)^1.1",
                                        ["速度"] = "100 "
                                    },
                                    ["图鉴图标"] = "毒窟蝠",
                                    ["图鉴击杀数"] = 15904,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "毒窟蝠",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 20
                            }
                        },
                        ["持续时间"] = 67.626,
                        ["数量"] = 166,
                        ["最大数量"] = 166,
                        ["开始时间"] = 0
                    }
                },
                ["加空间概率"] = 8,
                ["加空间格数"] = 2.2,
                ["属性倍率"] = 2.09,
                ["给予灵蕴"] = 45,
                ["总计经验"] = 706
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "火焰灵狐",
                                    ["描述"] = "熔火狐妖，尾燎焦土，爪裂金石",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "火焰灵狐",
                                    ["基础等级"] = 21,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1.1*1.105*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1.1*1.105*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "火焰灵狐",
                                    ["图鉴击杀数"] = 12235,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "火焰灵狐",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 50
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "镰牙蜥",
                                    ["描述"] = "随处可见，普通小妖，轻松对付",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "镰牙蜥",
                                    ["基础等级"] = 1,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.005*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1*1.005*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "镰牙蜥",
                                    ["图鉴击杀数"] = 2438,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "镰牙蜥",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 20
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "猛冲蜥",
                                    ["描述"] = "沙丘暴徒，略为强硬，不难解决",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "猛冲蜥",
                                    ["基础等级"] = 6,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.03*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1*1.03*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "猛冲蜥",
                                    ["图鉴击杀数"] = 4750,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "猛冲蜥",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 10
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "黑翼蝠",
                                    ["描述"] = "夜行鬼魅，振翅迅捷，需要小心",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "黑翼蝠",
                                    ["基础等级"] = 2,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.01*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*0.8*1.01*1)^1.1",
                                        ["速度"] = "80 "
                                    },
                                    ["图鉴图标"] = "黑翼蝠",
                                    ["图鉴击杀数"] = 2889,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "黑翼蝠",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 5
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "火岩龙蜥",
                                    ["描述"] = "地脉暴君，甲厚如山，喷焰焚林",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "火岩龙蜥",
                                    ["基础等级"] = 24,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*0.7*1.12*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*2*1.12*1)^1.1",
                                        ["速度"] = "30 "
                                    },
                                    ["图鉴图标"] = "火岩龙蜥",
                                    ["图鉴击杀数"] = 13797,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "火岩龙蜥",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 21
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "毒窟蝠",
                                    ["描述"] = "瘴穴妖蝠，翼带剧毒，快若鬼影",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "毒窟蝠",
                                    ["基础等级"] = 28,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.14*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*0.7*1.14*1)^1.1",
                                        ["速度"] = "100 "
                                    },
                                    ["图鉴图标"] = "毒窟蝠",
                                    ["图鉴击杀数"] = 15904,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "毒窟蝠",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 20
                            }
                        },
                        ["持续时间"] = 71.7912,
                        ["数量"] = 182,
                        ["最大数量"] = 182,
                        ["开始时间"] = 0
                    }
                },
                ["加空间概率"] = 8,
                ["加空间格数"] = 2.4,
                ["属性倍率"] = 2.26800013,
                ["给予灵蕴"] = 51,
                ["总计经验"] = 815
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "火焰灵狐",
                                    ["描述"] = "熔火狐妖，尾燎焦土，爪裂金石",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "火焰灵狐",
                                    ["基础等级"] = 21,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1.1*1.105*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1.1*1.105*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "火焰灵狐",
                                    ["图鉴击杀数"] = 12235,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "火焰灵狐",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 50
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "镰牙蜥",
                                    ["描述"] = "随处可见，普通小妖，轻松对付",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "镰牙蜥",
                                    ["基础等级"] = 1,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.005*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1*1.005*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "镰牙蜥",
                                    ["图鉴击杀数"] = 2438,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "镰牙蜥",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 20
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "猛冲蜥",
                                    ["描述"] = "沙丘暴徒，略为强硬，不难解决",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "猛冲蜥",
                                    ["基础等级"] = 6,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.03*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1*1.03*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "猛冲蜥",
                                    ["图鉴击杀数"] = 4750,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "猛冲蜥",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 10
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "黑翼蝠",
                                    ["描述"] = "夜行鬼魅，振翅迅捷，需要小心",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "黑翼蝠",
                                    ["基础等级"] = 2,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.01*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*0.8*1.01*1)^1.1",
                                        ["速度"] = "80 "
                                    },
                                    ["图鉴图标"] = "黑翼蝠",
                                    ["图鉴击杀数"] = 2889,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "黑翼蝠",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 5
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "火岩龙蜥",
                                    ["描述"] = "地脉暴君，甲厚如山，喷焰焚林",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "火岩龙蜥",
                                    ["基础等级"] = 24,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*0.7*1.12*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*2*1.12*1)^1.1",
                                        ["速度"] = "30 "
                                    },
                                    ["图鉴图标"] = "火岩龙蜥",
                                    ["图鉴击杀数"] = 13797,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "火岩龙蜥",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 21
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "毒窟蝠",
                                    ["描述"] = "瘴穴妖蝠，翼带剧毒，快若鬼影",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "毒窟蝠",
                                    ["基础等级"] = 28,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.14*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*0.7*1.14*1)^1.1",
                                        ["速度"] = "100 "
                                    },
                                    ["图鉴图标"] = "毒窟蝠",
                                    ["图鉴击杀数"] = 15904,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "毒窟蝠",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 20
                            }
                        },
                        ["持续时间"] = 75.9564,
                        ["数量"] = 198,
                        ["最大数量"] = 198,
                        ["开始时间"] = 0
                    },
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "爬行怪",
                                    ["描述"] = "地底魔尊，肢如刀戟，遁土噬心",
                                    ["是首领"] = true,
                                    ["怪物ID"] = "爬行怪",
                                    ["基础等级"] = 30,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1.2*1.15*20)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1*1.15*20)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "爬行怪",
                                    ["图鉴击杀数"] = 167,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "爬行怪",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 1
                            }
                        },
                        ["持续时间"] = 1,
                        ["数量"] = 1,
                        ["最大数量"] = 1,
                        ["开始时间"] = 37.9782
                    }
                },
                ["加空间概率"] = 8,
                ["加空间格数"] = 2.6,
                ["属性倍率"] = 2.446,
                ["给予灵蕴"] = 57,
                ["总计经验"] = 924
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "火焰灵狐",
                                    ["描述"] = "熔火狐妖，尾燎焦土，爪裂金石",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "火焰灵狐",
                                    ["基础等级"] = 21,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1.1*1.105*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1.1*1.105*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "火焰灵狐",
                                    ["图鉴击杀数"] = 12235,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "火焰灵狐",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 50
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "镰牙蜥",
                                    ["描述"] = "随处可见，普通小妖，轻松对付",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "镰牙蜥",
                                    ["基础等级"] = 1,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.005*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1*1.005*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "镰牙蜥",
                                    ["图鉴击杀数"] = 2438,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "镰牙蜥",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 20
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "猛冲蜥",
                                    ["描述"] = "沙丘暴徒，略为强硬，不难解决",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "猛冲蜥",
                                    ["基础等级"] = 6,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.03*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1*1.03*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "猛冲蜥",
                                    ["图鉴击杀数"] = 4750,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "猛冲蜥",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 10
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "黑翼蝠",
                                    ["描述"] = "夜行鬼魅，振翅迅捷，需要小心",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "黑翼蝠",
                                    ["基础等级"] = 2,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.01*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*0.8*1.01*1)^1.1",
                                        ["速度"] = "80 "
                                    },
                                    ["图鉴图标"] = "黑翼蝠",
                                    ["图鉴击杀数"] = 2889,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "黑翼蝠",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 5
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "火岩龙蜥",
                                    ["描述"] = "地脉暴君，甲厚如山，喷焰焚林",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "火岩龙蜥",
                                    ["基础等级"] = 24,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*0.7*1.12*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*2*1.12*1)^1.1",
                                        ["速度"] = "30 "
                                    },
                                    ["图鉴图标"] = "火岩龙蜥",
                                    ["图鉴击杀数"] = 13797,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "火岩龙蜥",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 21
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "毒窟蝠",
                                    ["描述"] = "瘴穴妖蝠，翼带剧毒，快若鬼影",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "毒窟蝠",
                                    ["基础等级"] = 28,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.14*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*0.7*1.14*1)^1.1",
                                        ["速度"] = "100 "
                                    },
                                    ["图鉴图标"] = "毒窟蝠",
                                    ["图鉴击杀数"] = 15904,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "毒窟蝠",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 20
                            }
                        },
                        ["持续时间"] = 80.1216,
                        ["数量"] = 213,
                        ["最大数量"] = 213,
                        ["开始时间"] = 0
                    }
                },
                ["加空间概率"] = 8,
                ["加空间格数"] = 2.8,
                ["属性倍率"] = 2.624,
                ["给予灵蕴"] = 63,
                ["总计经验"] = 1033
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "火焰灵狐",
                                    ["描述"] = "熔火狐妖，尾燎焦土，爪裂金石",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "火焰灵狐",
                                    ["基础等级"] = 21,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1.1*1.105*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1.1*1.105*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "火焰灵狐",
                                    ["图鉴击杀数"] = 12235,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "火焰灵狐",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 50
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "镰牙蜥",
                                    ["描述"] = "随处可见，普通小妖，轻松对付",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "镰牙蜥",
                                    ["基础等级"] = 1,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.005*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1*1.005*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "镰牙蜥",
                                    ["图鉴击杀数"] = 2438,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "镰牙蜥",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 20
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "猛冲蜥",
                                    ["描述"] = "沙丘暴徒，略为强硬，不难解决",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "猛冲蜥",
                                    ["基础等级"] = 6,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.03*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1*1.03*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "猛冲蜥",
                                    ["图鉴击杀数"] = 4750,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "猛冲蜥",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 10
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "黑翼蝠",
                                    ["描述"] = "夜行鬼魅，振翅迅捷，需要小心",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "黑翼蝠",
                                    ["基础等级"] = 2,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.01*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*0.8*1.01*1)^1.1",
                                        ["速度"] = "80 "
                                    },
                                    ["图鉴图标"] = "黑翼蝠",
                                    ["图鉴击杀数"] = 2889,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "黑翼蝠",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 5
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "火岩龙蜥",
                                    ["描述"] = "地脉暴君，甲厚如山，喷焰焚林",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "火岩龙蜥",
                                    ["基础等级"] = 24,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*0.7*1.12*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*2*1.12*1)^1.1",
                                        ["速度"] = "30 "
                                    },
                                    ["图鉴图标"] = "火岩龙蜥",
                                    ["图鉴击杀数"] = 13797,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "火岩龙蜥",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 21
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "毒窟蝠",
                                    ["描述"] = "瘴穴妖蝠，翼带剧毒，快若鬼影",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "毒窟蝠",
                                    ["基础等级"] = 28,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.14*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*0.7*1.14*1)^1.1",
                                        ["速度"] = "100 "
                                    },
                                    ["图鉴图标"] = "毒窟蝠",
                                    ["图鉴击杀数"] = 15904,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "毒窟蝠",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 20
                            }
                        },
                        ["持续时间"] = 84.2868042,
                        ["数量"] = 229,
                        ["最大数量"] = 229,
                        ["开始时间"] = 0
                    },
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "爬行怪",
                                    ["描述"] = "地底魔尊，肢如刀戟，遁土噬心",
                                    ["是首领"] = true,
                                    ["怪物ID"] = "爬行怪",
                                    ["基础等级"] = 30,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1.2*1.15*20)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1*1.15*20)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "爬行怪",
                                    ["图鉴击杀数"] = 167,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "爬行怪",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 1
                            }
                        },
                        ["持续时间"] = 1,
                        ["数量"] = 1,
                        ["最大数量"] = 1,
                        ["开始时间"] = 42.1434021
                    }
                },
                ["加空间概率"] = 8,
                ["加空间格数"] = 3,
                ["属性倍率"] = 2.902,
                ["给予灵蕴"] = 69,
                ["总计经验"] = 1142
            }
        },
        ["完成奖励_1星"] = {
            [""] = 1500
        },
        ["完成奖励_3星"] = {
            [""] = 100
        },
        ["初始必加空间"] = true,
        ["等级"] = 0,
        ["初始背包宽"] = 3,
        ["初始背包高"] = 3,
        ["描述_2星"] = "生命大于30％",
        ["描述_3星"] = "生命大于70％",
        ["怪物等级"] = 1
    }),
    ["3-4"] = Level.New({
        ["关卡ID"] = "3-4",
        ["分类"] = "主线",
        ["关卡波次"] = {
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "火焰灵狐",
                                    ["描述"] = "熔火狐妖，尾燎焦土，爪裂金石",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "火焰灵狐",
                                    ["基础等级"] = 21,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1.1*1.105*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1.1*1.105*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "火焰灵狐",
                                    ["图鉴击杀数"] = 12235,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "火焰灵狐",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 50
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "镰牙蜥",
                                    ["描述"] = "随处可见，普通小妖，轻松对付",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "镰牙蜥",
                                    ["基础等级"] = 1,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.005*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1*1.005*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "镰牙蜥",
                                    ["图鉴击杀数"] = 2438,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "镰牙蜥",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 20
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "火岩龙蜥",
                                    ["描述"] = "地脉暴君，甲厚如山，喷焰焚林",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "火岩龙蜥",
                                    ["基础等级"] = 24,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*0.7*1.12*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*2*1.12*1)^1.1",
                                        ["速度"] = "30 "
                                    },
                                    ["图鉴图标"] = "火岩龙蜥",
                                    ["图鉴击杀数"] = 13797,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "火岩龙蜥",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 10
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "黑翼蝠",
                                    ["描述"] = "夜行鬼魅，振翅迅捷，需要小心",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "黑翼蝠",
                                    ["基础等级"] = 2,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.01*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*0.8*1.01*1)^1.1",
                                        ["速度"] = "80 "
                                    },
                                    ["图鉴图标"] = "黑翼蝠",
                                    ["图鉴击杀数"] = 2889,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "黑翼蝠",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 5
                            }
                        },
                        ["持续时间"] = 51,
                        ["数量"] = 95,
                        ["最大数量"] = 95,
                        ["开始时间"] = 0
                    }
                },
                ["加空间概率"] = 8,
                ["加空间格数"] = 1.2,
                ["属性倍率"] = 1,
                ["给予灵蕴"] = 15,
                ["总计经验"] = 156
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "火焰灵狐",
                                    ["描述"] = "熔火狐妖，尾燎焦土，爪裂金石",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "火焰灵狐",
                                    ["基础等级"] = 21,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1.1*1.105*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1.1*1.105*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "火焰灵狐",
                                    ["图鉴击杀数"] = 12235,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "火焰灵狐",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 50
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "镰牙蜥",
                                    ["描述"] = "随处可见，普通小妖，轻松对付",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "镰牙蜥",
                                    ["基础等级"] = 1,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.005*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1*1.005*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "镰牙蜥",
                                    ["图鉴击杀数"] = 2438,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "镰牙蜥",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 20
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "火岩龙蜥",
                                    ["描述"] = "地脉暴君，甲厚如山，喷焰焚林",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "火岩龙蜥",
                                    ["基础等级"] = 24,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*0.7*1.12*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*2*1.12*1)^1.1",
                                        ["速度"] = "30 "
                                    },
                                    ["图鉴图标"] = "火岩龙蜥",
                                    ["图鉴击杀数"] = 13797,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "火岩龙蜥",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 10
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "黑翼蝠",
                                    ["描述"] = "夜行鬼魅，振翅迅捷，需要小心",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "黑翼蝠",
                                    ["基础等级"] = 2,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.01*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*0.8*1.01*1)^1.1",
                                        ["速度"] = "80 "
                                    },
                                    ["图鉴图标"] = "黑翼蝠",
                                    ["图鉴击杀数"] = 2889,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "黑翼蝠",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 5
                            }
                        },
                        ["持续时间"] = 55.7175,
                        ["数量"] = 113,
                        ["最大数量"] = 113,
                        ["开始时间"] = 0
                    }
                },
                ["加空间概率"] = 8,
                ["加空间格数"] = 1.4,
                ["属性倍率"] = 1.185,
                ["给予灵蕴"] = 21,
                ["总计经验"] = 262
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "火焰灵狐",
                                    ["描述"] = "熔火狐妖，尾燎焦土，爪裂金石",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "火焰灵狐",
                                    ["基础等级"] = 21,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1.1*1.105*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1.1*1.105*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "火焰灵狐",
                                    ["图鉴击杀数"] = 12235,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "火焰灵狐",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 50
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "镰牙蜥",
                                    ["描述"] = "随处可见，普通小妖，轻松对付",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "镰牙蜥",
                                    ["基础等级"] = 1,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.005*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1*1.005*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "镰牙蜥",
                                    ["图鉴击杀数"] = 2438,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "镰牙蜥",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 20
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "火岩龙蜥",
                                    ["描述"] = "地脉暴君，甲厚如山，喷焰焚林",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "火岩龙蜥",
                                    ["基础等级"] = 24,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*0.7*1.12*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*2*1.12*1)^1.1",
                                        ["速度"] = "30 "
                                    },
                                    ["图鉴图标"] = "火岩龙蜥",
                                    ["图鉴击杀数"] = 13797,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "火岩龙蜥",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 10
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "黑翼蝠",
                                    ["描述"] = "夜行鬼魅，振翅迅捷，需要小心",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "黑翼蝠",
                                    ["基础等级"] = 2,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.01*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*0.8*1.01*1)^1.1",
                                        ["速度"] = "80 "
                                    },
                                    ["图鉴图标"] = "黑翼蝠",
                                    ["图鉴击杀数"] = 2889,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "黑翼蝠",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 5
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "毒窟蝠",
                                    ["描述"] = "瘴穴妖蝠，翼带剧毒，快若鬼影",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "毒窟蝠",
                                    ["基础等级"] = 28,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.14*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*0.7*1.14*1)^1.1",
                                        ["速度"] = "100 "
                                    },
                                    ["图鉴图标"] = "毒窟蝠",
                                    ["图鉴击杀数"] = 15904,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "毒窟蝠",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 15
                            }
                        },
                        ["持续时间"] = 60.435,
                        ["数量"] = 130,
                        ["最大数量"] = 130,
                        ["开始时间"] = 0
                    }
                },
                ["加空间概率"] = 8,
                ["加空间格数"] = 1.6,
                ["属性倍率"] = 1.37,
                ["给予灵蕴"] = 27,
                ["总计经验"] = 368
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "火焰灵狐",
                                    ["描述"] = "熔火狐妖，尾燎焦土，爪裂金石",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "火焰灵狐",
                                    ["基础等级"] = 21,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1.1*1.105*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1.1*1.105*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "火焰灵狐",
                                    ["图鉴击杀数"] = 12235,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "火焰灵狐",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 50
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "镰牙蜥",
                                    ["描述"] = "随处可见，普通小妖，轻松对付",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "镰牙蜥",
                                    ["基础等级"] = 1,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.005*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1*1.005*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "镰牙蜥",
                                    ["图鉴击杀数"] = 2438,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "镰牙蜥",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 20
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "火岩龙蜥",
                                    ["描述"] = "地脉暴君，甲厚如山，喷焰焚林",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "火岩龙蜥",
                                    ["基础等级"] = 24,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*0.7*1.12*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*2*1.12*1)^1.1",
                                        ["速度"] = "30 "
                                    },
                                    ["图鉴图标"] = "火岩龙蜥",
                                    ["图鉴击杀数"] = 13797,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "火岩龙蜥",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 10
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "黑翼蝠",
                                    ["描述"] = "夜行鬼魅，振翅迅捷，需要小心",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "黑翼蝠",
                                    ["基础等级"] = 2,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.01*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*0.8*1.01*1)^1.1",
                                        ["速度"] = "80 "
                                    },
                                    ["图鉴图标"] = "黑翼蝠",
                                    ["图鉴击杀数"] = 2889,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "黑翼蝠",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 5
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "毒窟蝠",
                                    ["描述"] = "瘴穴妖蝠，翼带剧毒，快若鬼影",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "毒窟蝠",
                                    ["基础等级"] = 28,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.14*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*0.7*1.14*1)^1.1",
                                        ["速度"] = "100 "
                                    },
                                    ["图鉴图标"] = "毒窟蝠",
                                    ["图鉴击杀数"] = 15904,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "毒窟蝠",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 15
                            }
                        },
                        ["持续时间"] = 65.152504,
                        ["数量"] = 148,
                        ["最大数量"] = 148,
                        ["开始时间"] = 0
                    },
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "岩浆徘行者",
                                    ["描述"] = "地心魔物，步履熔岩，所过皆烬",
                                    ["是首领"] = true,
                                    ["怪物ID"] = "岩浆徘行者",
                                    ["基础等级"] = 26,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.13*20)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1*1.13*20)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "岩浆徘行者",
                                    ["图鉴击杀数"] = 146,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "岩浆徘行者",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 1
                            }
                        },
                        ["持续时间"] = 1,
                        ["数量"] = 1,
                        ["最大数量"] = 1,
                        ["开始时间"] = 32.576252
                    }
                },
                ["加空间概率"] = 8,
                ["加空间格数"] = 1.8,
                ["属性倍率"] = 1.55500007,
                ["给予灵蕴"] = 33,
                ["总计经验"] = 474
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "火焰灵狐",
                                    ["描述"] = "熔火狐妖，尾燎焦土，爪裂金石",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "火焰灵狐",
                                    ["基础等级"] = 21,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1.1*1.105*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1.1*1.105*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "火焰灵狐",
                                    ["图鉴击杀数"] = 12235,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "火焰灵狐",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 50
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "镰牙蜥",
                                    ["描述"] = "随处可见，普通小妖，轻松对付",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "镰牙蜥",
                                    ["基础等级"] = 1,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.005*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1*1.005*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "镰牙蜥",
                                    ["图鉴击杀数"] = 2438,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "镰牙蜥",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 20
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "火岩龙蜥",
                                    ["描述"] = "地脉暴君，甲厚如山，喷焰焚林",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "火岩龙蜥",
                                    ["基础等级"] = 24,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*0.7*1.12*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*2*1.12*1)^1.1",
                                        ["速度"] = "30 "
                                    },
                                    ["图鉴图标"] = "火岩龙蜥",
                                    ["图鉴击杀数"] = 13797,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "火岩龙蜥",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 10
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "黑翼蝠",
                                    ["描述"] = "夜行鬼魅，振翅迅捷，需要小心",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "黑翼蝠",
                                    ["基础等级"] = 2,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.01*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*0.8*1.01*1)^1.1",
                                        ["速度"] = "80 "
                                    },
                                    ["图鉴图标"] = "黑翼蝠",
                                    ["图鉴击杀数"] = 2889,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "黑翼蝠",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 5
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "毒窟蝠",
                                    ["描述"] = "瘴穴妖蝠，翼带剧毒，快若鬼影",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "毒窟蝠",
                                    ["基础等级"] = 28,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.14*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*0.7*1.14*1)^1.1",
                                        ["速度"] = "100 "
                                    },
                                    ["图鉴图标"] = "毒窟蝠",
                                    ["图鉴击杀数"] = 15904,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "毒窟蝠",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 15
                            }
                        },
                        ["持续时间"] = 69.87,
                        ["数量"] = 165,
                        ["最大数量"] = 165,
                        ["开始时间"] = 0
                    }
                },
                ["加空间概率"] = 8,
                ["加空间格数"] = 2,
                ["属性倍率"] = 1.94,
                ["给予灵蕴"] = 39,
                ["总计经验"] = 580
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "火焰灵狐",
                                    ["描述"] = "熔火狐妖，尾燎焦土，爪裂金石",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "火焰灵狐",
                                    ["基础等级"] = 21,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1.1*1.105*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1.1*1.105*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "火焰灵狐",
                                    ["图鉴击杀数"] = 12235,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "火焰灵狐",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 50
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "镰牙蜥",
                                    ["描述"] = "随处可见，普通小妖，轻松对付",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "镰牙蜥",
                                    ["基础等级"] = 1,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.005*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1*1.005*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "镰牙蜥",
                                    ["图鉴击杀数"] = 2438,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "镰牙蜥",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 20
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "火岩龙蜥",
                                    ["描述"] = "地脉暴君，甲厚如山，喷焰焚林",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "火岩龙蜥",
                                    ["基础等级"] = 24,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*0.7*1.12*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*2*1.12*1)^1.1",
                                        ["速度"] = "30 "
                                    },
                                    ["图鉴图标"] = "火岩龙蜥",
                                    ["图鉴击杀数"] = 13797,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "火岩龙蜥",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 10
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "黑翼蝠",
                                    ["描述"] = "夜行鬼魅，振翅迅捷，需要小心",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "黑翼蝠",
                                    ["基础等级"] = 2,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.01*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*0.8*1.01*1)^1.1",
                                        ["速度"] = "80 "
                                    },
                                    ["图鉴图标"] = "黑翼蝠",
                                    ["图鉴击杀数"] = 2889,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "黑翼蝠",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 5
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "毒窟蝠",
                                    ["描述"] = "瘴穴妖蝠，翼带剧毒，快若鬼影",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "毒窟蝠",
                                    ["基础等级"] = 28,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.14*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*0.7*1.14*1)^1.1",
                                        ["速度"] = "100 "
                                    },
                                    ["图鉴图标"] = "毒窟蝠",
                                    ["图鉴击杀数"] = 15904,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "毒窟蝠",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 15
                            }
                        },
                        ["持续时间"] = 74.5875,
                        ["数量"] = 183,
                        ["最大数量"] = 183,
                        ["开始时间"] = 0
                    }
                },
                ["加空间概率"] = 8,
                ["加空间格数"] = 2.2,
                ["属性倍率"] = 2.125,
                ["给予灵蕴"] = 45,
                ["总计经验"] = 686
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "火焰灵狐",
                                    ["描述"] = "熔火狐妖，尾燎焦土，爪裂金石",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "火焰灵狐",
                                    ["基础等级"] = 21,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1.1*1.105*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1.1*1.105*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "火焰灵狐",
                                    ["图鉴击杀数"] = 12235,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "火焰灵狐",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 50
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "镰牙蜥",
                                    ["描述"] = "随处可见，普通小妖，轻松对付",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "镰牙蜥",
                                    ["基础等级"] = 1,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.005*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1*1.005*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "镰牙蜥",
                                    ["图鉴击杀数"] = 2438,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "镰牙蜥",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 20
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "火岩龙蜥",
                                    ["描述"] = "地脉暴君，甲厚如山，喷焰焚林",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "火岩龙蜥",
                                    ["基础等级"] = 24,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*0.7*1.12*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*2*1.12*1)^1.1",
                                        ["速度"] = "30 "
                                    },
                                    ["图鉴图标"] = "火岩龙蜥",
                                    ["图鉴击杀数"] = 13797,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "火岩龙蜥",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 10
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "黑翼蝠",
                                    ["描述"] = "夜行鬼魅，振翅迅捷，需要小心",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "黑翼蝠",
                                    ["基础等级"] = 2,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.01*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*0.8*1.01*1)^1.1",
                                        ["速度"] = "80 "
                                    },
                                    ["图鉴图标"] = "黑翼蝠",
                                    ["图鉴击杀数"] = 2889,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "黑翼蝠",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 5
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "毒窟蝠",
                                    ["描述"] = "瘴穴妖蝠，翼带剧毒，快若鬼影",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "毒窟蝠",
                                    ["基础等级"] = 28,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.14*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*0.7*1.14*1)^1.1",
                                        ["速度"] = "100 "
                                    },
                                    ["图鉴图标"] = "毒窟蝠",
                                    ["图鉴击杀数"] = 15904,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "毒窟蝠",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 15
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "幼火龙",
                                    ["描述"] = "龙裔遗孤，披甲炽焰，凶性初显",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "幼火龙",
                                    ["基础等级"] = 29,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1.2*1.145*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1.2*1.145*1)^1.1",
                                        ["速度"] = "70 "
                                    },
                                    ["图鉴图标"] = "幼火龙",
                                    ["图鉴击杀数"] = 16435,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "幼火龙",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 25
                            }
                        },
                        ["持续时间"] = 79.305,
                        ["数量"] = 200,
                        ["最大数量"] = 200,
                        ["开始时间"] = 0
                    },
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "爬行怪",
                                    ["描述"] = "地底魔尊，肢如刀戟，遁土噬心",
                                    ["是首领"] = true,
                                    ["怪物ID"] = "爬行怪",
                                    ["基础等级"] = 30,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1.2*1.15*20)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1*1.15*20)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "爬行怪",
                                    ["图鉴击杀数"] = 167,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "爬行怪",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 1
                            }
                        },
                        ["持续时间"] = 1,
                        ["数量"] = 1,
                        ["最大数量"] = 1,
                        ["开始时间"] = 39.6525
                    }
                },
                ["加空间概率"] = 8,
                ["加空间格数"] = 2.4,
                ["属性倍率"] = 2.31000018,
                ["给予灵蕴"] = 51,
                ["总计经验"] = 792
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "火焰灵狐",
                                    ["描述"] = "熔火狐妖，尾燎焦土，爪裂金石",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "火焰灵狐",
                                    ["基础等级"] = 21,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1.1*1.105*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1.1*1.105*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "火焰灵狐",
                                    ["图鉴击杀数"] = 12235,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "火焰灵狐",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 50
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "镰牙蜥",
                                    ["描述"] = "随处可见，普通小妖，轻松对付",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "镰牙蜥",
                                    ["基础等级"] = 1,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.005*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1*1.005*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "镰牙蜥",
                                    ["图鉴击杀数"] = 2438,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "镰牙蜥",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 20
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "火岩龙蜥",
                                    ["描述"] = "地脉暴君，甲厚如山，喷焰焚林",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "火岩龙蜥",
                                    ["基础等级"] = 24,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*0.7*1.12*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*2*1.12*1)^1.1",
                                        ["速度"] = "30 "
                                    },
                                    ["图鉴图标"] = "火岩龙蜥",
                                    ["图鉴击杀数"] = 13797,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "火岩龙蜥",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 10
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "黑翼蝠",
                                    ["描述"] = "夜行鬼魅，振翅迅捷，需要小心",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "黑翼蝠",
                                    ["基础等级"] = 2,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.01*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*0.8*1.01*1)^1.1",
                                        ["速度"] = "80 "
                                    },
                                    ["图鉴图标"] = "黑翼蝠",
                                    ["图鉴击杀数"] = 2889,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "黑翼蝠",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 5
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "毒窟蝠",
                                    ["描述"] = "瘴穴妖蝠，翼带剧毒，快若鬼影",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "毒窟蝠",
                                    ["基础等级"] = 28,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.14*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*0.7*1.14*1)^1.1",
                                        ["速度"] = "100 "
                                    },
                                    ["图鉴图标"] = "毒窟蝠",
                                    ["图鉴击杀数"] = 15904,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "毒窟蝠",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 15
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "幼火龙",
                                    ["描述"] = "龙裔遗孤，披甲炽焰，凶性初显",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "幼火龙",
                                    ["基础等级"] = 29,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1.2*1.145*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1.2*1.145*1)^1.1",
                                        ["速度"] = "70 "
                                    },
                                    ["图鉴图标"] = "幼火龙",
                                    ["图鉴击杀数"] = 16435,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "幼火龙",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 25
                            }
                        },
                        ["持续时间"] = 84.0225,
                        ["数量"] = 218,
                        ["最大数量"] = 218,
                        ["开始时间"] = 0
                    }
                },
                ["加空间概率"] = 8,
                ["加空间格数"] = 2.6,
                ["属性倍率"] = 2.49500012,
                ["给予灵蕴"] = 57,
                ["总计经验"] = 898
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "火焰灵狐",
                                    ["描述"] = "熔火狐妖，尾燎焦土，爪裂金石",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "火焰灵狐",
                                    ["基础等级"] = 21,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1.1*1.105*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1.1*1.105*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "火焰灵狐",
                                    ["图鉴击杀数"] = 12235,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "火焰灵狐",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 50
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "镰牙蜥",
                                    ["描述"] = "随处可见，普通小妖，轻松对付",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "镰牙蜥",
                                    ["基础等级"] = 1,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.005*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1*1.005*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "镰牙蜥",
                                    ["图鉴击杀数"] = 2438,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "镰牙蜥",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 20
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "火岩龙蜥",
                                    ["描述"] = "地脉暴君，甲厚如山，喷焰焚林",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "火岩龙蜥",
                                    ["基础等级"] = 24,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*0.7*1.12*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*2*1.12*1)^1.1",
                                        ["速度"] = "30 "
                                    },
                                    ["图鉴图标"] = "火岩龙蜥",
                                    ["图鉴击杀数"] = 13797,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "火岩龙蜥",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 10
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "黑翼蝠",
                                    ["描述"] = "夜行鬼魅，振翅迅捷，需要小心",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "黑翼蝠",
                                    ["基础等级"] = 2,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.01*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*0.8*1.01*1)^1.1",
                                        ["速度"] = "80 "
                                    },
                                    ["图鉴图标"] = "黑翼蝠",
                                    ["图鉴击杀数"] = 2889,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "黑翼蝠",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 5
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "毒窟蝠",
                                    ["描述"] = "瘴穴妖蝠，翼带剧毒，快若鬼影",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "毒窟蝠",
                                    ["基础等级"] = 28,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.14*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*0.7*1.14*1)^1.1",
                                        ["速度"] = "100 "
                                    },
                                    ["图鉴图标"] = "毒窟蝠",
                                    ["图鉴击杀数"] = 15904,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "毒窟蝠",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 15
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "幼火龙",
                                    ["描述"] = "龙裔遗孤，披甲炽焰，凶性初显",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "幼火龙",
                                    ["基础等级"] = 29,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1.2*1.145*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1.2*1.145*1)^1.1",
                                        ["速度"] = "70 "
                                    },
                                    ["图鉴图标"] = "幼火龙",
                                    ["图鉴击杀数"] = 16435,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "幼火龙",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 25
                            }
                        },
                        ["持续时间"] = 88.7400055,
                        ["数量"] = 236,
                        ["最大数量"] = 236,
                        ["开始时间"] = 0
                    },
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "岩浆徘行者",
                                    ["描述"] = "地心魔物，步履熔岩，所过皆烬",
                                    ["是首领"] = true,
                                    ["怪物ID"] = "岩浆徘行者",
                                    ["基础等级"] = 26,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.13*20)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1*1.13*20)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "岩浆徘行者",
                                    ["图鉴击杀数"] = 146,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "岩浆徘行者",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 1
                            }
                        },
                        ["持续时间"] = 1,
                        ["数量"] = 1,
                        ["最大数量"] = 1,
                        ["开始时间"] = 44.3700027
                    }
                },
                ["加空间概率"] = 8,
                ["加空间格数"] = 2.8,
                ["属性倍率"] = 2.68,
                ["给予灵蕴"] = 63,
                ["总计经验"] = 1004
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "火焰灵狐",
                                    ["描述"] = "熔火狐妖，尾燎焦土，爪裂金石",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "火焰灵狐",
                                    ["基础等级"] = 21,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1.1*1.105*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1.1*1.105*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "火焰灵狐",
                                    ["图鉴击杀数"] = 12235,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "火焰灵狐",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 50
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "镰牙蜥",
                                    ["描述"] = "随处可见，普通小妖，轻松对付",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "镰牙蜥",
                                    ["基础等级"] = 1,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.005*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1*1.005*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "镰牙蜥",
                                    ["图鉴击杀数"] = 2438,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "镰牙蜥",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 20
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "火岩龙蜥",
                                    ["描述"] = "地脉暴君，甲厚如山，喷焰焚林",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "火岩龙蜥",
                                    ["基础等级"] = 24,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*0.7*1.12*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*2*1.12*1)^1.1",
                                        ["速度"] = "30 "
                                    },
                                    ["图鉴图标"] = "火岩龙蜥",
                                    ["图鉴击杀数"] = 13797,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "火岩龙蜥",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 10
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "黑翼蝠",
                                    ["描述"] = "夜行鬼魅，振翅迅捷，需要小心",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "黑翼蝠",
                                    ["基础等级"] = 2,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.01*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*0.8*1.01*1)^1.1",
                                        ["速度"] = "80 "
                                    },
                                    ["图鉴图标"] = "黑翼蝠",
                                    ["图鉴击杀数"] = 2889,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "黑翼蝠",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 5
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "毒窟蝠",
                                    ["描述"] = "瘴穴妖蝠，翼带剧毒，快若鬼影",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "毒窟蝠",
                                    ["基础等级"] = 28,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.14*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*0.7*1.14*1)^1.1",
                                        ["速度"] = "100 "
                                    },
                                    ["图鉴图标"] = "毒窟蝠",
                                    ["图鉴击杀数"] = 15904,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "毒窟蝠",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 15
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "幼火龙",
                                    ["描述"] = "龙裔遗孤，披甲炽焰，凶性初显",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "幼火龙",
                                    ["基础等级"] = 29,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1.2*1.145*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1.2*1.145*1)^1.1",
                                        ["速度"] = "70 "
                                    },
                                    ["图鉴图标"] = "幼火龙",
                                    ["图鉴击杀数"] = 16435,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "幼火龙",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 25
                            }
                        },
                        ["持续时间"] = 93.4575043,
                        ["数量"] = 253,
                        ["最大数量"] = 253,
                        ["开始时间"] = 0
                    },
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "爬行怪",
                                    ["描述"] = "地底魔尊，肢如刀戟，遁土噬心",
                                    ["是首领"] = true,
                                    ["怪物ID"] = "爬行怪",
                                    ["基础等级"] = 30,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1.2*1.15*20)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1*1.15*20)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "爬行怪",
                                    ["图鉴击杀数"] = 167,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "爬行怪",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 1
                            }
                        },
                        ["持续时间"] = 1,
                        ["数量"] = 1,
                        ["最大数量"] = 1,
                        ["开始时间"] = 46.7287521
                    }
                },
                ["加空间概率"] = 8,
                ["加空间格数"] = 3,
                ["属性倍率"] = 3.065,
                ["给予灵蕴"] = 69,
                ["总计经验"] = 1110
            }
        },
        ["完成奖励_1星"] = {
            [""] = 1500
        },
        ["完成奖励_3星"] = {
            [""] = 100
        },
        ["初始必加空间"] = true,
        ["等级"] = 31,
        ["初始背包宽"] = 3,
        ["初始背包高"] = 3,
        ["描述_2星"] = "生命大于30％",
        ["描述_3星"] = "生命大于70％",
        ["怪物等级"] = 1
    }),
    ["3-5"] = Level.New({
        ["关卡ID"] = "3-5",
        ["分类"] = "主线",
        ["关卡波次"] = {
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "火焰灵狐",
                                    ["描述"] = "熔火狐妖，尾燎焦土，爪裂金石",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "火焰灵狐",
                                    ["基础等级"] = 21,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1.1*1.105*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1.1*1.105*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "火焰灵狐",
                                    ["图鉴击杀数"] = 12235,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "火焰灵狐",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 50
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "猛冲蜥",
                                    ["描述"] = "沙丘暴徒，略为强硬，不难解决",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "猛冲蜥",
                                    ["基础等级"] = 6,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.03*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1*1.03*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "猛冲蜥",
                                    ["图鉴击杀数"] = 4750,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "猛冲蜥",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 10
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "毒窟蝠",
                                    ["描述"] = "瘴穴妖蝠，翼带剧毒，快若鬼影",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "毒窟蝠",
                                    ["基础等级"] = 28,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.14*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*0.7*1.14*1)^1.1",
                                        ["速度"] = "100 "
                                    },
                                    ["图鉴图标"] = "毒窟蝠",
                                    ["图鉴击杀数"] = 15904,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "毒窟蝠",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 5
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "幼火龙",
                                    ["描述"] = "龙裔遗孤，披甲炽焰，凶性初显",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "幼火龙",
                                    ["基础等级"] = 29,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1.2*1.145*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1.2*1.145*1)^1.1",
                                        ["速度"] = "70 "
                                    },
                                    ["图鉴图标"] = "幼火龙",
                                    ["图鉴击杀数"] = 16435,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "幼火龙",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 30
                            }
                        },
                        ["持续时间"] = 66,
                        ["数量"] = 120,
                        ["最大数量"] = 120,
                        ["开始时间"] = 0
                    }
                },
                ["加空间概率"] = 7,
                ["加空间格数"] = 1.2,
                ["属性倍率"] = 1,
                ["给予灵蕴"] = 13,
                ["总计经验"] = 139
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "火焰灵狐",
                                    ["描述"] = "熔火狐妖，尾燎焦土，爪裂金石",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "火焰灵狐",
                                    ["基础等级"] = 21,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1.1*1.105*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1.1*1.105*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "火焰灵狐",
                                    ["图鉴击杀数"] = 12235,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "火焰灵狐",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 50
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "猛冲蜥",
                                    ["描述"] = "沙丘暴徒，略为强硬，不难解决",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "猛冲蜥",
                                    ["基础等级"] = 6,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.03*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1*1.03*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "猛冲蜥",
                                    ["图鉴击杀数"] = 4750,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "猛冲蜥",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 10
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "毒窟蝠",
                                    ["描述"] = "瘴穴妖蝠，翼带剧毒，快若鬼影",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "毒窟蝠",
                                    ["基础等级"] = 28,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.14*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*0.7*1.14*1)^1.1",
                                        ["速度"] = "100 "
                                    },
                                    ["图鉴图标"] = "毒窟蝠",
                                    ["图鉴击杀数"] = 15904,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "毒窟蝠",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 5
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "幼火龙",
                                    ["描述"] = "龙裔遗孤，披甲炽焰，凶性初显",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "幼火龙",
                                    ["基础等级"] = 29,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1.2*1.145*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1.2*1.145*1)^1.1",
                                        ["速度"] = "70 "
                                    },
                                    ["图鉴图标"] = "幼火龙",
                                    ["图鉴击杀数"] = 16435,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "幼火龙",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 30
                            }
                        },
                        ["持续时间"] = 72.93,
                        ["数量"] = 145,
                        ["最大数量"] = 145,
                        ["开始时间"] = 0
                    }
                },
                ["加空间概率"] = 7,
                ["加空间格数"] = 1.4,
                ["属性倍率"] = 1.21,
                ["给予灵蕴"] = 18,
                ["总计经验"] = 237
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "火焰灵狐",
                                    ["描述"] = "熔火狐妖，尾燎焦土，爪裂金石",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "火焰灵狐",
                                    ["基础等级"] = 21,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1.1*1.105*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1.1*1.105*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "火焰灵狐",
                                    ["图鉴击杀数"] = 12235,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "火焰灵狐",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 50
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "猛冲蜥",
                                    ["描述"] = "沙丘暴徒，略为强硬，不难解决",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "猛冲蜥",
                                    ["基础等级"] = 6,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.03*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1*1.03*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "猛冲蜥",
                                    ["图鉴击杀数"] = 4750,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "猛冲蜥",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 10
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "毒窟蝠",
                                    ["描述"] = "瘴穴妖蝠，翼带剧毒，快若鬼影",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "毒窟蝠",
                                    ["基础等级"] = 28,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.14*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*0.7*1.14*1)^1.1",
                                        ["速度"] = "100 "
                                    },
                                    ["图鉴图标"] = "毒窟蝠",
                                    ["图鉴击杀数"] = 15904,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "毒窟蝠",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 5
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "幼火龙",
                                    ["描述"] = "龙裔遗孤，披甲炽焰，凶性初显",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "幼火龙",
                                    ["基础等级"] = 29,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1.2*1.145*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1.2*1.145*1)^1.1",
                                        ["速度"] = "70 "
                                    },
                                    ["图鉴图标"] = "幼火龙",
                                    ["图鉴击杀数"] = 16435,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "幼火龙",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 30
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "浮游石",
                                    ["描述"] = "玄磁奇物，悬空缓行，坚不可摧",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "浮游石",
                                    ["基础等级"] = 8,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.04*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1.5*1.04*1)^1.1",
                                        ["速度"] = "30 "
                                    },
                                    ["图鉴图标"] = "浮游石",
                                    ["图鉴击杀数"] = 5708,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "浮游石",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 10
                            }
                        },
                        ["持续时间"] = 79.86,
                        ["数量"] = 170,
                        ["最大数量"] = 170,
                        ["开始时间"] = 0
                    },
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "岩石傀儡",
                                    ["描述"] = "镇守古阵，身躯如山，拳崩岩裂",
                                    ["是首领"] = true,
                                    ["怪物ID"] = "岩石傀儡",
                                    ["基础等级"] = 5,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.025*20)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1*1.025*20)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "岩石傀儡",
                                    ["图鉴击杀数"] = 42,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "岩石傀儡",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 1
                            }
                        },
                        ["持续时间"] = 1,
                        ["数量"] = 1,
                        ["最大数量"] = 1,
                        ["开始时间"] = 39.93
                    }
                },
                ["加空间概率"] = 7,
                ["加空间格数"] = 1.6,
                ["属性倍率"] = 1.42,
                ["给予灵蕴"] = 23,
                ["总计经验"] = 335
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "火焰灵狐",
                                    ["描述"] = "熔火狐妖，尾燎焦土，爪裂金石",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "火焰灵狐",
                                    ["基础等级"] = 21,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1.1*1.105*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1.1*1.105*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "火焰灵狐",
                                    ["图鉴击杀数"] = 12235,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "火焰灵狐",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 50
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "猛冲蜥",
                                    ["描述"] = "沙丘暴徒，略为强硬，不难解决",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "猛冲蜥",
                                    ["基础等级"] = 6,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.03*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1*1.03*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "猛冲蜥",
                                    ["图鉴击杀数"] = 4750,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "猛冲蜥",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 10
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "毒窟蝠",
                                    ["描述"] = "瘴穴妖蝠，翼带剧毒，快若鬼影",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "毒窟蝠",
                                    ["基础等级"] = 28,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.14*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*0.7*1.14*1)^1.1",
                                        ["速度"] = "100 "
                                    },
                                    ["图鉴图标"] = "毒窟蝠",
                                    ["图鉴击杀数"] = 15904,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "毒窟蝠",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 5
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "幼火龙",
                                    ["描述"] = "龙裔遗孤，披甲炽焰，凶性初显",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "幼火龙",
                                    ["基础等级"] = 29,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1.2*1.145*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1.2*1.145*1)^1.1",
                                        ["速度"] = "70 "
                                    },
                                    ["图鉴图标"] = "幼火龙",
                                    ["图鉴击杀数"] = 16435,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "幼火龙",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 30
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "浮游石",
                                    ["描述"] = "玄磁奇物，悬空缓行，坚不可摧",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "浮游石",
                                    ["基础等级"] = 8,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.04*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1.5*1.04*1)^1.1",
                                        ["速度"] = "30 "
                                    },
                                    ["图鉴图标"] = "浮游石",
                                    ["图鉴击杀数"] = 5708,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "浮游石",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 10
                            }
                        },
                        ["持续时间"] = 86.79,
                        ["数量"] = 196,
                        ["最大数量"] = 196,
                        ["开始时间"] = 0
                    }
                },
                ["加空间概率"] = 7,
                ["加空间格数"] = 1.8,
                ["属性倍率"] = 1.63,
                ["给予灵蕴"] = 28,
                ["总计经验"] = 433
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "火焰灵狐",
                                    ["描述"] = "熔火狐妖，尾燎焦土，爪裂金石",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "火焰灵狐",
                                    ["基础等级"] = 21,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1.1*1.105*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1.1*1.105*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "火焰灵狐",
                                    ["图鉴击杀数"] = 12235,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "火焰灵狐",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 50
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "猛冲蜥",
                                    ["描述"] = "沙丘暴徒，略为强硬，不难解决",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "猛冲蜥",
                                    ["基础等级"] = 6,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.03*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1*1.03*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "猛冲蜥",
                                    ["图鉴击杀数"] = 4750,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "猛冲蜥",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 10
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "毒窟蝠",
                                    ["描述"] = "瘴穴妖蝠，翼带剧毒，快若鬼影",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "毒窟蝠",
                                    ["基础等级"] = 28,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.14*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*0.7*1.14*1)^1.1",
                                        ["速度"] = "100 "
                                    },
                                    ["图鉴图标"] = "毒窟蝠",
                                    ["图鉴击杀数"] = 15904,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "毒窟蝠",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 5
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "幼火龙",
                                    ["描述"] = "龙裔遗孤，披甲炽焰，凶性初显",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "幼火龙",
                                    ["基础等级"] = 29,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1.2*1.145*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1.2*1.145*1)^1.1",
                                        ["速度"] = "70 "
                                    },
                                    ["图鉴图标"] = "幼火龙",
                                    ["图鉴击杀数"] = 16435,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "幼火龙",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 30
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "浮游石",
                                    ["描述"] = "玄磁奇物，悬空缓行，坚不可摧",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "浮游石",
                                    ["基础等级"] = 8,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.04*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1.5*1.04*1)^1.1",
                                        ["速度"] = "30 "
                                    },
                                    ["图鉴图标"] = "浮游石",
                                    ["图鉴击杀数"] = 5708,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "浮游石",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 10
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "赤炎蟹",
                                    ["描述"] = "火沼铁甲，双螯断钢，横行无忌",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "赤炎蟹",
                                    ["基础等级"] = 31,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.155*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1.1*1.155*1)^1.1",
                                        ["速度"] = "40 "
                                    },
                                    ["图鉴图标"] = "赤炎蟹",
                                    ["图鉴击杀数"] = 17501,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "赤炎蟹",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 30
                            }
                        },
                        ["持续时间"] = 93.72,
                        ["数量"] = 221,
                        ["最大数量"] = 221,
                        ["开始时间"] = 0
                    },
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "晶石傀儡",
                                    ["描述"] = "玄冰秘精，通体金刚，碎敌须臾",
                                    ["是首领"] = true,
                                    ["怪物ID"] = "晶石傀儡",
                                    ["基础等级"] = 20,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.1*20)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1*1.1*20)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "晶石傀儡",
                                    ["图鉴击杀数"] = 115,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "晶石傀儡",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 1
                            }
                        },
                        ["持续时间"] = 1,
                        ["数量"] = 1,
                        ["最大数量"] = 1,
                        ["开始时间"] = 46.86
                    },
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "岩石傀儡",
                                    ["描述"] = "镇守古阵，身躯如山，拳崩岩裂",
                                    ["是首领"] = true,
                                    ["怪物ID"] = "岩石傀儡",
                                    ["基础等级"] = 5,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.025*20)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1*1.025*20)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "岩石傀儡",
                                    ["图鉴击杀数"] = 42,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "岩石傀儡",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 1
                            }
                        },
                        ["持续时间"] = 1,
                        ["数量"] = 1,
                        ["最大数量"] = 1,
                        ["开始时间"] = 46.86
                    }
                },
                ["加空间概率"] = 7,
                ["加空间格数"] = 2,
                ["属性倍率"] = 2.04,
                ["给予灵蕴"] = 33,
                ["总计经验"] = 531
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "火焰灵狐",
                                    ["描述"] = "熔火狐妖，尾燎焦土，爪裂金石",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "火焰灵狐",
                                    ["基础等级"] = 21,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1.1*1.105*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1.1*1.105*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "火焰灵狐",
                                    ["图鉴击杀数"] = 12235,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "火焰灵狐",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 50
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "猛冲蜥",
                                    ["描述"] = "沙丘暴徒，略为强硬，不难解决",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "猛冲蜥",
                                    ["基础等级"] = 6,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.03*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1*1.03*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "猛冲蜥",
                                    ["图鉴击杀数"] = 4750,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "猛冲蜥",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 10
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "毒窟蝠",
                                    ["描述"] = "瘴穴妖蝠，翼带剧毒，快若鬼影",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "毒窟蝠",
                                    ["基础等级"] = 28,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.14*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*0.7*1.14*1)^1.1",
                                        ["速度"] = "100 "
                                    },
                                    ["图鉴图标"] = "毒窟蝠",
                                    ["图鉴击杀数"] = 15904,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "毒窟蝠",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 5
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "幼火龙",
                                    ["描述"] = "龙裔遗孤，披甲炽焰，凶性初显",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "幼火龙",
                                    ["基础等级"] = 29,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1.2*1.145*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1.2*1.145*1)^1.1",
                                        ["速度"] = "70 "
                                    },
                                    ["图鉴图标"] = "幼火龙",
                                    ["图鉴击杀数"] = 16435,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "幼火龙",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 30
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "浮游石",
                                    ["描述"] = "玄磁奇物，悬空缓行，坚不可摧",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "浮游石",
                                    ["基础等级"] = 8,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.04*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1.5*1.04*1)^1.1",
                                        ["速度"] = "30 "
                                    },
                                    ["图鉴图标"] = "浮游石",
                                    ["图鉴击杀数"] = 5708,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "浮游石",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 10
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "赤炎蟹",
                                    ["描述"] = "火沼铁甲，双螯断钢，横行无忌",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "赤炎蟹",
                                    ["基础等级"] = 31,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.155*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1.1*1.155*1)^1.1",
                                        ["速度"] = "40 "
                                    },
                                    ["图鉴图标"] = "赤炎蟹",
                                    ["图鉴击杀数"] = 17501,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "赤炎蟹",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 30
                            }
                        },
                        ["持续时间"] = 100.65,
                        ["数量"] = 246,
                        ["最大数量"] = 246,
                        ["开始时间"] = 0
                    }
                },
                ["加空间概率"] = 7,
                ["加空间格数"] = 2.2,
                ["属性倍率"] = 2.25,
                ["给予灵蕴"] = 38,
                ["总计经验"] = 629
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "火焰灵狐",
                                    ["描述"] = "熔火狐妖，尾燎焦土，爪裂金石",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "火焰灵狐",
                                    ["基础等级"] = 21,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1.1*1.105*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1.1*1.105*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "火焰灵狐",
                                    ["图鉴击杀数"] = 12235,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "火焰灵狐",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 50
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "猛冲蜥",
                                    ["描述"] = "沙丘暴徒，略为强硬，不难解决",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "猛冲蜥",
                                    ["基础等级"] = 6,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.03*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1*1.03*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "猛冲蜥",
                                    ["图鉴击杀数"] = 4750,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "猛冲蜥",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 10
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "毒窟蝠",
                                    ["描述"] = "瘴穴妖蝠，翼带剧毒，快若鬼影",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "毒窟蝠",
                                    ["基础等级"] = 28,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.14*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*0.7*1.14*1)^1.1",
                                        ["速度"] = "100 "
                                    },
                                    ["图鉴图标"] = "毒窟蝠",
                                    ["图鉴击杀数"] = 15904,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "毒窟蝠",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 5
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "幼火龙",
                                    ["描述"] = "龙裔遗孤，披甲炽焰，凶性初显",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "幼火龙",
                                    ["基础等级"] = 29,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1.2*1.145*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1.2*1.145*1)^1.1",
                                        ["速度"] = "70 "
                                    },
                                    ["图鉴图标"] = "幼火龙",
                                    ["图鉴击杀数"] = 16435,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "幼火龙",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 30
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "浮游石",
                                    ["描述"] = "玄磁奇物，悬空缓行，坚不可摧",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "浮游石",
                                    ["基础等级"] = 8,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.04*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1.5*1.04*1)^1.1",
                                        ["速度"] = "30 "
                                    },
                                    ["图鉴图标"] = "浮游石",
                                    ["图鉴击杀数"] = 5708,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "浮游石",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 10
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "赤炎蟹",
                                    ["描述"] = "火沼铁甲，双螯断钢，横行无忌",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "赤炎蟹",
                                    ["基础等级"] = 31,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.155*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1.1*1.155*1)^1.1",
                                        ["速度"] = "40 "
                                    },
                                    ["图鉴图标"] = "赤炎蟹",
                                    ["图鉴击杀数"] = 17501,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "赤炎蟹",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 30
                            }
                        },
                        ["持续时间"] = 107.58,
                        ["数量"] = 271,
                        ["最大数量"] = 271,
                        ["开始时间"] = 0
                    },
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "爬行怪",
                                    ["描述"] = "地底魔尊，肢如刀戟，遁土噬心",
                                    ["是首领"] = true,
                                    ["怪物ID"] = "爬行怪",
                                    ["基础等级"] = 30,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1.2*1.15*20)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1*1.15*20)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "爬行怪",
                                    ["图鉴击杀数"] = 167,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "爬行怪",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 1
                            }
                        },
                        ["持续时间"] = 1,
                        ["数量"] = 1,
                        ["最大数量"] = 1,
                        ["开始时间"] = 53.79
                    }
                },
                ["加空间概率"] = 7,
                ["加空间格数"] = 2.4,
                ["属性倍率"] = 2.46,
                ["给予灵蕴"] = 43,
                ["总计经验"] = 727
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "火焰灵狐",
                                    ["描述"] = "熔火狐妖，尾燎焦土，爪裂金石",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "火焰灵狐",
                                    ["基础等级"] = 21,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1.1*1.105*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1.1*1.105*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "火焰灵狐",
                                    ["图鉴击杀数"] = 12235,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "火焰灵狐",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 50
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "猛冲蜥",
                                    ["描述"] = "沙丘暴徒，略为强硬，不难解决",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "猛冲蜥",
                                    ["基础等级"] = 6,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.03*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1*1.03*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "猛冲蜥",
                                    ["图鉴击杀数"] = 4750,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "猛冲蜥",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 10
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "毒窟蝠",
                                    ["描述"] = "瘴穴妖蝠，翼带剧毒，快若鬼影",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "毒窟蝠",
                                    ["基础等级"] = 28,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.14*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*0.7*1.14*1)^1.1",
                                        ["速度"] = "100 "
                                    },
                                    ["图鉴图标"] = "毒窟蝠",
                                    ["图鉴击杀数"] = 15904,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "毒窟蝠",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 5
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "幼火龙",
                                    ["描述"] = "龙裔遗孤，披甲炽焰，凶性初显",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "幼火龙",
                                    ["基础等级"] = 29,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1.2*1.145*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1.2*1.145*1)^1.1",
                                        ["速度"] = "70 "
                                    },
                                    ["图鉴图标"] = "幼火龙",
                                    ["图鉴击杀数"] = 16435,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "幼火龙",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 30
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "浮游石",
                                    ["描述"] = "玄磁奇物，悬空缓行，坚不可摧",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "浮游石",
                                    ["基础等级"] = 8,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.04*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1.5*1.04*1)^1.1",
                                        ["速度"] = "30 "
                                    },
                                    ["图鉴图标"] = "浮游石",
                                    ["图鉴击杀数"] = 5708,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "浮游石",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 10
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "赤炎蟹",
                                    ["描述"] = "火沼铁甲，双螯断钢，横行无忌",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "赤炎蟹",
                                    ["基础等级"] = 31,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.155*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1.1*1.155*1)^1.1",
                                        ["速度"] = "40 "
                                    },
                                    ["图鉴图标"] = "赤炎蟹",
                                    ["图鉴击杀数"] = 17501,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "赤炎蟹",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 30
                            }
                        },
                        ["持续时间"] = 114.51,
                        ["数量"] = 296,
                        ["最大数量"] = 296,
                        ["开始时间"] = 0
                    }
                },
                ["加空间概率"] = 7,
                ["加空间格数"] = 2.6,
                ["属性倍率"] = 2.67,
                ["给予灵蕴"] = 48,
                ["总计经验"] = 825
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "火焰灵狐",
                                    ["描述"] = "熔火狐妖，尾燎焦土，爪裂金石",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "火焰灵狐",
                                    ["基础等级"] = 21,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1.1*1.105*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1.1*1.105*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "火焰灵狐",
                                    ["图鉴击杀数"] = 12235,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "火焰灵狐",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 50
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "猛冲蜥",
                                    ["描述"] = "沙丘暴徒，略为强硬，不难解决",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "猛冲蜥",
                                    ["基础等级"] = 6,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.03*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1*1.03*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "猛冲蜥",
                                    ["图鉴击杀数"] = 4750,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "猛冲蜥",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 10
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "毒窟蝠",
                                    ["描述"] = "瘴穴妖蝠，翼带剧毒，快若鬼影",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "毒窟蝠",
                                    ["基础等级"] = 28,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.14*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*0.7*1.14*1)^1.1",
                                        ["速度"] = "100 "
                                    },
                                    ["图鉴图标"] = "毒窟蝠",
                                    ["图鉴击杀数"] = 15904,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "毒窟蝠",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 5
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "幼火龙",
                                    ["描述"] = "龙裔遗孤，披甲炽焰，凶性初显",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "幼火龙",
                                    ["基础等级"] = 29,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1.2*1.145*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1.2*1.145*1)^1.1",
                                        ["速度"] = "70 "
                                    },
                                    ["图鉴图标"] = "幼火龙",
                                    ["图鉴击杀数"] = 16435,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "幼火龙",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 30
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "浮游石",
                                    ["描述"] = "玄磁奇物，悬空缓行，坚不可摧",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "浮游石",
                                    ["基础等级"] = 8,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.04*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1.5*1.04*1)^1.1",
                                        ["速度"] = "30 "
                                    },
                                    ["图鉴图标"] = "浮游石",
                                    ["图鉴击杀数"] = 5708,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "浮游石",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 10
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "赤炎蟹",
                                    ["描述"] = "火沼铁甲，双螯断钢，横行无忌",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "赤炎蟹",
                                    ["基础等级"] = 31,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.155*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1.1*1.155*1)^1.1",
                                        ["速度"] = "40 "
                                    },
                                    ["图鉴图标"] = "赤炎蟹",
                                    ["图鉴击杀数"] = 17501,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "赤炎蟹",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 30
                            }
                        },
                        ["持续时间"] = 121.44,
                        ["数量"] = 322,
                        ["最大数量"] = 322,
                        ["开始时间"] = 0
                    },
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "岩浆徘行者",
                                    ["描述"] = "地心魔物，步履熔岩，所过皆烬",
                                    ["是首领"] = true,
                                    ["怪物ID"] = "岩浆徘行者",
                                    ["基础等级"] = 26,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.13*20)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1*1.13*20)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "岩浆徘行者",
                                    ["图鉴击杀数"] = 146,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "岩浆徘行者",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 1
                            }
                        },
                        ["持续时间"] = 1,
                        ["数量"] = 1,
                        ["最大数量"] = 1,
                        ["开始时间"] = 60.72
                    }
                },
                ["加空间概率"] = 7,
                ["加空间格数"] = 2.8,
                ["属性倍率"] = 2.87999988,
                ["给予灵蕴"] = 53,
                ["总计经验"] = 923
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "火焰灵狐",
                                    ["描述"] = "熔火狐妖，尾燎焦土，爪裂金石",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "火焰灵狐",
                                    ["基础等级"] = 21,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1.1*1.105*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1.1*1.105*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "火焰灵狐",
                                    ["图鉴击杀数"] = 12235,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "火焰灵狐",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 50
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "猛冲蜥",
                                    ["描述"] = "沙丘暴徒，略为强硬，不难解决",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "猛冲蜥",
                                    ["基础等级"] = 6,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.03*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1*1.03*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "猛冲蜥",
                                    ["图鉴击杀数"] = 4750,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "猛冲蜥",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 10
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "毒窟蝠",
                                    ["描述"] = "瘴穴妖蝠，翼带剧毒，快若鬼影",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "毒窟蝠",
                                    ["基础等级"] = 28,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.14*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*0.7*1.14*1)^1.1",
                                        ["速度"] = "100 "
                                    },
                                    ["图鉴图标"] = "毒窟蝠",
                                    ["图鉴击杀数"] = 15904,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "毒窟蝠",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 5
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "幼火龙",
                                    ["描述"] = "龙裔遗孤，披甲炽焰，凶性初显",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "幼火龙",
                                    ["基础等级"] = 29,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1.2*1.145*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1.2*1.145*1)^1.1",
                                        ["速度"] = "70 "
                                    },
                                    ["图鉴图标"] = "幼火龙",
                                    ["图鉴击杀数"] = 16435,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "幼火龙",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 30
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "浮游石",
                                    ["描述"] = "玄磁奇物，悬空缓行，坚不可摧",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "浮游石",
                                    ["基础等级"] = 8,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.04*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1.5*1.04*1)^1.1",
                                        ["速度"] = "30 "
                                    },
                                    ["图鉴图标"] = "浮游石",
                                    ["图鉴击杀数"] = 5708,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "浮游石",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 10
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "赤炎蟹",
                                    ["描述"] = "火沼铁甲，双螯断钢，横行无忌",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "赤炎蟹",
                                    ["基础等级"] = 31,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.155*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1.1*1.155*1)^1.1",
                                        ["速度"] = "40 "
                                    },
                                    ["图鉴图标"] = "赤炎蟹",
                                    ["图鉴击杀数"] = 17501,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "赤炎蟹",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 30
                            }
                        },
                        ["持续时间"] = 128.37,
                        ["数量"] = 347,
                        ["最大数量"] = 347,
                        ["开始时间"] = 0
                    },
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "爬行怪",
                                    ["描述"] = "地底魔尊，肢如刀戟，遁土噬心",
                                    ["是首领"] = true,
                                    ["怪物ID"] = "爬行怪",
                                    ["基础等级"] = 30,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1.2*1.15*20)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1*1.15*20)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "爬行怪",
                                    ["图鉴击杀数"] = 167,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "爬行怪",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 1
                            }
                        },
                        ["持续时间"] = 1,
                        ["数量"] = 1,
                        ["最大数量"] = 1,
                        ["开始时间"] = 64.185
                    },
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "爬行怪",
                                    ["描述"] = "地底魔尊，肢如刀戟，遁土噬心",
                                    ["是首领"] = true,
                                    ["怪物ID"] = "爬行怪",
                                    ["基础等级"] = 30,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1.2*1.15*20)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1*1.15*20)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "爬行怪",
                                    ["图鉴击杀数"] = 167,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "爬行怪",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 1
                            }
                        },
                        ["持续时间"] = 1,
                        ["数量"] = 1,
                        ["最大数量"] = 1,
                        ["开始时间"] = 64.185
                    }
                },
                ["加空间概率"] = 7,
                ["加空间格数"] = 3,
                ["属性倍率"] = 3.38999987,
                ["给予灵蕴"] = 58,
                ["总计经验"] = 1021
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "火焰灵狐",
                                    ["描述"] = "熔火狐妖，尾燎焦土，爪裂金石",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "火焰灵狐",
                                    ["基础等级"] = 21,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1.1*1.105*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1.1*1.105*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "火焰灵狐",
                                    ["图鉴击杀数"] = 12235,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "火焰灵狐",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 50
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "猛冲蜥",
                                    ["描述"] = "沙丘暴徒，略为强硬，不难解决",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "猛冲蜥",
                                    ["基础等级"] = 6,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.03*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1*1.03*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "猛冲蜥",
                                    ["图鉴击杀数"] = 4750,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "猛冲蜥",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 10
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "毒窟蝠",
                                    ["描述"] = "瘴穴妖蝠，翼带剧毒，快若鬼影",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "毒窟蝠",
                                    ["基础等级"] = 28,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.14*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*0.7*1.14*1)^1.1",
                                        ["速度"] = "100 "
                                    },
                                    ["图鉴图标"] = "毒窟蝠",
                                    ["图鉴击杀数"] = 15904,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "毒窟蝠",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 5
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "幼火龙",
                                    ["描述"] = "龙裔遗孤，披甲炽焰，凶性初显",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "幼火龙",
                                    ["基础等级"] = 29,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1.2*1.145*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1.2*1.145*1)^1.1",
                                        ["速度"] = "70 "
                                    },
                                    ["图鉴图标"] = "幼火龙",
                                    ["图鉴击杀数"] = 16435,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "幼火龙",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 30
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "浮游石",
                                    ["描述"] = "玄磁奇物，悬空缓行，坚不可摧",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "浮游石",
                                    ["基础等级"] = 8,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.04*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1.5*1.04*1)^1.1",
                                        ["速度"] = "30 "
                                    },
                                    ["图鉴图标"] = "浮游石",
                                    ["图鉴击杀数"] = 5708,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "浮游石",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 10
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "赤炎蟹",
                                    ["描述"] = "火沼铁甲，双螯断钢，横行无忌",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "赤炎蟹",
                                    ["基础等级"] = 31,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.155*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1.1*1.155*1)^1.1",
                                        ["速度"] = "40 "
                                    },
                                    ["图鉴图标"] = "赤炎蟹",
                                    ["图鉴击杀数"] = 17501,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "赤炎蟹",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 30
                            }
                        },
                        ["持续时间"] = 135.3,
                        ["数量"] = 372,
                        ["最大数量"] = 372,
                        ["开始时间"] = 0
                    }
                },
                ["加空间概率"] = 7,
                ["加空间格数"] = 3.2,
                ["属性倍率"] = 3.6,
                ["给予灵蕴"] = 63,
                ["总计经验"] = 1119
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "火焰灵狐",
                                    ["描述"] = "熔火狐妖，尾燎焦土，爪裂金石",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "火焰灵狐",
                                    ["基础等级"] = 21,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1.1*1.105*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1.1*1.105*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "火焰灵狐",
                                    ["图鉴击杀数"] = 12235,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "火焰灵狐",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 50
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "猛冲蜥",
                                    ["描述"] = "沙丘暴徒，略为强硬，不难解决",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "猛冲蜥",
                                    ["基础等级"] = 6,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.03*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1*1.03*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "猛冲蜥",
                                    ["图鉴击杀数"] = 4750,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "猛冲蜥",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 10
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "毒窟蝠",
                                    ["描述"] = "瘴穴妖蝠，翼带剧毒，快若鬼影",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "毒窟蝠",
                                    ["基础等级"] = 28,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.14*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*0.7*1.14*1)^1.1",
                                        ["速度"] = "100 "
                                    },
                                    ["图鉴图标"] = "毒窟蝠",
                                    ["图鉴击杀数"] = 15904,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "毒窟蝠",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 5
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "幼火龙",
                                    ["描述"] = "龙裔遗孤，披甲炽焰，凶性初显",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "幼火龙",
                                    ["基础等级"] = 29,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1.2*1.145*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1.2*1.145*1)^1.1",
                                        ["速度"] = "70 "
                                    },
                                    ["图鉴图标"] = "幼火龙",
                                    ["图鉴击杀数"] = 16435,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "幼火龙",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 30
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "浮游石",
                                    ["描述"] = "玄磁奇物，悬空缓行，坚不可摧",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "浮游石",
                                    ["基础等级"] = 8,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.04*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1.5*1.04*1)^1.1",
                                        ["速度"] = "30 "
                                    },
                                    ["图鉴图标"] = "浮游石",
                                    ["图鉴击杀数"] = 5708,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "浮游石",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 10
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "赤炎蟹",
                                    ["描述"] = "火沼铁甲，双螯断钢，横行无忌",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "赤炎蟹",
                                    ["基础等级"] = 31,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.155*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1.1*1.155*1)^1.1",
                                        ["速度"] = "40 "
                                    },
                                    ["图鉴图标"] = "赤炎蟹",
                                    ["图鉴击杀数"] = 17501,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "赤炎蟹",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 30
                            }
                        },
                        ["持续时间"] = 142.23,
                        ["数量"] = 397,
                        ["最大数量"] = 397,
                        ["开始时间"] = 0
                    }
                },
                ["加空间概率"] = 7,
                ["加空间格数"] = 3.4,
                ["属性倍率"] = 3.81,
                ["给予灵蕴"] = 68,
                ["总计经验"] = 1217
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "火焰灵狐",
                                    ["描述"] = "熔火狐妖，尾燎焦土，爪裂金石",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "火焰灵狐",
                                    ["基础等级"] = 21,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1.1*1.105*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1.1*1.105*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "火焰灵狐",
                                    ["图鉴击杀数"] = 12235,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "火焰灵狐",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 50
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "猛冲蜥",
                                    ["描述"] = "沙丘暴徒，略为强硬，不难解决",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "猛冲蜥",
                                    ["基础等级"] = 6,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.03*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1*1.03*1)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "猛冲蜥",
                                    ["图鉴击杀数"] = 4750,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "猛冲蜥",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 10
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "毒窟蝠",
                                    ["描述"] = "瘴穴妖蝠，翼带剧毒，快若鬼影",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "毒窟蝠",
                                    ["基础等级"] = 28,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.14*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*0.7*1.14*1)^1.1",
                                        ["速度"] = "100 "
                                    },
                                    ["图鉴图标"] = "毒窟蝠",
                                    ["图鉴击杀数"] = 15904,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "毒窟蝠",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 5
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "幼火龙",
                                    ["描述"] = "龙裔遗孤，披甲炽焰，凶性初显",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "幼火龙",
                                    ["基础等级"] = 29,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1.2*1.145*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1.2*1.145*1)^1.1",
                                        ["速度"] = "70 "
                                    },
                                    ["图鉴图标"] = "幼火龙",
                                    ["图鉴击杀数"] = 16435,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "幼火龙",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 30
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "浮游石",
                                    ["描述"] = "玄磁奇物，悬空缓行，坚不可摧",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "浮游石",
                                    ["基础等级"] = 8,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.04*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1.5*1.04*1)^1.1",
                                        ["速度"] = "30 "
                                    },
                                    ["图鉴图标"] = "浮游石",
                                    ["图鉴击杀数"] = 5708,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "浮游石",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 10
                            },
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "赤炎蟹",
                                    ["描述"] = "火沼铁甲，双螯断钢，横行无忌",
                                    ["是首领"] = false,
                                    ["怪物ID"] = "赤炎蟹",
                                    ["基础等级"] = 31,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.155*1)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1.1*1.155*1)^1.1",
                                        ["速度"] = "40 "
                                    },
                                    ["图鉴图标"] = "赤炎蟹",
                                    ["图鉴击杀数"] = 17501,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "赤炎蟹",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 30
                            }
                        },
                        ["持续时间"] = 149.16,
                        ["数量"] = 422,
                        ["最大数量"] = 422,
                        ["开始时间"] = 0
                    },
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "熔岩傀儡",
                                    ["描述"] = "地火巨像，熔岩为躯，踏足焚天",
                                    ["是首领"] = true,
                                    ["怪物ID"] = "熔岩傀儡",
                                    ["基础等级"] = 33,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.165*20)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1*1.165*20)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "熔岩傀儡",
                                    ["图鉴击杀数"] = 183,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "熔岩傀儡",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 1
                            }
                        },
                        ["持续时间"] = 1,
                        ["数量"] = 1,
                        ["最大数量"] = 1,
                        ["开始时间"] = 104.412
                    },
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "晶石傀儡",
                                    ["描述"] = "玄冰秘精，通体金刚，碎敌须臾",
                                    ["是首领"] = true,
                                    ["怪物ID"] = "晶石傀儡",
                                    ["基础等级"] = 20,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.1*20)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1*1.1*20)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "晶石傀儡",
                                    ["图鉴击杀数"] = 115,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "晶石傀儡",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 1
                            }
                        },
                        ["持续时间"] = 1,
                        ["数量"] = 1,
                        ["最大数量"] = 1,
                        ["开始时间"] = 74.58
                    },
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "晶石傀儡",
                                    ["描述"] = "玄冰秘精，通体金刚，碎敌须臾",
                                    ["是首领"] = true,
                                    ["怪物ID"] = "晶石傀儡",
                                    ["基础等级"] = 20,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.1*20)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1*1.1*20)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "晶石傀儡",
                                    ["图鉴击杀数"] = 115,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "晶石傀儡",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 1
                            }
                        },
                        ["持续时间"] = 1,
                        ["数量"] = 1,
                        ["最大数量"] = 1,
                        ["开始时间"] = 74.58
                    },
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "岩石傀儡",
                                    ["描述"] = "镇守古阵，身躯如山，拳崩岩裂",
                                    ["是首领"] = true,
                                    ["怪物ID"] = "岩石傀儡",
                                    ["基础等级"] = 5,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.025*20)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1*1.025*20)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "岩石傀儡",
                                    ["图鉴击杀数"] = 42,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "岩石傀儡",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 1
                            }
                        },
                        ["持续时间"] = 1,
                        ["数量"] = 1,
                        ["最大数量"] = 1,
                        ["开始时间"] = 59.664
                    },
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = {
                                    ["显示名"] = "岩石傀儡",
                                    ["描述"] = "镇守古阵，身躯如山，拳崩岩裂",
                                    ["是首领"] = true,
                                    ["怪物ID"] = "岩石傀儡",
                                    ["基础等级"] = 5,
                                    ["属性公式"] = {
                                        ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.025*20)^1.1",
                                        ["生命"] = "(2^(LVL/10))*(10*LVL*1*1.025*20)^1.1",
                                        ["速度"] = "50 "
                                    },
                                    ["图鉴图标"] = "岩石傀儡",
                                    ["图鉴击杀数"] = 42,
                                    ["图鉴完成奖励"] = nil,
                                    ["图鉴完成奖励数量"] = 50,
                                    ["name"] = "岩石傀儡",
                                    ["hideFlags"] = 0
                                },
                                ["比重"] = 1
                            }
                        },
                        ["持续时间"] = 1,
                        ["数量"] = 1,
                        ["最大数量"] = 1,
                        ["开始时间"] = 59.664
                    }
                },
                ["加空间概率"] = 7,
                ["加空间格数"] = 3.6,
                ["属性倍率"] = 4.02,
                ["给予灵蕴"] = 73,
                ["总计经验"] = 1315
            }
        },
        ["完成奖励_1星"] = {
            [""] = 1500
        },
        ["完成奖励_3星"] = {
            [""] = 100
        },
        ["初始必加空间"] = true,
        ["等级"] = 41,
        ["初始背包宽"] = 3,
        ["初始背包高"] = 3,
        ["描述_2星"] = "生命大于30％",
        ["描述_3星"] = "生命大于70％",
        ["怪物等级"] = 1
    })
}}

---@param level string
---@return Level
function LevelConfig.Get(level)
    return LevelConfig.config[level]
end

---@return ItemType[]
function LevelConfig.GetAll()
    return LevelConfig.config
end
return LevelConfig
