local MainStorage = game:GetService('MainStorage')
local gg                = require(MainStorage.code.common.MGlobal)    ---@type gg
local Modifiers = require(MainStorage.code.common.config_type.modifier.Modifiers) ---@type Modifiers
    
---@class LevelConfig
local LevelConfig = {}
local loaded = false

local function LoadConfig()
    local LevelType = require(MainStorage.code.common.config_type.LevelType) ---@type LevelType
    LevelConfig.config ={
    ["新手关"] = LevelType.New({
        ["关卡ID"] = "新手关",
        ["描述"] = nil,
        ["前置关卡"] = nil,
        ["关卡波次"] = {
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = "呆滞僵尸",
                                ["比重"] = 50
                            }
                        },
                        ["持续时间"] = 1,
                        ["数量"] = 1,
                        ["最大数量"] = 1,
                        ["开始时间"] = 0
                    }
                },
                ["属性倍率"] = 1,
                ["开始时执行指令"] = {
                    [[focusOn {"聚焦UI":{"聚焦UI":[{"UI名":"BattleHud","控件路径":"UIImage","提示文本":"不好！僵尸入侵了你的房子","可点击任意位置":true},{"UI名":"BattleHud","控件路径":"开火","提示文本":"点击这里，向僵尸开炮！","可点击任意位置":true,"若是PC端则改为":{"UI名":"BattleHud","控件路径":"UIImage","提示文本":"点击鼠标左键，向僵尸开炮！","可点击任意位置":true}}],"完成时执行指令":[]}} ]]
                },
                ["怪物等级"] = {
                    0,
                    0
                }
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = "呆滞僵尸",
                                ["比重"] = 50
                            }
                        },
                        ["持续时间"] = 1,
                        ["数量"] = 3,
                        ["最大数量"] = 3,
                        ["开始时间"] = 0
                    }
                },
                ["属性倍率"] = 1,
                ["开始时执行指令"] = {
                    [[focusOn {"聚焦UI":{"聚焦UI":[{"UI名":"BattleHud","控件路径":"开火","提示文本":"按住拖动，可以扫射开火！","可点击任意位置":false,"若是PC端则改为":{"UI名":"BattleHud","控件路径":"UIImage","提示文本":"移动鼠标，可以瞄准僵尸","可点击任意位置":true}}],"完成时执行指令":[]}} ]]
                },
                ["怪物等级"] = {
                    0,
                    0
                }
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = "呆滞僵尸",
                                ["比重"] = 50
                            }
                        },
                        ["持续时间"] = 1,
                        ["数量"] = 6,
                        ["最大数量"] = 6,
                        ["开始时间"] = 0
                    }
                },
                ["属性倍率"] = 1,
                ["开始时执行指令"] = {
                    [[focusOn {"聚焦UI":{"聚焦UI":[{"UI名":"HudCards","控件路径":"副卡列表/卡片_1","提示文本":"丢出樱桃炸弹\\n炸飞一大波僵尸！","可点击任意位置":true,"若是PC端则改为":{"UI名":"HudCards","控件路径":"副卡列表/卡片_1","提示文本":"按下数字[1】键\\n丢出樱桃炸弹\\n炸飞一大波僵尸！","可点击任意位置":true}}],"完成时执行指令":[]}} ]]
                },
                ["怪物等级"] = {
                    0,
                    0
                }
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = "僵尸",
                                ["比重"] = 50
                            }
                        },
                        ["持续时间"] = 30,
                        ["数量"] = 20,
                        ["最大数量"] = 20,
                        ["开始时间"] = 0
                    }
                },
                ["属性倍率"] = 1,
                ["开始时执行指令"] = {
                    [[focusOn {"聚焦UI":{"聚焦UI":[{"UI名":"BattleHud","控件路径":"UIImage","提示文本":"很好！现在击败剩下的僵尸吧","可点击任意位置":true}],"完成时执行指令":[]}} ]]
                },
                ["怪物等级"] = {
                    0,
                    0
                }
            }
        },
        ["场景"] = "新手关",
        ["开始玩家"] = 1,
        ["增加额外玩家时间"] = 1,
        ["最大玩家数"] = 1,
        ["每个玩家增加数量倍率"] = 0,
        ["排名掉落物"] = nil,
        ["首通奖励"] = nil,
        ["胜利音效"] = nil,
        ["失败音效"] = nil
    }),
    ["1-1（1~100级）"] = LevelType.New({
        ["关卡ID"] = "1-1（1~100级）",
        ["描述"] = "需求等级: [level]/1级",
        ["前置关卡"] = nil,
        ["关卡波次"] = {
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = "僵尸",
                                ["比重"] = 50
                            }
                        },
                        ["持续时间"] = 30,
                        ["数量"] = 10,
                        ["最大数量"] = 30,
                        ["开始时间"] = 0
                    }
                },
                ["属性倍率"] = 1,
                ["怪物等级"] = {
                    1,
                    3
                },
                ["掉落物"] = {
                    {
                        ["物品"] = "阳光",
                        ["数量"] = "20",
                        ["几率"] = 30
                    }
                },
                ["转波次文字"] = "AssetId://391536769349332993",
                ["转波次音效"] = "sandboxId://soundeffect/awooga_僵尸来袭.ogg"
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = "僵尸",
                                ["比重"] = 50
                            }
                        },
                        ["持续时间"] = 30,
                        ["数量"] = 10,
                        ["最大数量"] = 30,
                        ["开始时间"] = 0
                    }
                },
                ["属性倍率"] = 1,
                ["怪物等级"] = {
                    6,
                    12
                },
                ["掉落物"] = {
                    {
                        ["物品"] = "阳光",
                        ["数量"] = "20",
                        ["几率"] = 50
                    },
                    {
                        ["物品"] = "金币",
                        ["数量"] = "1",
                        ["几率"] = 30
                    }
                },
                ["转波次文字"] = "AssetId://391536769349332993",
                ["转波次音效"] = "sandboxId://soundeffect/finalwave_终波.ogg"
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = "僵尸",
                                ["比重"] = 80
                            },
                            {
                                ["怪物类型"] = "士兵僵尸",
                                ["比重"] = 20
                            }
                        },
                        ["持续时间"] = 30,
                        ["数量"] = 10,
                        ["最大数量"] = 30,
                        ["开始时间"] = 0
                    }
                },
                ["属性倍率"] = 1,
                ["怪物等级"] = {
                    13,
                    22
                },
                ["掉落物"] = {
                    {
                        ["物品"] = "阳光",
                        ["数量"] = "20",
                        ["几率"] = 50
                    },
                    {
                        ["物品"] = "金币",
                        ["数量"] = "1",
                        ["几率"] = 30
                    }
                },
                ["转波次文字"] = "AssetId://391536769349332993",
                ["转波次音效"] = "sandboxId://soundeffect/finalwave_终波.ogg"
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = "僵尸",
                                ["比重"] = 50
                            },
                            {
                                ["怪物类型"] = "士兵僵尸",
                                ["比重"] = 50
                            }
                        },
                        ["持续时间"] = 30,
                        ["数量"] = 10,
                        ["最大数量"] = 30,
                        ["开始时间"] = 0
                    }
                },
                ["属性倍率"] = 1,
                ["怪物等级"] = {
                    30,
                    40
                },
                ["掉落物"] = {
                    {
                        ["物品"] = "阳光",
                        ["数量"] = "20",
                        ["几率"] = 50
                    },
                    {
                        ["物品"] = "金币",
                        ["数量"] = "1",
                        ["几率"] = 30
                    }
                },
                ["转波次文字"] = "AssetId://391536769349332993",
                ["转波次音效"] = "sandboxId://soundeffect/finalwave_终波.ogg"
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = "僵尸",
                                ["比重"] = 50
                            },
                            {
                                ["怪物类型"] = "寒冰僵尸",
                                ["比重"] = 20
                            },
                            {
                                ["怪物类型"] = "士兵僵尸",
                                ["比重"] = 40
                            }
                        },
                        ["持续时间"] = 50,
                        ["数量"] = 15,
                        ["最大数量"] = 20,
                        ["开始时间"] = 0
                    }
                },
                ["属性倍率"] = 1,
                ["怪物等级"] = {
                    40,
                    50
                },
                ["掉落物"] = {
                    {
                        ["物品"] = "阳光",
                        ["数量"] = "20",
                        ["几率"] = 50
                    },
                    {
                        ["物品"] = "金币",
                        ["数量"] = "1",
                        ["几率"] = 30
                    }
                },
                ["转波次文字"] = "AssetId://391536769349332993",
                ["转波次音效"] = "sandboxId://soundeffect/finalwave_终波.ogg"
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = "僵尸",
                                ["比重"] = 50
                            },
                            {
                                ["怪物类型"] = "士兵僵尸",
                                ["比重"] = 50
                            },
                            {
                                ["怪物类型"] = "寒冰僵尸",
                                ["比重"] = 20
                            },
                            {
                                ["怪物类型"] = "呆滞僵尸",
                                ["比重"] = 10
                            }
                        },
                        ["持续时间"] = 50,
                        ["数量"] = 15,
                        ["最大数量"] = 40,
                        ["开始时间"] = 0
                    }
                },
                ["属性倍率"] = 1,
                ["怪物等级"] = {
                    80,
                    100
                },
                ["掉落物"] = {
                    {
                        ["物品"] = "阳光",
                        ["数量"] = "20",
                        ["几率"] = 50
                    },
                    {
                        ["物品"] = "金币",
                        ["数量"] = "1",
                        ["几率"] = 30
                    }
                },
                ["转波次文字"] = "AssetId://391536769349332993",
                ["转波次音效"] = "sandboxId://soundeffect/finalwave_终波.ogg"
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = "僵尸",
                                ["比重"] = 50
                            },
                            {
                                ["怪物类型"] = "寒冰僵尸",
                                ["比重"] = 10
                            },
                            {
                                ["怪物类型"] = "士兵僵尸",
                                ["比重"] = 30
                            },
                            {
                                ["怪物类型"] = "摇滚僵尸",
                                ["比重"] = 5
                            },
                            {
                                ["怪物类型"] = "绅士僵尸",
                                ["比重"] = 20
                            }
                        },
                        ["持续时间"] = 30,
                        ["数量"] = 10,
                        ["最大数量"] = 30,
                        ["开始时间"] = 0
                    }
                },
                ["属性倍率"] = 1,
                ["怪物等级"] = {
                    120,
                    140
                },
                ["掉落物"] = {
                    {
                        ["物品"] = "阳光",
                        ["数量"] = "20",
                        ["几率"] = 50
                    },
                    {
                        ["物品"] = "金币",
                        ["数量"] = "1",
                        ["几率"] = 30
                    }
                },
                ["转波次文字"] = "AssetId://391536769349332993",
                ["转波次音效"] = "sandboxId://soundeffect/finalwave_终波.ogg"
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = "寒冰僵尸",
                                ["比重"] = 50
                            },
                            {
                                ["怪物类型"] = "绅士僵尸",
                                ["比重"] = 15
                            },
                            {
                                ["怪物类型"] = "士兵僵尸",
                                ["比重"] = 30
                            },
                            {
                                ["怪物类型"] = "摇滚僵尸",
                                ["比重"] = 20
                            },
                            {
                                ["怪物类型"] = "呆滞僵尸",
                                ["比重"] = 20
                            }
                        },
                        ["持续时间"] = 30,
                        ["数量"] = 10,
                        ["最大数量"] = 30,
                        ["开始时间"] = 0
                    }
                },
                ["属性倍率"] = 1,
                ["怪物等级"] = {
                    120,
                    140
                },
                ["掉落物"] = {
                    {
                        ["物品"] = "阳光",
                        ["数量"] = "20",
                        ["几率"] = 50
                    },
                    {
                        ["物品"] = "金币",
                        ["数量"] = "1",
                        ["几率"] = 30
                    }
                },
                ["转波次文字"] = "AssetId://391536769349332993",
                ["转波次音效"] = "sandboxId://soundeffect/finalwave_终波.ogg"
            }
        },
        ["场景"] = "副本1",
        ["开始玩家"] = 1,
        ["增加额外玩家时间"] = 3,
        ["最大玩家数"] = 6,
        ["每个玩家增加数量倍率"] = 0,
        ["进入条件"] = Modifiers.New({
            {
                ["目标"] = "自己",
                ["条件类型"] = "HealthCondition",
                ["条件"] = {
                    ["百分比"] = true,
                    ["最小值"] = 0,
                    ["最大值"] = 100
                },
                ["动作"] = "必须"
            }
        }),
        ["掉落物数量修改"] = {
            {
                ["目标"] = "自己",
                ["条件类型"] = "WorldTimeCondition",
                ["条件"] = {
                    ["最小值"] = 6,
                    ["最大值"] = 18
                },
                ["反转"] = true,
                ["动作"] = "威力乘以",
                ["数量"] = "0.5"
            }
        },
        ["排名掉落物"] = {
            {
                ["名次"] = {
                    1,
                    1
                },
                ["物品"] = {
                    ["阳光"] = 700,
                    ["金币"] = 3
                }
            },
            {
                ["名次"] = {
                    2,
                    5
                },
                ["物品"] = {
                    ["阳光"] = 350,
                    ["金币"] = 2
                }
            },
            {
                ["名次"] = {
                    6,
                    20
                },
                ["物品"] = {
                    ["阳光"] = 200,
                    ["金币"] = 1
                }
            },
            {
                ["名次"] = {
                    21,
                    50
                },
                ["物品"] = {
                    ["阳光"] = 100
                }
            },
            {
                ["名次"] = {
                    51,
                    10000
                },
                ["物品"] = {
                    ["阳光"] = 40
                }
            }
        },
        ["胜利音效"] = "sandboxId://soundeffect/winmusic胜利音效.ogg",
        ["失败音效"] = "sandboxId://soundeffect/brain_eaten.ogg"
    }),
    ["1-2（100~200级）"] = LevelType.New({
        ["关卡ID"] = "1-2（100~200级）",
        ["描述"] = "需求等级: [level]/100级",
        ["前置关卡"] = nil,
        ["关卡波次"] = {
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = "僵尸",
                                ["比重"] = 50
                            },
                            {
                                ["怪物类型"] = "士兵僵尸",
                                ["比重"] = 50
                            }
                        },
                        ["持续时间"] = 20,
                        ["数量"] = 20,
                        ["最大数量"] = 50,
                        ["开始时间"] = 0
                    }
                },
                ["属性倍率"] = 1,
                ["怪物等级"] = {
                    15,
                    19
                },
                ["掉落物"] = {
                    {
                        ["物品"] = "阳光",
                        ["数量"] = "30",
                        ["几率"] = 50
                    },
                    {
                        ["物品"] = "金币",
                        ["数量"] = "1",
                        ["几率"] = 40
                    }
                },
                ["转波次文字"] = "",
                ["转波次音效"] = ""
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = "僵尸",
                                ["比重"] = 50
                            },
                            {
                                ["怪物类型"] = "士兵僵尸",
                                ["比重"] = 50
                            }
                        },
                        ["持续时间"] = 20,
                        ["数量"] = 20,
                        ["最大数量"] = 50,
                        ["开始时间"] = 0
                    }
                },
                ["属性倍率"] = 1,
                ["怪物等级"] = {
                    20,
                    25
                },
                ["掉落物"] = {
                    {
                        ["物品"] = "阳光",
                        ["数量"] = "30",
                        ["几率"] = 60
                    },
                    {
                        ["物品"] = "金币",
                        ["数量"] = "1",
                        ["几率"] = 40
                    }
                },
                ["转波次文字"] = "",
                ["转波次音效"] = ""
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = "士兵僵尸",
                                ["比重"] = 100
                            }
                        },
                        ["持续时间"] = 20,
                        ["数量"] = 30,
                        ["最大数量"] = 70,
                        ["开始时间"] = 0
                    }
                },
                ["属性倍率"] = 1,
                ["怪物等级"] = {
                    26,
                    33
                },
                ["掉落物"] = {
                    {
                        ["物品"] = "阳光",
                        ["数量"] = "40",
                        ["几率"] = 50
                    },
                    {
                        ["物品"] = "金币",
                        ["数量"] = "1",
                        ["几率"] = 40
                    }
                },
                ["转波次文字"] = "",
                ["转波次音效"] = ""
            }
        },
        ["场景"] = "副本1",
        ["开始玩家"] = 1,
        ["增加额外玩家时间"] = 5,
        ["最大玩家数"] = 6,
        ["每个玩家增加数量倍率"] = 0,
        ["进入条件"] = Modifiers.New({
            {
                ["目标"] = "自己",
                ["条件类型"] = "HealthCondition",
                ["条件"] = {
                    ["百分比"] = true,
                    ["最小值"] = 0,
                    ["最大值"] = 100
                },
                ["动作"] = "必须"
            }
        }),
        ["掉落物数量修改"] = {
            {
                ["目标"] = "自己",
                ["条件类型"] = "WorldTimeCondition",
                ["条件"] = {
                    ["最小值"] = 6,
                    ["最大值"] = 18
                },
                ["反转"] = true,
                ["动作"] = "威力乘以",
                ["数量"] = "0.5"
            }
        },
        ["排名掉落物"] = {
            {
                ["名次"] = {
                    1,
                    1
                },
                ["物品"] = {
                    ["阳光"] = 1400,
                    ["金币"] = 20
                }
            },
            {
                ["名次"] = {
                    2,
                    5
                },
                ["物品"] = {
                    ["阳光"] = 800,
                    ["金币"] = 10
                }
            },
            {
                ["名次"] = {
                    6,
                    10
                },
                ["物品"] = {
                    ["阳光"] = 400,
                    ["金币"] = 5
                }
            },
            {
                ["名次"] = {
                    11,
                    50
                },
                ["物品"] = {
                    ["阳光"] = 200,
                    ["金币"] = 4
                }
            },
            {
                ["名次"] = {
                    51,
                    100
                },
                ["物品"] = {
                    ["阳光"] = 100,
                    ["金币"] = 3
                }
            },
            {
                ["名次"] = {
                    101,
                    500
                },
                ["物品"] = {
                    ["阳光"] = 80,
                    ["金币"] = 2
                }
            },
            {
                ["名次"] = {
                    501,
                    10000
                },
                ["物品"] = {
                    ["阳光"] = 50,
                    ["金币"] = 10
                }
            }
        }
    }),
    ["1-3（200级~300级）"] = LevelType.New({
        ["关卡ID"] = "1-3（200级~300级）",
        ["描述"] = nil,
        ["前置关卡"] = nil,
        ["关卡波次"] = {
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = "摇滚僵尸",
                                ["比重"] = 100
                            }
                        },
                        ["持续时间"] = 20,
                        ["数量"] = 30,
                        ["最大数量"] = 70,
                        ["开始时间"] = 0
                    }
                },
                ["属性倍率"] = 1,
                ["怪物等级"] = {
                    27,
                    33
                },
                ["掉落物"] = {
                    {
                        ["物品"] = "阳光",
                        ["数量"] = "40",
                        ["几率"] = 60
                    },
                    {
                        ["物品"] = "金币",
                        ["数量"] = "2",
                        ["几率"] = 40
                    }
                }
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = "摇滚僵尸",
                                ["比重"] = 100
                            }
                        },
                        ["持续时间"] = 20,
                        ["数量"] = 30,
                        ["最大数量"] = 70,
                        ["开始时间"] = 0
                    }
                },
                ["属性倍率"] = 1,
                ["怪物等级"] = {
                    34,
                    40
                },
                ["掉落物"] = {
                    {
                        ["物品"] = "阳光",
                        ["数量"] = "60",
                        ["几率"] = 50
                    },
                    {
                        ["物品"] = "金币",
                        ["数量"] = "25",
                        ["几率"] = 50
                    }
                }
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = "摇滚僵尸",
                                ["比重"] = 100
                            }
                        },
                        ["持续时间"] = 20,
                        ["数量"] = 40,
                        ["最大数量"] = 90,
                        ["开始时间"] = 0
                    }
                },
                ["属性倍率"] = 1,
                ["怪物等级"] = {
                    41,
                    48
                },
                ["掉落物"] = {
                    {
                        ["物品"] = "阳光",
                        ["数量"] = "70",
                        ["几率"] = 50
                    },
                    {
                        ["物品"] = "金币",
                        ["数量"] = "3",
                        ["几率"] = 50
                    }
                }
            }
        },
        ["场景"] = "副本2",
        ["开始玩家"] = 1,
        ["增加额外玩家时间"] = 7,
        ["最大玩家数"] = 6,
        ["每个玩家增加数量倍率"] = 0,
        ["进入条件"] = Modifiers.New({
            {
                ["目标"] = "自己",
                ["条件类型"] = "HealthCondition",
                ["条件"] = {
                    ["百分比"] = true,
                    ["最小值"] = 0,
                    ["最大值"] = 100
                },
                ["动作"] = "必须"
            }
        }),
        ["掉落物数量修改"] = {
            {
                ["目标"] = "自己",
                ["条件类型"] = "WorldTimeCondition",
                ["条件"] = {
                    ["最小值"] = 6,
                    ["最大值"] = 18
                },
                ["反转"] = true,
                ["动作"] = "威力乘以",
                ["数量"] = "0.5"
            }
        },
        ["排名掉落物"] = {
            {
                ["名次"] = {
                    1,
                    1
                },
                ["物品"] = {
                    ["阳光"] = 1800,
                    ["金币"] = 80
                }
            },
            {
                ["名次"] = {
                    2,
                    5
                },
                ["物品"] = {
                    ["阳光"] = 1600,
                    ["金币"] = 60
                }
            },
            {
                ["名次"] = {
                    6,
                    10
                },
                ["物品"] = {
                    ["阳光"] = 1450,
                    ["金币"] = 45
                }
            },
            {
                ["名次"] = {
                    11,
                    30
                },
                ["物品"] = {
                    ["阳光"] = 900,
                    ["金币"] = 30
                }
            },
            {
                ["名次"] = {
                    31,
                    60
                },
                ["物品"] = {
                    ["阳光"] = 450,
                    ["金币"] = 15
                }
            },
            {
                ["名次"] = {
                    61,
                    150
                },
                ["物品"] = {
                    ["阳光"] = 225,
                    ["金币"] = 7
                }
            },
            {
                ["名次"] = {
                    151,
                    500
                },
                ["物品"] = {
                    ["阳光"] = 150,
                    ["金币"] = 6
                }
            },
            {
                ["名次"] = {
                    501,
                    10000
                },
                ["物品"] = {
                    ["阳光"] = 120,
                    ["金币"] = 3
                }
            }
        },
        ["首通奖励"] = nil,
        ["胜利音效"] = nil,
        ["失败音效"] = nil
    }),
    ["1-4（300级~400级）"] = LevelType.New({
        ["关卡ID"] = "1-4（300级~400级）",
        ["描述"] = nil,
        ["前置关卡"] = nil,
        ["关卡波次"] = {
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = "寒冰僵尸",
                                ["比重"] = 100
                            }
                        },
                        ["持续时间"] = 20,
                        ["数量"] = 40,
                        ["最大数量"] = 90,
                        ["开始时间"] = 0
                    }
                },
                ["属性倍率"] = 1,
                ["怪物等级"] = {
                    49,
                    55
                },
                ["掉落物"] = {
                    {
                        ["物品"] = "阳光",
                        ["数量"] = "70",
                        ["几率"] = 50
                    },
                    {
                        ["物品"] = "金币",
                        ["数量"] = "40",
                        ["几率"] = 40
                    }
                },
                ["转波次文字"] = "",
                ["转波次音效"] = ""
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = "寒冰僵尸",
                                ["比重"] = 100
                            }
                        },
                        ["持续时间"] = 20,
                        ["数量"] = 40,
                        ["最大数量"] = 90,
                        ["开始时间"] = 10
                    }
                },
                ["属性倍率"] = 1,
                ["怪物等级"] = {
                    56,
                    62
                },
                ["掉落物"] = {
                    {
                        ["物品"] = "阳光",
                        ["数量"] = "70",
                        ["几率"] = 60
                    },
                    {
                        ["物品"] = "金币",
                        ["数量"] = "5",
                        ["几率"] = 50
                    },
                    {
                        ["物品"] = "能量豆",
                        ["数量"] = "1",
                        ["几率"] = 0.05
                    }
                },
                ["转波次文字"] = "",
                ["转波次音效"] = ""
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = "寒冰僵尸",
                                ["比重"] = 100
                            }
                        },
                        ["持续时间"] = 20,
                        ["数量"] = 10,
                        ["最大数量"] = 60,
                        ["开始时间"] = 0
                    }
                },
                ["属性倍率"] = 1,
                ["怪物等级"] = {
                    63,
                    70
                },
                ["掉落物"] = {
                    {
                        ["物品"] = "阳光",
                        ["数量"] = "80",
                        ["几率"] = 55
                    },
                    {
                        ["物品"] = "金币",
                        ["数量"] = "5",
                        ["几率"] = 60
                    }
                },
                ["转波次文字"] = "",
                ["转波次音效"] = ""
            }
        },
        ["场景"] = "副本2",
        ["开始玩家"] = 1,
        ["增加额外玩家时间"] = 9,
        ["最大玩家数"] = 6,
        ["每个玩家增加数量倍率"] = 0,
        ["进入条件"] = Modifiers.New({
            {
                ["目标"] = "自己",
                ["条件类型"] = "HealthCondition",
                ["条件"] = {
                    ["百分比"] = true,
                    ["最小值"] = 0,
                    ["最大值"] = 100
                },
                ["动作"] = "必须"
            }
        }),
        ["掉落物数量修改"] = {
            {
                ["目标"] = "自己",
                ["条件类型"] = "WorldTimeCondition",
                ["条件"] = {
                    ["最小值"] = 6,
                    ["最大值"] = 18
                },
                ["反转"] = true,
                ["动作"] = "威力乘以",
                ["数量"] = "0.5"
            }
        },
        ["排名掉落物"] = {
            {
                ["名次"] = {
                    1,
                    1
                },
                ["物品"] = {
                    ["阳光"] = 2400,
                    ["金币"] = 160
                }
            },
            {
                ["名次"] = {
                    2,
                    3
                },
                ["物品"] = {
                    ["阳光"] = 2200,
                    ["金币"] = 140
                }
            },
            {
                ["名次"] = {
                    4,
                    10
                },
                ["物品"] = {
                    ["阳光"] = 1900,
                    ["金币"] = 120
                }
            },
            {
                ["名次"] = {
                    11,
                    50
                },
                ["物品"] = {
                    ["阳光"] = 1600,
                    ["金币"] = 100
                }
            },
            {
                ["名次"] = {
                    51,
                    200
                },
                ["物品"] = {
                    ["阳光"] = 1300,
                    ["金币"] = 80
                }
            },
            {
                ["名次"] = {
                    201,
                    500
                },
                ["物品"] = {
                    ["阳光"] = 900,
                    ["金币"] = 65
                }
            },
            {
                ["名次"] = {
                    501,
                    10000
                },
                ["物品"] = {
                    ["阳光"] = 700,
                    ["金币"] = 400
                }
            }
        },
        ["首通奖励"] = nil
    }),
    ["1-5（400级~500级）"] = LevelType.New({
        ["关卡ID"] = "1-5（400级~500级）",
        ["描述"] = nil,
        ["前置关卡"] = nil,
        ["关卡波次"] = {
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = "绅士僵尸",
                                ["比重"] = 100
                            }
                        },
                        ["持续时间"] = 20,
                        ["数量"] = 10,
                        ["最大数量"] = 60,
                        ["开始时间"] = 0
                    }
                },
                ["属性倍率"] = 1,
                ["怪物等级"] = {
                    71,
                    78
                },
                ["掉落物"] = {
                    {
                        ["物品"] = "阳光",
                        ["数量"] = "80",
                        ["几率"] = 60
                    },
                    {
                        ["物品"] = "金币",
                        ["数量"] = "6",
                        ["几率"] = 50
                    }
                },
                ["转波次文字"] = "",
                ["转波次音效"] = ""
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = "绅士僵尸",
                                ["比重"] = 100
                            }
                        },
                        ["持续时间"] = 20,
                        ["数量"] = 10,
                        ["最大数量"] = 80,
                        ["开始时间"] = 0
                    }
                },
                ["属性倍率"] = 1,
                ["怪物等级"] = {
                    79,
                    86
                },
                ["掉落物"] = {
                    {
                        ["物品"] = "阳光",
                        ["数量"] = "90",
                        ["几率"] = 55
                    },
                    {
                        ["物品"] = "金币",
                        ["数量"] = "6",
                        ["几率"] = 55
                    }
                },
                ["转波次文字"] = "",
                ["转波次音效"] = ""
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = "绅士僵尸",
                                ["比重"] = 100
                            }
                        },
                        ["持续时间"] = 20,
                        ["数量"] = 10,
                        ["最大数量"] = 100,
                        ["开始时间"] = 10
                    }
                },
                ["属性倍率"] = 1,
                ["怪物等级"] = {
                    86,
                    95
                },
                ["掉落物"] = {
                    {
                        ["物品"] = "阳光",
                        ["数量"] = "90",
                        ["几率"] = 60
                    },
                    {
                        ["物品"] = "金币",
                        ["数量"] = "6",
                        ["几率"] = 60
                    },
                    {
                        ["物品"] = "能量豆",
                        ["数量"] = "1",
                        ["几率"] = 0.1
                    }
                },
                ["转波次文字"] = "",
                ["转波次音效"] = ""
            }
        },
        ["场景"] = "副本2",
        ["开始玩家"] = 1,
        ["增加额外玩家时间"] = 11,
        ["最大玩家数"] = 6,
        ["每个玩家增加数量倍率"] = 0,
        ["进入条件"] = Modifiers.New({
            {
                ["目标"] = "自己",
                ["条件类型"] = "HealthCondition",
                ["条件"] = {
                    ["百分比"] = true,
                    ["最小值"] = 0,
                    ["最大值"] = 100
                },
                ["动作"] = "必须"
            }
        }),
        ["掉落物数量修改"] = {
            {
                ["目标"] = "自己",
                ["条件类型"] = "WorldTimeCondition",
                ["条件"] = {
                    ["最小值"] = 6,
                    ["最大值"] = 18
                },
                ["反转"] = true,
                ["动作"] = "威力乘以",
                ["数量"] = "0.5"
            }
        },
        ["排名掉落物"] = {
            {
                ["名次"] = {
                    1,
                    1
                },
                ["物品"] = {
                    ["阳光"] = 4800,
                    ["金币"] = 300
                }
            },
            {
                ["名次"] = {
                    2,
                    3
                },
                ["物品"] = {
                    ["阳光"] = 3900,
                    ["金币"] = 250
                }
            },
            {
                ["名次"] = {
                    4,
                    6
                },
                ["物品"] = {
                    ["阳光"] = 3300,
                    ["金币"] = 200
                }
            },
            {
                ["名次"] = {
                    7,
                    15
                },
                ["物品"] = {
                    ["阳光"] = 2800,
                    ["金币"] = 160
                }
            },
            {
                ["名次"] = {
                    16,
                    30
                },
                ["物品"] = {
                    ["阳光"] = 2400,
                    ["金币"] = 140
                }
            },
            {
                ["名次"] = {
                    31,
                    60
                },
                ["物品"] = {
                    ["阳光"] = 2100,
                    ["金币"] = 110
                }
            },
            {
                ["名次"] = {
                    61,
                    200
                },
                ["物品"] = {
                    ["阳光"] = 1600,
                    ["金币"] = 900
                }
            },
            {
                ["名次"] = {
                    201,
                    500
                },
                ["物品"] = {
                    ["阳光"] = 1400,
                    ["金币"] = 80
                }
            },
            {
                ["名次"] = {
                    501,
                    10000
                },
                ["物品"] = {
                    ["阳光"] = 1200,
                    ["金币"] = 70
                }
            }
        },
        ["首通奖励"] = nil
    }),
    ["测试关卡"] = LevelType.New({
        ["关卡ID"] = "测试关卡",
        ["描述"] = nil,
        ["前置关卡"] = nil,
        ["关卡波次"] = {
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = nil,
                                ["比重"] = 50
                            }
                        },
                        ["持续时间"] = 20,
                        ["数量"] = 10,
                        ["最大数量"] = 20,
                        ["开始时间"] = 10
                    }
                },
                ["属性倍率"] = 1,
                ["怪物等级"] = {
                    0,
                    0
                }
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = nil,
                                ["比重"] = 50
                            }
                        },
                        ["持续时间"] = 20,
                        ["数量"] = 10,
                        ["最大数量"] = 20,
                        ["开始时间"] = 10
                    }
                },
                ["属性倍率"] = 1,
                ["怪物等级"] = {
                    0,
                    0
                }
            }
        },
        ["场景"] = "副本1",
        ["开始玩家"] = 1,
        ["增加额外玩家时间"] = 10,
        ["最大玩家数"] = 6,
        ["每个玩家增加数量倍率"] = 0.5,
        ["每个玩家增加属性倍率"] = {
            ["生命"] = 0.5,
            ["攻击"] = 0.1
        },
        ["进入条件"] = Modifiers.New({
            {
                ["目标"] = "自己",
                ["条件类型"] = "HealthCondition",
                ["条件"] = {
                    ["百分比"] = true,
                    ["最小值"] = 0,
                    ["最大值"] = 100
                },
                ["动作"] = "必须"
            }
        }),
        ["掉落物数量修改"] = nil,
        ["排名掉落物"] = nil,
        ["首通奖励"] = nil,
        ["胜利音效"] = nil,
        ["失败音效"] = nil
    })
}loaded = true
end

---@param level string
---@return LevelType
function LevelConfig.Get(level)
    if not loaded then
        LoadConfig()
    end
    return LevelConfig.config[level]
end

---@return table<string, LevelType>
function LevelConfig.GetAll()
    if not loaded then
        LoadConfig()
    end
    return LevelConfig.config
end
return LevelConfig