local MainStorage = game:GetService('MainStorage')
local gg                = require(MainStorage.code.common.MGlobal)    ---@type gg
local Modifiers      = require(MainStorage.code.common.config_type.modifier.Modifiers)    ---@type Modifiers
local Quest      = require(MainStorage.code.common.config_type.Quest)    ---@type Quest


--- 任务配置文件
---@class QuestConfig
local QuestConfig = {}
local loaded = false

local function LoadConfig()
    QuestConfig.config ={
    ["1完成关卡1-1"] = Quest.New({
        ["名字"] = "1完成关卡1-1",
        ["分类"] = "主线",
        ["简短描述"] = "完成关卡：1-1",
        ["完成数量"] = 1,
        ["任务类型"] = 1,
        ["任务变量"] = "level_1-1",
        ["完成奖励"] = {
            [""] = 5
        },
        ["自动领取下一任务"] = "2抽卡",
        ["刷新类型"] = 0,
        ["刷新时自动领取"] = false,
        ["显示完成进度"] = false
    }),
    ["2抽卡"] = Quest.New({
        ["名字"] = "2抽卡",
        ["分类"] = "主线",
        ["简短描述"] = "在【试手寻锋】中获取五把兵刃",
        ["完成数量"] = 5,
        ["任务类型"] = 1,
        ["任务变量"] = "draw_试手寻锋",
        ["完成奖励"] = {
            [""] = 300
        },
        ["自动领取下一任务"] = "3装备兵刃",
        ["刷新类型"] = 0,
        ["刷新时自动领取"] = false,
        ["显示完成进度"] = false
    }),
    ["3装备兵刃"] = Quest.New({
        ["名字"] = "3装备兵刃",
        ["分类"] = "主线",
        ["简短描述"] = "装备新获得的兵刃",
        ["完成数量"] = 1,
        ["任务类型"] = 1,
        ["任务变量"] = "equipped",
        ["完成奖励"] = {
            [""] = 500
        },
        ["自动领取下一任务"] = "4完成关卡1-2",
        ["刷新类型"] = 0,
        ["刷新时自动领取"] = false,
        ["显示完成进度"] = false
    }),
    ["4完成关卡1-2"] = Quest.New({
        ["名字"] = "4完成关卡1-2",
        ["分类"] = "主线",
        ["简短描述"] = "完成关卡：1-2",
        ["完成数量"] = 1,
        ["任务类型"] = 1,
        ["任务变量"] = "level_1-2",
        ["完成奖励"] = {
            [""] = 6
        },
        ["自动领取下一任务"] = "5强化护甲",
        ["刷新类型"] = 0,
        ["刷新时自动领取"] = false,
        ["显示完成进度"] = false
    }),
    ["5强化护甲"] = Quest.New({
        ["名字"] = "5强化护甲",
        ["分类"] = "主线",
        ["简短描述"] = "将护甲全部强化到+1",
        ["完成数量"] = 6,
        ["任务类型"] = 1,
        ["任务变量"] = "enhanced_1_1",
        ["完成奖励"] = {
            [""] = 300
        },
        ["自动领取下一任务"] = "6完成关卡1-3",
        ["刷新类型"] = 0,
        ["刷新时自动领取"] = false,
        ["显示完成进度"] = false
    }),
    ["6完成关卡1-3"] = Quest.New({
        ["名字"] = "6完成关卡1-3",
        ["分类"] = "主线",
        ["简短描述"] = "完成关卡：1-3",
        ["完成数量"] = 1,
        ["任务类型"] = 1,
        ["任务变量"] = "level_1-3",
        ["完成奖励"] = {
            [""] = 3
        },
        ["自动领取下一任务"] = "7装备宝石",
        ["刷新类型"] = 0,
        ["刷新时自动领取"] = false,
        ["显示完成进度"] = false
    }),
    ["7装备宝石"] = Quest.New({
        ["名字"] = "7装备宝石",
        ["分类"] = "主线",
        ["简短描述"] = "装备3个宝石",
        ["完成数量"] = 3,
        ["任务类型"] = 1,
        ["任务变量"] = "equip_jade",
        ["完成奖励"] = {
            [""] = 300
        },
        ["自动领取下一任务"] = "8完成关卡1-4",
        ["刷新类型"] = 0,
        ["刷新时自动领取"] = false,
        ["显示完成进度"] = false
    }),
    ["8完成关卡1-4"] = Quest.New({
        ["名字"] = "8完成关卡1-4",
        ["分类"] = "主线",
        ["简短描述"] = "完成关卡：1-4",
        ["完成数量"] = 1,
        ["任务类型"] = 1,
        ["任务变量"] = "level_1-4",
        ["完成奖励"] = {
            [""] = 6
        },
        ["自动领取下一任务"] = "9强化护甲",
        ["刷新类型"] = 0,
        ["刷新时自动领取"] = false,
        ["显示完成进度"] = false
    }),
    ["9强化护甲"] = Quest.New({
        ["名字"] = "9强化护甲",
        ["分类"] = "主线",
        ["简短描述"] = "将护甲全部强化到+3",
        ["完成数量"] = 6,
        ["任务类型"] = 1,
        ["任务变量"] = "enhanced_1_3",
        ["完成奖励"] = {
            [""] = 300
        },
        ["自动领取下一任务"] = "10完成关卡1-5",
        ["刷新类型"] = 0,
        ["刷新时自动领取"] = false,
        ["显示完成进度"] = false
    }),
    ["10完成关卡1-5"] = Quest.New({
        ["名字"] = "10完成关卡1-5",
        ["分类"] = "主线",
        ["简短描述"] = "完成关卡：1-5",
        ["完成数量"] = 1,
        ["任务类型"] = 1,
        ["任务变量"] = "level_1-5",
        ["完成奖励"] = {
            [""] = 10
        },
        ["自动领取下一任务"] = "11抽卡15",
        ["刷新类型"] = 0,
        ["刷新时自动领取"] = false,
        ["显示完成进度"] = false
    }),
    ["11完成关卡1-1"] = Quest.New({
        ["名字"] = "11完成关卡1-1",
        ["分类"] = "主线",
        ["完成数量"] = 0,
        ["任务类型"] = 0,
        ["刷新类型"] = 0,
        ["刷新时自动领取"] = false,
        ["显示完成进度"] = false
    }),
    ["11抽卡15"] = Quest.New({
        ["名字"] = "11抽卡15",
        ["分类"] = "主线",
        ["简短描述"] = "累计【试手寻锋】获取15次兵刃",
        ["完成数量"] = 15,
        ["任务类型"] = 1,
        ["任务变量"] = "draw_试手寻锋",
        ["完成奖励"] = {
            [""] = 20
        },
        ["自动领取下一任务"] = "12强化兵刃",
        ["刷新类型"] = 0,
        ["刷新时自动领取"] = false,
        ["显示完成进度"] = false
    }),
    ["12强化兵刃"] = Quest.New({
        ["名字"] = "12强化兵刃",
        ["分类"] = "主线",
        ["简短描述"] = "强化任意兵刃",
        ["完成数量"] = 1,
        ["任务类型"] = 1,
        ["任务变量"] = "weapon_enhanced",
        ["完成奖励"] = {
            [""] = 300
        },
        ["自动领取下一任务"] = "13完成关卡1-6",
        ["刷新类型"] = 0,
        ["刷新时自动领取"] = false,
        ["显示完成进度"] = false
    }),
    ["13完成关卡1-6"] = Quest.New({
        ["名字"] = "13完成关卡1-6",
        ["分类"] = "主线",
        ["简短描述"] = "完成关卡：1-6",
        ["完成数量"] = 1,
        ["任务类型"] = 1,
        ["任务变量"] = "level_1-6",
        ["完成奖励"] = {
            [""] = 6
        },
        ["自动领取下一任务"] = "14强化护甲",
        ["刷新类型"] = 0,
        ["刷新时自动领取"] = false,
        ["显示完成进度"] = true
    }),
    ["14强化护甲"] = Quest.New({
        ["名字"] = "14强化护甲",
        ["分类"] = "主线",
        ["简短描述"] = "将护甲全部强化到+5",
        ["完成数量"] = 6,
        ["任务类型"] = 1,
        ["任务变量"] = "enhanced_1_5",
        ["完成奖励"] = {
            [""] = 300
        },
        ["自动领取下一任务"] = "15进阶护甲",
        ["刷新类型"] = 0,
        ["刷新时自动领取"] = false,
        ["显示完成进度"] = false
    }),
    ["15进阶护甲"] = Quest.New({
        ["名字"] = "15进阶护甲",
        ["分类"] = "主线",
        ["简短描述"] = "将护甲全部进阶",
        ["完成数量"] = 6,
        ["任务类型"] = 1,
        ["任务变量"] = "breakthrough_1",
        ["完成奖励"] = {
            [""] = 6
        },
        ["自动领取下一任务"] = "16装备宝石",
        ["刷新类型"] = 0,
        ["刷新时自动领取"] = false,
        ["显示完成进度"] = false
    }),
    ["16装备宝石"] = Quest.New({
        ["名字"] = "16装备宝石",
        ["分类"] = "主线",
        ["简短描述"] = "总计装备12个宝石",
        ["完成数量"] = 12,
        ["任务类型"] = 1,
        ["任务变量"] = "equip_jade",
        ["完成奖励"] = {
            [""] = 300
        },
        ["自动领取下一任务"] = "17每日关卡",
        ["刷新类型"] = 0,
        ["刷新时自动领取"] = false,
        ["显示完成进度"] = false
    }),
    ["17每日关卡"] = Quest.New({
        ["名字"] = "17每日关卡",
        ["分类"] = "主线",
        ["简短描述"] = "完成每日挑战",
        ["完成数量"] = 1,
        ["任务类型"] = 1,
        ["任务变量"] = "level_mr1",
        ["完成奖励"] = {
            [""] = 300
        },
        ["自动领取下一任务"] = "18完成关卡2-3",
        ["刷新类型"] = 0,
        ["刷新时自动领取"] = false,
        ["显示完成进度"] = false
    }),
    ["18完成关卡2-3"] = Quest.New({
        ["名字"] = "18完成关卡2-3",
        ["分类"] = "主线",
        ["简短描述"] = "完成关卡：2-3",
        ["完成数量"] = 1,
        ["任务类型"] = 1,
        ["任务变量"] = "level_2-3",
        ["完成奖励"] = {
            [""] = 10
        },
        ["自动领取下一任务"] = "19抽卡5",
        ["刷新类型"] = 0,
        ["刷新时自动领取"] = false,
        ["显示完成进度"] = false
    }),
    ["19抽卡5"] = Quest.New({
        ["名字"] = "19抽卡5",
        ["分类"] = "主线",
        ["简短描述"] = "在【神锋现世】中获取10把兵刃",
        ["完成数量"] = 10,
        ["任务类型"] = 1,
        ["任务变量"] = "draw_神锋现世",
        ["完成奖励"] = {
            [""] = 3000
        },
        ["自动领取下一任务"] = "20强化紫武",
        ["刷新类型"] = 0,
        ["刷新时自动领取"] = false,
        ["显示完成进度"] = false
    }),
    ["20强化紫武"] = Quest.New({
        ["名字"] = "20强化紫武",
        ["分类"] = "主线",
        ["简短描述"] = "累计将紫色兵刃强化两次",
        ["完成数量"] = 2,
        ["任务类型"] = 1,
        ["任务变量"] = "weapon_史诗",
        ["完成奖励"] = {
            [""] = 300
        },
        ["自动领取下一任务"] = "21完成关卡2-5",
        ["刷新类型"] = 0,
        ["刷新时自动领取"] = false,
        ["显示完成进度"] = false
    }),
    ["21完成关卡2-5"] = Quest.New({
        ["名字"] = "21完成关卡2-5",
        ["分类"] = "主线",
        ["简短描述"] = "完成关卡：2-5",
        ["完成数量"] = 1,
        ["任务类型"] = 1,
        ["任务变量"] = "level_2-5",
        ["完成奖励"] = {
            [""] = 18
        },
        ["自动领取下一任务"] = "22强化护甲",
        ["刷新类型"] = 0,
        ["刷新时自动领取"] = false,
        ["显示完成进度"] = false
    }),
    ["22强化护甲"] = Quest.New({
        ["名字"] = "22强化护甲",
        ["分类"] = "主线",
        ["简短描述"] = "将护甲全部强化到+5",
        ["完成数量"] = 6,
        ["任务类型"] = 1,
        ["任务变量"] = "enhanced_2_5",
        ["完成奖励"] = {
            [""] = 300
        },
        ["自动领取下一任务"] = "23完成困难关卡",
        ["刷新类型"] = 0,
        ["刷新时自动领取"] = false,
        ["显示完成进度"] = false
    }),
    ["23完成困难关卡"] = Quest.New({
        ["名字"] = "23完成困难关卡",
        ["分类"] = "主线",
        ["简短描述"] = "完成第一大关的全部困难模式",
        ["完成数量"] = 6,
        ["任务类型"] = 1,
        ["任务变量"] = "level_hard_1",
        ["完成奖励"] = {
            [""] = 1000
        },
        ["自动领取下一任务"] = "24进阶护甲",
        ["刷新类型"] = 0,
        ["刷新时自动领取"] = false,
        ["显示完成进度"] = false
    }),
    ["24进阶护甲"] = Quest.New({
        ["名字"] = "24进阶护甲",
        ["分类"] = "主线",
        ["简短描述"] = "将护甲全部进阶",
        ["完成数量"] = 6,
        ["任务类型"] = 1,
        ["任务变量"] = "breakthrough_2",
        ["完成奖励"] = {
            [""] = 500
        },
        ["自动领取下一任务"] = "25完成关卡2-6",
        ["刷新类型"] = 0,
        ["刷新时自动领取"] = false,
        ["显示完成进度"] = false
    }),
    ["25完成关卡2-6"] = Quest.New({
        ["名字"] = "25完成关卡2-6",
        ["分类"] = "主线",
        ["简短描述"] = "完成关卡：2-6",
        ["完成数量"] = 1,
        ["任务类型"] = 1,
        ["任务变量"] = "level_2-6",
        ["完成奖励"] = {
            [""] = 1001
        },
        ["刷新类型"] = 0,
        ["刷新时自动领取"] = false,
        ["显示完成进度"] = false
    }),
    ["主线"] = Quest.New({
        ["名字"] = "主线",
        ["任务列表"] = {
            "1完成关卡1-1",
            "2抽卡",
            "3装备兵刃",
            "4完成关卡1-2",
            "5强化护甲",
            "6完成关卡1-3",
            "7装备宝石",
            "8完成关卡1-4",
            "9强化护甲",
            "10完成关卡1-5",
            "11抽卡15",
            "12强化兵刃",
            "13完成关卡1-6",
            "14强化护甲",
            "15进阶护甲",
            "16装备宝石",
            "17每日关卡",
            "18完成关卡2-3",
            "19抽卡5",
            "20强化紫武",
            "21完成关卡2-5",
            "22强化护甲",
            "23完成困难关卡",
            "24进阶护甲",
            "25完成关卡2-6"
        }
    }),
    ["成就"] = Quest.New({
        ["名字"] = "成就",
        ["任务列表"] = {
            "成就任务1",
            "成就任务2",
            "成就任务3"
        },
        ["奖励需求物品"] = nil,
        ["奖励"] = {
            {
                ["需求数量"] = 10,
                ["奖励物品"] = nil,
                ["奖励数量"] = 20
            },
            {
                ["需求数量"] = 20,
                ["奖励物品"] = nil,
                ["奖励数量"] = 40
            },
            {
                ["需求数量"] = 40,
                ["奖励物品"] = nil,
                ["奖励数量"] = 80
            },
            {
                ["需求数量"] = 60,
                ["奖励物品"] = nil,
                ["奖励数量"] = 150
            },
            {
                ["需求数量"] = 80,
                ["奖励物品"] = nil,
                ["奖励数量"] = 300
            },
            {
                ["需求数量"] = 100,
                ["奖励物品"] = nil,
                ["奖励数量"] = 500
            }
        }
    }),
    ["周常任务1"] = Quest.New({
        ["名字"] = "周常任务1",
        ["分类"] = "每周",
        ["简短描述"] = "登录游戏",
        ["完整描述"] = "1",
        ["完成数量"] = 0,
        ["任务类型"] = 0,
        ["完成奖励"] = {
            [""] = 10
        },
        ["刷新类型"] = 2,
        ["刷新时自动领取"] = true,
        ["显示完成进度"] = false
    }),
    ["周常任务2"] = Quest.New({
        ["名字"] = "周常任务2",
        ["分类"] = "每周",
        ["简短描述"] = "完成任意关卡",
        ["完成数量"] = 5,
        ["任务类型"] = 1,
        ["任务变量"] = "daily_clear_level",
        ["完成奖励"] = {
            [""] = 10
        },
        ["刷新类型"] = 2,
        ["刷新时自动领取"] = true,
        ["显示完成进度"] = false
    }),
    ["周常任务3"] = Quest.New({
        ["名字"] = "周常任务3",
        ["分类"] = "每周",
        ["简短描述"] = "击败5000个怪物",
        ["完成数量"] = 5000,
        ["任务类型"] = 1,
        ["任务变量"] = "daily_kill_mob",
        ["完成奖励"] = {
            [""] = 10
        },
        ["刷新类型"] = 2,
        ["刷新时自动领取"] = true,
        ["显示完成进度"] = false
    }),
    ["成就任务1"] = Quest.New({
        ["名字"] = "成就任务1",
        ["分类"] = "成就",
        ["简短描述"] = "登录游戏",
        ["完整描述"] = "1",
        ["完成数量"] = 0,
        ["任务类型"] = 0,
        ["完成奖励"] = {
            [""] = 10
        },
        ["刷新类型"] = 0,
        ["刷新时自动领取"] = true,
        ["显示完成进度"] = false
    }),
    ["成就任务2"] = Quest.New({
        ["名字"] = "成就任务2",
        ["分类"] = "成就",
        ["简短描述"] = "完成任意关卡",
        ["完成数量"] = 5,
        ["任务类型"] = 1,
        ["任务变量"] = "daily_clear_level",
        ["完成奖励"] = {
            [""] = 10
        },
        ["刷新类型"] = 0,
        ["刷新时自动领取"] = true,
        ["显示完成进度"] = false
    }),
    ["成就任务3"] = Quest.New({
        ["名字"] = "成就任务3",
        ["分类"] = "成就",
        ["简短描述"] = "击败5000个怪物",
        ["完成数量"] = 5000,
        ["任务类型"] = 1,
        ["任务变量"] = "daily_kill_mob",
        ["完成奖励"] = {
            [""] = 10
        },
        ["刷新类型"] = 0,
        ["刷新时自动领取"] = true,
        ["显示完成进度"] = false
    }),
    ["每日"] = Quest.New({
        ["名字"] = "每日",
        ["任务列表"] = {
            "每日任务1",
            "每日任务2",
            "每日任务3"
        },
        ["奖励需求物品"] = nil,
        ["奖励"] = {
            {
                ["需求数量"] = 10,
                ["奖励物品"] = nil,
                ["奖励数量"] = 20
            },
            {
                ["需求数量"] = 20,
                ["奖励物品"] = nil,
                ["奖励数量"] = 40
            },
            {
                ["需求数量"] = 40,
                ["奖励物品"] = nil,
                ["奖励数量"] = 80
            },
            {
                ["需求数量"] = 60,
                ["奖励物品"] = nil,
                ["奖励数量"] = 150
            },
            {
                ["需求数量"] = 80,
                ["奖励物品"] = nil,
                ["奖励数量"] = 300
            },
            {
                ["需求数量"] = 100,
                ["奖励物品"] = nil,
                ["奖励数量"] = 500
            }
        }
    }),
    ["每日任务1"] = Quest.New({
        ["名字"] = "每日任务1",
        ["分类"] = "每日",
        ["简短描述"] = "登录游戏",
        ["完成数量"] = 0,
        ["任务类型"] = 0,
        ["完成奖励"] = {
            [""] = 10
        },
        ["刷新类型"] = 1,
        ["刷新时自动领取"] = true,
        ["显示完成进度"] = false
    }),
    ["每日任务2"] = Quest.New({
        ["名字"] = "每日任务2",
        ["分类"] = "每日",
        ["简短描述"] = "完成任意关卡",
        ["完成数量"] = 0,
        ["任务类型"] = 1,
        ["任务变量"] = "daily_clear_level",
        ["完成奖励"] = {
            [""] = 10
        },
        ["刷新类型"] = 1,
        ["刷新时自动领取"] = true,
        ["显示完成进度"] = false
    }),
    ["每日任务3"] = Quest.New({
        ["名字"] = "每日任务3",
        ["分类"] = "每日",
        ["简短描述"] = "击败5000个怪物",
        ["完成数量"] = 5000,
        ["任务类型"] = 1,
        ["任务变量"] = "daily_kill_mob",
        ["完成奖励"] = {
            [""] = 10
        },
        ["刷新类型"] = 1,
        ["刷新时自动领取"] = true,
        ["显示完成进度"] = false
    })
}loaded = true
end

---@param questName string
---@return Quest
function QuestConfig.Get(questName)
    if not loaded then
        LoadConfig()
    end
    return QuestConfig.config[questName]
end

---@return Quest[]
function QuestConfig.GetAll()
    if not loaded then
        LoadConfig()
    end
    return QuestConfig.config
end
return QuestConfig
