local MainStorage = game:GetService('MainStorage')
local gg                = require(MainStorage.code.common.MGlobal)    ---@type gg
local Modifiers      = require(MainStorage.code.common.config_type.modifier.Modifiers)    ---@type Modifiers
local Quest      = require(MainStorage.code.common.config_type.Quest)    ---@type Quest


--- 任务配置文件
---@class QuestConfig
local QuestConfig = {}
local loaded = false

local function LoadConfig()
    QuestConfig.config ={
    ["1教程任务——化身射手"] = Quest.New({
        ["名字"] = "1教程任务——化身射手",
        ["分类"] = "主线",
        ["简短描述"] = "保卫你的家！",
        ["完整描述"] = "僵尸袭击花园了，快化身豌豆射手，消灭僵尸保护花园！",
        ["任务类型"] = "事件",
        ["事件名"] = "level_新手关",
        ["完成数量"] = 1,
        ["显示完成进度"] = false,
        ["执行指令"] = {
            [[level {"关卡":"新手关","无需匹配直接开始":true}]]
        },
        ["聚焦场景UI"] = {

        },
        ["自动提交兑奖"] = true,
        ["提交指令"] = {
            [[cast {"魔法名":"完成时延迟提示导航","复杂魔法":{}}]]
        },
        ["自动领取下一任务"] = "2教程任务——阳光汲取",
        ["刷新类型"] = "不刷新"
    }),
    ["2教程任务——阳光汲取"] = Quest.New({
        ["名字"] = "2教程任务——阳光汲取",
        ["分类"] = "主线",
        ["简短描述"] = "这是挂机区域，在此区域内就能收获阳光！",
        ["任务类型"] = "物品",
        ["需求物品"] = "阳光",
        ["完成数量"] = 30,
        ["显示完成进度"] = true,
        ["前往场景节点"] = "g0/挂机点/guaji1",
        ["聚焦场景UI"] = {

        },
        ["自动提交兑奖"] = false,
        ["完成指令"] = {
            [[focusOn {"聚焦UI":{"聚焦UI":[{"UI名":"HudAvatar","控件路径":"头像背景/任务列表/任务_1","提示文本":"任务完成啦！\\n点击跳转到下一任务吧！","可点击任意位置":false}],"完成时执行指令":[]}}]]
        },
        ["自动领取下一任务"] = "3教程任务——主卡强化",
        ["刷新类型"] = "不刷新"
    }),
    ["3教程任务——主卡强化"] = Quest.New({
        ["名字"] = "3教程任务——主卡强化",
        ["分类"] = "主线",
        ["简短描述"] = "点击【主卡】对【豌豆射手】进行强化，变得更强！",
        ["任务类型"] = "变量",
        ["任务变量"] = "skill_enhance_0",
        ["完成数量"] = 1,
        ["显示完成进度"] = false,
        ["聚焦场景UI"] = {
            ["聚焦UI"] = {
                {
                    ["UI名"] = "HudCards",
                    ["控件路径"] = "卡包",
                    ["提示文本"] = "点击进入【卡包】",
                    ["可点击任意位置"] = false
                },
                {
                    ["UI名"] = "CardsGui",
                    ["控件路径"] = "框体/主卡/选择列表/列表/豌豆射手",
                    ["提示文本"] = "查看【主卡·豌豆射手】",
                    ["可点击任意位置"] = false
                },
                {
                    ["UI名"] = "CardsGui",
                    ["控件路径"] = "框体/主卡/加点框/豌豆射手/列表_1/攻击1_豌豆/卡框背景",
                    ["提示文本"] = "对【豌豆射手】进行强化！",
                    ["可点击任意位置"] = false
                }
            }
        },
        ["自动提交兑奖"] = false,
        ["完成指令"] = {
            [[focusOn {"聚焦UI":{"聚焦UI":[{"UI名":"HudAvatar","控件路径":"头像背景/任务列表/任务_1","提示文本":"任务完成啦！\\n点击跳转到下一任务吧！","可点击任意位置":false}],"完成时执行指令":[]}}]]
        },
        ["自动领取下一任务"] = "4教程任务——强力副卡",
        ["刷新类型"] = "不刷新"
    }),
    ["4教程任务——强力副卡"] = Quest.New({
        ["名字"] = "4教程任务——强力副卡",
        ["分类"] = "主线",
        ["简短描述"] = "查看【樱桃炸弹】的技能效果并使用阳光进行【强化】",
        ["完整描述"] = "获得战术副卡！副卡可以在战斗中为我们提供额外效果，点击查看卡牌效果吧！",
        ["任务类型"] = "变量",
        ["任务变量"] = "skill_enhance_1",
        ["完成数量"] = 1,
        ["显示完成进度"] = false,
        ["聚焦场景UI"] = {
            ["聚焦UI"] = {
                {
                    ["UI名"] = "HudCards",
                    ["控件路径"] = "卡包",
                    ["提示文本"] = "点击进入【卡包】",
                    ["可点击任意位置"] = false
                },
                {
                    ["UI名"] = "CardsGui",
                    ["控件路径"] = "框体/标题/卡片/副卡",
                    ["提示文本"] = "选择【副卡】",
                    ["可点击任意位置"] = false
                },
                {
                    ["UI名"] = "CardsGui",
                    ["控件路径"] = "品质列表/品质_4",
                    ["提示文本"] = "选择【卡片分类·R】",
                    ["可点击任意位置"] = false
                },
                {
                    ["UI名"] = "CardsGui",
                    ["控件路径"] = "框体/副卡/副卡列/副卡列表_R/副-樱桃炸弹",
                    ["提示文本"] = "选择【副卡·樱桃炸弹】查看技能！",
                    ["可点击任意位置"] = false
                },
                {
                    ["UI名"] = "CardsGui",
                    ["控件路径"] = "框体/副卡属性/副卡_强化",
                    ["提示文本"] = "对【樱桃炸弹】进行一次强化！",
                    ["可点击任意位置"] = false
                }
            }
        },
        ["自动提交兑奖"] = false,
        ["完成指令"] = {
            [[focusOn {"聚焦UI":{"聚焦UI":[{"UI名":"HudAvatar","控件路径":"头像背景/任务列表/任务_1","提示文本":"任务完成啦！\\n点击跳转到下一任务吧！","可点击任意位置":false}],"完成时执行指令":[]}}]]
        },
        ["提交指令"] = {
            [[skill {"技能名":"副-豌豆射手"}]]
        },
        ["自动领取下一任务"] = "5教程任务——幸运十连",
        ["刷新类型"] = "不刷新"
    }),
    ["5教程任务——幸运十连"] = Quest.New({
        ["名字"] = "5教程任务——幸运十连",
        ["分类"] = "主线",
        ["简短描述"] = "进行一次副卡十连抽",
        ["完整描述"] = "点击副卡奖池，抽取更多强力副卡吧！",
        ["任务类型"] = "事件",
        ["事件名"] = "lottery_副卡奖池",
        ["完成数量"] = 10,
        ["显示完成进度"] = false,
        ["聚焦场景UI"] = {

        },
        ["自动提交兑奖"] = false,
        ["完成指令"] = nil,
        ["提交指令"] = nil,
        ["自动领取下一任务"] = nil,
        ["刷新类型"] = "不刷新"
    }),
    ["测试任务"] = Quest.New({
        ["名字"] = "测试任务",
        ["分类"] = "主线",
        ["简短描述"] = "任务任务任务",
        ["完整描述"] = "任务完整描述",
        ["任务类型"] = "无类型",
        ["完成数量"] = 5,
        ["显示完成进度"] = true,
        ["执行指令"] = nil,
        ["前往场景节点"] = "g0/NPC/铁匠铺",
        ["自动提交兑奖"] = false,
        ["完成指令"] = nil,
        ["提交指令"] = nil,
        ["自动领取下一任务"] = nil,
        ["刷新类型"] = "不刷新"
    })
}loaded = true
end

---@param questName string
---@return Quest
function QuestConfig.Get(questName)
    if not loaded then
        LoadConfig()
    end
    return QuestConfig.config[questName]
end

---@return Quest[]
function QuestConfig.GetAll()
    if not loaded then
        LoadConfig()
    end
    return QuestConfig.config
end
return QuestConfig
