local MainStorage = game:GetService('MainStorage')
local gg                = require(MainStorage.code.common.MGlobal)    ---@type gg
local ShopGood      = require(MainStorage.code.common.config_type.ShopGood)    ---@type ShopGood
local Modifiers = require(MainStorage.code.common.config_type.modifier.Modifiers) ---@type Modifiers

--- ShopGood配置文件
---@class ShopGoodConfig
local ShopGoodConfig = {}
local loaded = false

local function LoadConfig()
    ShopGoodConfig.config ={
    ["副卡大礼包"] = ShopGood.New({
        ["商品名"] = "副卡大礼包",
        ["商品描述"] = "黑夜变白天，白天变黑夜dddddddddddddddd",
        ["价格"] = {
            ["varKey"] = "shop_副卡大礼包",
            ["广告模式"] = "不可看广告",
            ["广告次数"] = 0,
            ["价格类型"] = "水晶",
            ["价格数量"] = 5000
        },
        ["每日重置免费次数"] = false,
        ["限时"] = false,
        ["获得物品"] = {
            ["星星果碎片"] = 10,
            ["坚果碎片"] = 20,
            ["椰子炮碎片"] = 30
        },
        ["奖池"] = nil,
        ["图标复写"] = "sandboxId://textures/plants/Tex_杨桃_BaseColor.png",
        ["图标数量复写"] = 60,
        ["热卖"] = false,
        ["限定"] = false
    }),
    ["副卡抽奖券"] = ShopGood.New({
        ["商品名"] = "副卡抽奖券",
        ["商品描述"] = "参与副卡抽奖，有机会抽取稀有副卡",
        ["价格"] = {
            ["varKey"] = "shop_副卡抽奖券",
            ["广告模式"] = "不可看广告",
            ["广告次数"] = 0,
            ["价格类型"] = "水晶",
            ["价格数量"] = 600
        },
        ["每日重置免费次数"] = false,
        ["限时"] = false,
        ["获得物品"] = {
            ["副卡抽奖券"] = 10
        },
        ["奖池"] = nil,
        ["图标复写"] = "sandboxId://textures/items/shop/普通抽奖券.png",
        ["图标数量复写"] = 10,
        ["热卖"] = false,
        ["限定"] = false
    }),
    ["寒冰射手礼包"] = ShopGood.New({
        ["商品名"] = "寒冰射手礼包",
        ["商品描述"] = "获取寒冰射手主卡，40W阳光、8.8K金币、8能量豆，快速提升您的战斗力",
        ["价格"] = {
            ["varKey"] = "shop_寒冰射手礼包",
            ["广告模式"] = "不可看广告",
            ["广告次数"] = 0,
            ["价格类型"] = "水晶",
            ["价格数量"] = 980
        },
        ["购买条件"] = Modifiers.New({
            {
                ["目标"] = "自己",
                ["条件类型"] = "VariableCondition",
                ["条件"] = {
                    ["名字"] = "寒冰射手礼包",
                    ["最小值"] = 0,
                    ["最大值"] = 0
                },
                ["动作"] = "必须"
            }
        }),
        ["每日重置免费次数"] = false,
        ["限时"] = false,
        ["获得物品"] = {
            ["寒冰射手"] = 1,
            ["阳光"] = 400000,
            ["金币"] = 8800,
            ["能量豆"] = 8
        },
        ["奖池"] = nil,
        ["图标复写"] = "sandboxId://textures/items/shop/寒冰射手礼包.png",
        ["图标数量复写"] = 1,
        ["热卖"] = false,
        ["限定"] = false
    }),
    ["小喷菇礼包"] = ShopGood.New({
        ["商品名"] = "小喷菇礼包",
        ["商品描述"] = "获取小喷菇主卡，40W阳光，8.8K金币，8能量豆助力养成，快速提升战斗力",
        ["价格"] = {
            ["varKey"] = "shop_小喷菇礼包",
            ["广告模式"] = "不可看广告",
            ["广告次数"] = 0,
            ["价格类型"] = "水晶",
            ["价格数量"] = 980
        },
        ["购买条件"] = Modifiers.New({
            {
                ["目标"] = "自己",
                ["条件类型"] = "VariableCondition",
                ["条件"] = {
                    ["名字"] = "新手礼包",
                    ["最小值"] = 0,
                    ["最大值"] = 0
                },
                ["动作"] = "必须"
            }
        }),
        ["每日重置免费次数"] = false,
        ["限时"] = false,
        ["获得物品"] = {
            ["小喷菇"] = 1,
            ["阳光"] = 400000,
            ["金币"] = 8800,
            ["能量豆"] = 8
        },
        ["奖池"] = nil,
        ["图标复写"] = "sandboxId://textures/items/shop/小喷菇礼包.png",
        ["图标数量复写"] = 1,
        ["热卖"] = false,
        ["限定"] = false
    }),
    ["新手大礼包"] = ShopGood.New({
        ["商品名"] = "新手大礼包",
        ["商品描述"] = "首次充值专属福利，快速获取实用SR副卡菜问，搭配3W阳光、1K金币与1能量豆，助力前期开荒",
        ["价格"] = {
            ["varKey"] = "shop_新手大礼包",
            ["广告模式"] = "不可看广告",
            ["广告次数"] = 0,
            ["价格类型"] = "水晶",
            ["价格数量"] = 60
        },
        ["购买条件"] = Modifiers.New({
            {
                ["目标"] = "自己",
                ["条件类型"] = "VariableCondition",
                ["条件"] = {
                    ["名字"] = "新手礼包",
                    ["最小值"] = 0,
                    ["最大值"] = 0
                },
                ["动作"] = "必须"
            }
        }),
        ["每日重置免费次数"] = false,
        ["限时"] = false,
        ["获得物品"] = {
            ["菜问"] = 1,
            ["阳光"] = 30000,
            ["金币"] = 1000,
            ["能量豆"] = 1
        },
        ["奖池"] = nil,
        ["图标复写"] = "sandboxId://textures/items/shop/首充礼包.png",
        ["图标数量复写"] = 0,
        ["热卖"] = true,
        ["限定"] = false
    }),
    ["新手进阶礼包"] = ShopGood.New({
        ["商品名"] = "新手进阶礼包",
        ["商品描述"] = "专为新手打造，可以再次获得菜问用于升星，并获得18W阳光、4.4金币、4能量豆",
        ["价格"] = {
            ["varKey"] = "shop_新手进阶礼包",
            ["广告模式"] = "不可看广告",
            ["广告次数"] = 0,
            ["价格类型"] = "水晶",
            ["价格数量"] = 680
        },
        ["购买条件"] = Modifiers.New({
            {
                ["目标"] = "自己",
                ["条件类型"] = "VariableCondition",
                ["条件"] = {
                    ["名字"] = "新手进阶礼包",
                    ["最小值"] = 0,
                    ["最大值"] = 0
                },
                ["动作"] = "必须"
            }
        }),
        ["每日重置免费次数"] = false,
        ["限时"] = false,
        ["获得物品"] = {
            ["菜问"] = 1,
            ["阳光"] = 180000,
            ["金币"] = 4400,
            ["能量豆"] = 4
        },
        ["奖池"] = nil,
        ["图标复写"] = "sandboxId://textures/items/shop/新手进阶礼包.png",
        ["图标数量复写"] = 1,
        ["热卖"] = true,
        ["限定"] = false
    }),
    ["每周副卡抽奖券"] = ShopGood.New({
        ["商品名"] = "每周副卡抽奖券",
        ["商品描述"] = "参与副卡抽奖，每周限购3次，有机会抽取稀有副卡",
        ["价格"] = {
            ["varKey"] = "shop_每周副卡抽奖券",
            ["广告模式"] = "不可看广告",
            ["广告次数"] = 0,
            ["价格类型"] = "水晶",
            ["价格数量"] = 488
        },
        ["购买条件"] = Modifiers.New({
            {
                ["目标"] = "自己",
                ["条件类型"] = "VariableCondition",
                ["条件"] = {
                    ["名字"] = "副卡抽奖券礼包周限",
                    ["最小值"] = 0,
                    ["最大值"] = 2
                },
                ["动作"] = "必须"
            }
        }),
        ["每日重置免费次数"] = false,
        ["限时"] = false,
        ["获得物品"] = {
            ["副卡抽奖券"] = 10
        },
        ["奖池"] = nil,
        ["图标复写"] = "sandboxId://textures/items/shop/普通抽奖券.png",
        ["图标数量复写"] = 10,
        ["热卖"] = false,
        ["限定"] = true
    }),
    ["每周限定抽奖券"] = ShopGood.New({
        ["商品名"] = "每周限定抽奖券",
        ["商品描述"] = "参与限定抽奖，每周限购3次，有机会抽取稀有副卡",
        ["价格"] = {
            ["varKey"] = "shop_每周限定抽奖券",
            ["广告模式"] = "不可看广告",
            ["广告次数"] = 0,
            ["价格类型"] = "水晶",
            ["价格数量"] = 488
        },
        ["购买条件"] = Modifiers.New({
            {
                ["目标"] = "自己",
                ["条件类型"] = "VariableCondition",
                ["条件"] = {
                    ["名字"] = "限定抽奖券礼包周限",
                    ["最小值"] = 0,
                    ["最大值"] = 2
                },
                ["动作"] = "必须"
            }
        }),
        ["每日重置免费次数"] = false,
        ["限时"] = false,
        ["获得物品"] = {
            ["限定抽奖券"] = 10
        },
        ["奖池"] = nil,
        ["图标复写"] = "sandboxId://textures/items/shop/限定抽奖券.png",
        ["图标数量复写"] = 10,
        ["热卖"] = false,
        ["限定"] = true
    }),
    ["每日副卡抽奖券"] = ShopGood.New({
        ["商品名"] = "每日副卡抽奖券",
        ["商品描述"] = "参与副卡抽奖，每日限购1次，观看广告即可获得",
        ["价格"] = {
            ["varKey"] = "daily_shop_每日副卡抽奖券",
            ["广告模式"] = "必须看广告",
            ["广告次数"] = 0,
            ["价格数量"] = 0
        },
        ["每日重置免费次数"] = true,
        ["限时"] = false,
        ["获得物品"] = {
            ["副卡抽奖券"] = 1
        },
        ["奖池"] = nil,
        ["图标复写"] = "sandboxId://textures/items/抽奖券.png",
        ["图标数量复写"] = 1,
        ["热卖"] = false,
        ["限定"] = false
    }),
    ["每月副卡抽奖券"] = ShopGood.New({
        ["商品名"] = "每月副卡抽奖券",
        ["商品描述"] = "参与副卡抽奖，每月限购3次，有机会抽取稀有副卡",
        ["价格"] = {
            ["varKey"] = "shop_每月副卡抽奖券",
            ["广告模式"] = "不可看广告",
            ["广告次数"] = 0,
            ["价格类型"] = "水晶",
            ["价格数量"] = 428
        },
        ["购买条件"] = Modifiers.New({
            {
                ["目标"] = "自己",
                ["条件类型"] = "VariableCondition",
                ["条件"] = {
                    ["名字"] = "副卡抽奖券礼包月限",
                    ["最小值"] = 0,
                    ["最大值"] = 2
                },
                ["动作"] = "必须"
            }
        }),
        ["每日重置免费次数"] = false,
        ["限时"] = false,
        ["获得物品"] = {
            ["副卡抽奖券"] = 10
        },
        ["奖池"] = nil,
        ["图标复写"] = "sandboxId://textures/items/shop/普通抽奖券.png",
        ["图标数量复写"] = 10,
        ["热卖"] = false,
        ["限定"] = true
    }),
    ["每月限定抽奖券"] = ShopGood.New({
        ["商品名"] = "每月限定抽奖券",
        ["商品描述"] = "参与限定抽奖，每月限购3次，有机会抽取稀有副卡",
        ["价格"] = {
            ["varKey"] = "shop_每月限定抽奖券",
            ["广告模式"] = "不可看广告",
            ["广告次数"] = 0,
            ["价格类型"] = "水晶",
            ["价格数量"] = 428
        },
        ["购买条件"] = Modifiers.New({
            {
                ["目标"] = "自己",
                ["条件类型"] = "VariableCondition",
                ["条件"] = {
                    ["名字"] = "限定抽奖券礼包月限",
                    ["最小值"] = 0,
                    ["最大值"] = 2
                },
                ["动作"] = "必须"
            }
        }),
        ["每日重置免费次数"] = false,
        ["限时"] = false,
        ["获得物品"] = {
            ["限定抽奖券"] = 10
        },
        ["奖池"] = nil,
        ["图标复写"] = "sandboxId://textures/items/shop/限定抽奖券.png",
        ["图标数量复写"] = 10,
        ["热卖"] = false,
        ["限定"] = true
    }),
    ["能量豆补给包"] = ShopGood.New({
        ["商品名"] = "能量豆补给包",
        ["商品描述"] = "补充能量豆资源，每周限量供应",
        ["价格"] = {
            ["varKey"] = "shop_能量豆补给包",
            ["广告模式"] = "不可看广告",
            ["广告次数"] = 0,
            ["价格类型"] = "水晶",
            ["价格数量"] = 300
        },
        ["购买条件"] = Modifiers.New({
            {
                ["目标"] = "自己",
                ["条件类型"] = "VariableCondition",
                ["条件"] = {
                    ["名字"] = "能量豆补给包",
                    ["最小值"] = 0,
                    ["最大值"] = 1
                },
                ["动作"] = "必须"
            }
        }),
        ["每日重置免费次数"] = false,
        ["限时"] = false,
        ["获得物品"] = {
            ["能量豆"] = 10
        },
        ["奖池"] = nil,
        ["图标复写"] = "sandboxId://textures/items/shop/能量豆.png",
        ["图标数量复写"] = 10,
        ["热卖"] = false,
        ["限定"] = true
    }),
    ["豌豆射手皮肤礼包"] = ShopGood.New({
        ["商品名"] = "豌豆射手皮肤礼包",
        ["商品描述"] = "参与副卡抽奖，有机会抽取稀有副卡",
        ["价格"] = {
            ["varKey"] = "shop_豌豆射手皮肤礼包",
            ["广告模式"] = "不可看广告",
            ["广告次数"] = 0,
            ["价格类型"] = "水晶",
            ["价格数量"] = 328
        },
        ["购买条件"] = Modifiers.New({
            {
                ["目标"] = "自己",
                ["条件类型"] = "VariableCondition",
                ["条件"] = {
                    ["名字"] = "豌豆射手皮肤礼包",
                    ["最小值"] = 0,
                    ["最大值"] = 0
                },
                ["动作"] = "必须"
            }
        }),
        ["每日重置免费次数"] = false,
        ["限时"] = false,
        ["获得物品"] = {
            ["副卡抽奖券"] = 10
        },
        ["奖池"] = nil,
        ["图标复写"] = "sandboxId://textures/plants/Tex_杨桃_BaseColor.png",
        ["图标数量复写"] = 0,
        ["热卖"] = false,
        ["限定"] = false
    }),
    ["限定抽奖券"] = ShopGood.New({
        ["商品名"] = "限定抽奖券",
        ["商品描述"] = "参与限定抽奖，有机会抽取稀有副卡",
        ["价格"] = {
            ["varKey"] = "shop_限定抽奖券",
            ["广告模式"] = "不可看广告",
            ["广告次数"] = 0,
            ["价格类型"] = "水晶",
            ["价格数量"] = 600
        },
        ["每日重置免费次数"] = false,
        ["限时"] = false,
        ["获得物品"] = {
            ["限定抽奖券"] = 10
        },
        ["奖池"] = nil,
        ["图标复写"] = "sandboxId://textures/items/shop/限定抽奖券.png",
        ["图标数量复写"] = 10,
        ["热卖"] = false,
        ["限定"] = false
    }),
    ["挂机加速卡"] = ShopGood.New({
        ["商品名"] = "挂机加速卡",
        ["商品描述"] = "黑夜变白天，白天变黑夜",
        ["价格"] = {
            ["varKey"] = "shop_挂机加速卡",
            ["广告模式"] = "不可看广告",
            ["广告次数"] = 0,
            ["价格类型"] = "水晶",
            ["价格数量"] = 521
        },
        ["每日重置免费次数"] = false,
        ["限时"] = false,
        ["获得物品"] = {
            ["樱桃炸弹碎片"] = 10
        },
        ["奖池"] = nil,
        ["图标数量复写"] = 0,
        ["热卖"] = false,
        ["限定"] = false
    }),
    ["昼夜加速卡"] = ShopGood.New({
        ["商品名"] = "昼夜加速卡",
        ["商品描述"] = "黑夜变白天，白天变黑夜",
        ["价格"] = {
            ["varKey"] = "shop_昼夜加速卡",
            ["广告模式"] = "不可看广告",
            ["广告次数"] = 0,
            ["价格类型"] = "水晶",
            ["价格数量"] = 637
        },
        ["每日重置免费次数"] = false,
        ["限时"] = false,
        ["获得物品"] = {
            ["仙人掌碎片"] = 10
        },
        ["奖池"] = nil,
        ["图标数量复写"] = 0,
        ["热卖"] = false,
        ["限定"] = false
    }),
    ["阳光加速包"] = ShopGood.New({
        ["商品名"] = "阳光加速包",
        ["商品描述"] = "获得8小时阳光",
        ["价格"] = {
            ["varKey"] = "shop_阳光加速包",
            ["广告模式"] = "不可看广告",
            ["广告次数"] = 0,
            ["价格类型"] = "水晶",
            ["价格数量"] = 100
        },
        ["购买条件"] = Modifiers.New({
            {
                ["目标"] = "自己",
                ["条件类型"] = "VariableCondition",
                ["条件"] = {
                    ["名字"] = "阳光加速包",
                    ["最小值"] = 0,
                    ["最大值"] = 2
                },
                ["动作"] = "必须"
            }
        }),
        ["每日重置免费次数"] = false,
        ["限时"] = false,
        ["获得物品"] = {
            ["阳光加速包"] = 1
        },
        ["奖池"] = nil,
        ["图标复写"] = "sandboxId://textures/items/shop/阳光.png",
        ["图标数量复写"] = 1,
        ["热卖"] = false,
        ["限定"] = true
    }),
    ["基金卡"] = ShopGood.New({
        ["商品名"] = "基金卡",
        ["商品描述"] = [[◆每日领取 1万阳光
◆每日领取 1千金币
◆每日领取 昼夜加速卡
◆每日挂机增益延长 ]],
        ["价格"] = {
            ["varKey"] = "shop_基金卡",
            ["广告模式"] = "不可看广告",
            ["广告次数"] = 0,
            ["价格类型"] = "水晶",
            ["价格数量"] = 3000
        },
        ["每日重置免费次数"] = false,
        ["限时"] = false,
        ["获得物品"] = {
            ["仙人掌"] = 20,
            ["地刺碎片"] = 80,
            ["星星果"] = 100
        },
        ["执行指令"] = {
            [[var {"变量名":"基金卡","值":"30"} ]],
            [[title {"信息":"已成功购买了30天基金卡！"} ]]
        },
        ["奖池"] = nil,
        ["图标复写"] = nil,
        ["图标数量复写"] = 0,
        ["热卖"] = false,
        ["限定"] = false
    }),
    ["特权卡"] = ShopGood.New({
        ["商品名"] = "特权卡",
        ["商品描述"] = [[◆每日领取 1万阳光
◆每日领取 1千金币
◆每日领取 昼夜加速卡
◆每日挂机增益延长 ]],
        ["价格"] = {
            ["varKey"] = "shop_特权卡",
            ["广告模式"] = "不可看广告",
            ["广告次数"] = 0,
            ["价格类型"] = "水晶",
            ["价格数量"] = 3000
        },
        ["每日重置免费次数"] = false,
        ["限时"] = false,
        ["获得物品"] = {
            ["仙人掌"] = 20,
            ["地刺碎片"] = 80,
            ["星星果"] = 100
        },
        ["执行指令"] = {
            [[var {"变量名":"特权卡","值":"30"} ]],
            [[title {"信息":"已成功购买了30天基金卡！"} ]]
        },
        ["奖池"] = nil,
        ["图标复写"] = nil,
        ["图标数量复写"] = 0,
        ["热卖"] = false,
        ["限定"] = false
    })
}loaded = true
end

---@param ShopGoodName string
---@return ShopGood
function ShopGoodConfig.Get(ShopGoodName)
    if not loaded then
        LoadConfig()
    end
    return ShopGoodConfig.config[ShopGoodName]
end

---@return ShopGood[]
function ShopGoodConfig.GetAll()
    if not loaded then
        LoadConfig()
    end
    return ShopGoodConfig.config
end
return ShopGoodConfig
