local MainStorage = game:GetService('MainStorage')
local gg                = require(MainStorage.code.common.MGlobal)    ---@type gg
local Spell = require(MainStorage.code.server.spells.Spell) ---@type Spell
local Modifiers = require(MainStorage.code.common.config_type.modifier.Modifiers) ---@type Modifiers

--- 魔法配置文件
---@class SpellConfig
local SpellConfig = {}
local loaded = false

local function LoadConfig()
    SpellConfig.config ={
    ["三头豌豆-伤害"] = Spell.Load({
        ["类型"] = "PainSpell",
        ["基础伤害"] = 0,
        ["基础倍率"] = 1,
        ["元素类型"] = "无",
        ["属性增伤"] = {
            {
                ["属性类型"] = "攻击",
                ["倍率"] = 1.8,
                ["增加类型"] = "增加",
                ["乘以基础数值"] = false
            }
        },
        ["魔法名"] = "三头豌豆-伤害",
        ["打印信息"] = false,
        ["显示在指令选单中"] = true,
        ["冷却"] = 0,
        ["各目标冷却"] = 0,
        ["各目标冷却倍率"] = 0,
        ["基础威力"] = 1,
        ["释放给自己"] = false,
        ["延迟"] = 0,
        ["宽度倍率"] = 1,
        ["高度倍率"] = 1,
        ["尺寸倍率"] = 1,
        ["必须要目标"] = true
    }),
    ["三头豌豆-额外伤害"] = Spell.Load({
        ["类型"] = "PainSpell",
        ["基础伤害"] = 0,
        ["基础倍率"] = 1,
        ["元素类型"] = "无",
        ["属性增伤"] = {
            {
                ["属性类型"] = "攻击",
                ["倍率"] = 2.7,
                ["增加类型"] = "增加",
                ["乘以基础数值"] = false
            }
        },
        ["魔法名"] = "三头豌豆-额外伤害",
        ["打印信息"] = false,
        ["显示在指令选单中"] = true,
        ["冷却"] = 0,
        ["各目标冷却"] = 0,
        ["各目标冷却倍率"] = 0,
        ["基础威力"] = 1,
        ["释放给自己"] = false,
        ["延迟"] = 0,
        ["释放条件"] = Modifiers.New({
            {
                ["目标"] = "自己",
                ["条件类型"] = "ChanceCondition",
                ["条件"] = {
                    ["最小值"] = 50
                },
                ["动作"] = "必须"
            }
        }),
        ["宽度倍率"] = 1,
        ["高度倍率"] = 1,
        ["尺寸倍率"] = 1,
        ["必须要目标"] = true
    }),
    ["三头豌豆_入口"] = Spell.Load({
        ["类型"] = "ProjectileSpell",
        ["飞弹模型"] = "豌豆",
        ["持续时间"] = 5,
        ["寻找目标"] = false,
        ["生成于自己位置"] = true,
        ["散射次数"] = 3,
        ["散射角度"] = 3,
        ["散射延迟"] = 0,
        ["初始角度修改"] = {
            0,
            0
        },
        ["速度"] = 5000,
        ["重力"] = 0,
        ["追踪目标速度"] = 0,
        ["穿过地形"] = false,
        ["可重复碰撞同一目标"] = false,
        ["对同一目标生效间隔"] = -1,
        ["生效次数"] = 3,
        ["魔法名"] = "三头豌豆_入口",
        ["打印信息"] = false,
        ["显示在指令选单中"] = true,
        ["冷却"] = 0.3,
        ["各目标冷却"] = 0,
        ["各目标冷却倍率"] = 0,
        ["基础威力"] = 1,
        ["释放给自己"] = false,
        ["延迟"] = 0,
        ["子魔法"] = {
            {
                ["魔法"] = "三头豌豆-伤害"
            },
            {
                ["魔法"] = "三头豌豆-额外伤害"
            }
        },
        ["特效_前摇"] = {
            {
                ["_type"] = "CameraShakeGraphic",
                ["频率"] = 0.05,
                ["强度"] = 1,
                ["旋转"] = {
                    0,
                    0,
                    0
                },
                ["位移"] = {
                    0,
                    1,
                    0
                },
                ["循环"] = false,
                ["目标"] = "自己",
                ["目标场景名"] = "",
                ["延迟"] = 0,
                ["持续时间"] = 0,
                ["重复次数"] = 1,
                ["重复延迟"] = 0
            }
        },
        ["宽度倍率"] = 1,
        ["高度倍率"] = 1,
        ["尺寸倍率"] = 1,
        ["必须要目标"] = false
    }),
    ["双发豌豆-伤害"] = Spell.Load({
        ["类型"] = "PainSpell",
        ["基础伤害"] = 0,
        ["基础倍率"] = 1,
        ["元素类型"] = "无",
        ["属性增伤"] = {
            {
                ["属性类型"] = "攻击",
                ["倍率"] = 1.2,
                ["增加类型"] = "增加",
                ["乘以基础数值"] = false
            }
        },
        ["魔法名"] = "双发豌豆-伤害",
        ["打印信息"] = false,
        ["显示在指令选单中"] = true,
        ["冷却"] = 0,
        ["各目标冷却"] = 0,
        ["各目标冷却倍率"] = 0,
        ["基础威力"] = 1,
        ["释放给自己"] = false,
        ["延迟"] = 0,
        ["宽度倍率"] = 1,
        ["高度倍率"] = 1,
        ["尺寸倍率"] = 1,
        ["必须要目标"] = true
    }),
    ["双发豌豆_入口"] = Spell.Load({
        ["类型"] = "ProjectileSpell",
        ["飞弹模型"] = "豌豆",
        ["持续时间"] = 5,
        ["寻找目标"] = false,
        ["生成于自己位置"] = true,
        ["散射次数"] = 2,
        ["散射角度"] = 0,
        ["散射延迟"] = 0.2,
        ["初始角度修改"] = {
            0,
            0
        },
        ["速度"] = 5000,
        ["重力"] = 0,
        ["追踪目标速度"] = 0,
        ["穿过地形"] = false,
        ["可重复碰撞同一目标"] = false,
        ["对同一目标生效间隔"] = -1,
        ["生效次数"] = 1,
        ["魔法名"] = "双发豌豆_入口",
        ["打印信息"] = false,
        ["显示在指令选单中"] = true,
        ["冷却"] = 0.3,
        ["各目标冷却"] = 0,
        ["各目标冷却倍率"] = 0,
        ["基础威力"] = 1,
        ["释放给自己"] = false,
        ["延迟"] = 0,
        ["子魔法"] = {
            {
                ["魔法"] = "双发豌豆-伤害"
            }
        },
        ["特效_前摇"] = {
            {
                ["_type"] = "CameraShakeGraphic",
                ["频率"] = 0.05,
                ["强度"] = 1,
                ["旋转"] = {
                    0,
                    0,
                    0
                },
                ["位移"] = {
                    0,
                    1,
                    0
                },
                ["循环"] = false,
                ["目标"] = "自己",
                ["目标场景名"] = "",
                ["延迟"] = 0,
                ["持续时间"] = 0,
                ["重复次数"] = 1,
                ["重复延迟"] = 0
            }
        },
        ["宽度倍率"] = 1,
        ["高度倍率"] = 1,
        ["尺寸倍率"] = 1,
        ["必须要目标"] = false
    }),
    ["寒冰加特林-伤害"] = Spell.Load({
        ["类型"] = "PainSpell",
        ["基础伤害"] = 0,
        ["基础倍率"] = 1,
        ["元素类型"] = "无",
        ["属性增伤"] = {
            {
                ["属性类型"] = "攻击",
                ["倍率"] = 1.9,
                ["增加类型"] = "增加",
                ["乘以基础数值"] = false
            }
        },
        ["魔法名"] = "寒冰加特林-伤害",
        ["打印信息"] = false,
        ["显示在指令选单中"] = true,
        ["冷却"] = 0,
        ["各目标冷却"] = 0,
        ["各目标冷却倍率"] = 0,
        ["基础威力"] = 1,
        ["释放给自己"] = false,
        ["延迟"] = 0,
        ["宽度倍率"] = 1,
        ["高度倍率"] = 1,
        ["尺寸倍率"] = 1,
        ["必须要目标"] = true
    }),
    ["寒冰加特林_dot"] = Spell.Load({
        ["类型"] = "DOTBuff",
        ["基础伤害"] = 0,
        ["基础倍率"] = 1,
        ["属性增伤"] = {
            {
                ["属性类型"] = "攻击",
                ["倍率"] = 0.5,
                ["增加类型"] = "增加",
                ["乘以基础数值"] = false
            }
        },
        ["脉冲时间"] = 0,
        ["持续时间"] = 0,
        ["持续时间独立计算"] = false,
        ["重复释放刷新时间"] = true,
        ["生效次数"] = 0,
        ["最大层数"] = 0,
        ["无需更新"] = false,
        ["魔法名"] = "寒冰加特林_dot",
        ["打印信息"] = false,
        ["显示在指令选单中"] = true,
        ["冷却"] = 0,
        ["各目标冷却"] = 0,
        ["各目标冷却倍率"] = 0,
        ["基础威力"] = 1,
        ["释放给自己"] = false,
        ["延迟"] = 0,
        ["宽度倍率"] = 1,
        ["高度倍率"] = 1,
        ["尺寸倍率"] = 1,
        ["必须要目标"] = true
    }),
    ["寒冰加特林_入口"] = Spell.Load({
        ["类型"] = "ProjectileSpell",
        ["飞弹模型"] = "冰豌豆",
        ["持续时间"] = 5,
        ["寻找目标"] = false,
        ["生成于自己位置"] = true,
        ["散射次数"] = 2,
        ["散射角度"] = 0,
        ["散射延迟"] = 0.2,
        ["初始角度修改"] = {
            0,
            0
        },
        ["速度"] = 5000,
        ["重力"] = 0,
        ["追踪目标速度"] = 0,
        ["穿过地形"] = false,
        ["可重复碰撞同一目标"] = false,
        ["对同一目标生效间隔"] = -1,
        ["生效次数"] = 2,
        ["魔法名"] = "寒冰加特林_入口",
        ["打印信息"] = false,
        ["显示在指令选单中"] = true,
        ["冷却"] = 0.3,
        ["各目标冷却"] = 0,
        ["各目标冷却倍率"] = 0,
        ["基础威力"] = 1,
        ["释放给自己"] = false,
        ["延迟"] = 0,
        ["子魔法"] = {
            {
                ["魔法"] = "寒冰加特林-伤害"
            },
            {
                ["魔法"] = "寒冰加特林_dot"
            },
            {
                ["魔法"] = "减速BUFF"
            }
        },
        ["特效_前摇"] = {
            {
                ["_type"] = "CameraShakeGraphic",
                ["频率"] = 0.05,
                ["强度"] = 1,
                ["旋转"] = {
                    0,
                    0,
                    0
                },
                ["位移"] = {
                    0,
                    1,
                    0
                },
                ["循环"] = false,
                ["目标"] = "自己",
                ["目标场景名"] = "",
                ["延迟"] = 0,
                ["持续时间"] = 0,
                ["重复次数"] = 1,
                ["重复延迟"] = 0
            }
        },
        ["特效_释放"] = {
            {
                ["_type"] = "ParticleGraphic",
                ["特效对象"] = "绿色爆炸",
                ["特效资产"] = "",
                ["绑定实体"] = false,
                ["绑定挂点"] = "",
                ["偏移"] = {
                    0,
                    0,
                    0
                },
                ["目标"] = "目标",
                ["目标场景名"] = "",
                ["延迟"] = 0,
                ["持续时间"] = 1,
                ["重复次数"] = 1,
                ["重复延迟"] = 0
            }
        },
        ["宽度倍率"] = 1,
        ["高度倍率"] = 1,
        ["尺寸倍率"] = 1,
        ["必须要目标"] = false
    }),
    ["寒冰射手-伤害"] = Spell.Load({
        ["类型"] = "PainSpell",
        ["基础伤害"] = 0,
        ["基础倍率"] = 1,
        ["元素类型"] = "无",
        ["属性增伤"] = {
            {
                ["属性类型"] = "攻击",
                ["倍率"] = 1.7,
                ["增加类型"] = "增加",
                ["乘以基础数值"] = false
            }
        },
        ["魔法名"] = "寒冰射手-伤害",
        ["打印信息"] = false,
        ["显示在指令选单中"] = true,
        ["冷却"] = 0,
        ["各目标冷却"] = 0,
        ["各目标冷却倍率"] = 0,
        ["基础威力"] = 1,
        ["释放给自己"] = false,
        ["延迟"] = 0,
        ["宽度倍率"] = 1,
        ["高度倍率"] = 1,
        ["尺寸倍率"] = 1,
        ["必须要目标"] = true
    }),
    ["寒冰射手_入口"] = Spell.Load({
        ["类型"] = "ProjectileSpell",
        ["飞弹模型"] = "冰豌豆",
        ["持续时间"] = 5,
        ["寻找目标"] = false,
        ["生成于自己位置"] = true,
        ["散射次数"] = 2,
        ["散射角度"] = 0,
        ["散射延迟"] = 0.25,
        ["初始角度修改"] = {
            0,
            0
        },
        ["速度"] = 5000,
        ["重力"] = 0,
        ["追踪目标速度"] = 0,
        ["穿过地形"] = false,
        ["可重复碰撞同一目标"] = false,
        ["对同一目标生效间隔"] = -1,
        ["生效次数"] = 1,
        ["魔法名"] = "寒冰射手_入口",
        ["打印信息"] = false,
        ["显示在指令选单中"] = true,
        ["冷却"] = 0.3,
        ["各目标冷却"] = 0,
        ["各目标冷却倍率"] = 0,
        ["基础威力"] = 1,
        ["释放给自己"] = false,
        ["延迟"] = 0,
        ["子魔法"] = {
            {
                ["魔法"] = "寒冰射手-伤害"
            },
            {
                ["魔法"] = "减速BUFF"
            }
        },
        ["特效_前摇"] = {
            {
                ["_type"] = "CameraShakeGraphic",
                ["频率"] = 0.05,
                ["强度"] = 1,
                ["旋转"] = {
                    0,
                    0,
                    0
                },
                ["位移"] = {
                    0,
                    1,
                    0
                },
                ["循环"] = false,
                ["目标"] = "自己",
                ["目标场景名"] = "",
                ["延迟"] = 0,
                ["持续时间"] = 0,
                ["重复次数"] = 1,
                ["重复延迟"] = 0
            }
        },
        ["宽度倍率"] = 1,
        ["高度倍率"] = 1,
        ["尺寸倍率"] = 1,
        ["必须要目标"] = false
    }),
    ["火焰豌豆-伤害"] = Spell.Load({
        ["类型"] = "PainSpell",
        ["基础伤害"] = 0,
        ["基础倍率"] = 1,
        ["元素类型"] = "无",
        ["属性增伤"] = {
            {
                ["属性类型"] = "攻击",
                ["倍率"] = 2.1,
                ["增加类型"] = "增加",
                ["乘以基础数值"] = false
            }
        },
        ["魔法名"] = "火焰豌豆-伤害",
        ["打印信息"] = false,
        ["显示在指令选单中"] = true,
        ["冷却"] = 0,
        ["各目标冷却"] = 0,
        ["各目标冷却倍率"] = 0,
        ["基础威力"] = 1,
        ["释放给自己"] = false,
        ["延迟"] = 0,
        ["宽度倍率"] = 1,
        ["高度倍率"] = 1,
        ["尺寸倍率"] = 1,
        ["必须要目标"] = true
    }),
    ["火焰豌豆_dot"] = Spell.Load({
        ["类型"] = "DOTBuff",
        ["基础伤害"] = 0,
        ["基础倍率"] = 1,
        ["属性增伤"] = {
            {
                ["属性类型"] = "攻击",
                ["倍率"] = 1,
                ["增加类型"] = "增加",
                ["乘以基础数值"] = false
            }
        },
        ["脉冲时间"] = 0,
        ["持续时间"] = 0,
        ["持续时间独立计算"] = false,
        ["重复释放刷新时间"] = true,
        ["生效次数"] = 0,
        ["最大层数"] = 0,
        ["无需更新"] = false,
        ["魔法名"] = "火焰豌豆_dot",
        ["打印信息"] = false,
        ["显示在指令选单中"] = true,
        ["冷却"] = 0,
        ["各目标冷却"] = 0,
        ["各目标冷却倍率"] = 0,
        ["基础威力"] = 1,
        ["释放给自己"] = false,
        ["延迟"] = 0,
        ["宽度倍率"] = 1,
        ["高度倍率"] = 1,
        ["尺寸倍率"] = 1,
        ["必须要目标"] = true
    }),
    ["火焰豌豆_入口"] = Spell.Load({
        ["类型"] = "ProjectileSpell",
        ["飞弹模型"] = "豌豆",
        ["持续时间"] = 5,
        ["寻找目标"] = false,
        ["生成于自己位置"] = true,
        ["散射次数"] = 2,
        ["散射角度"] = 0,
        ["散射延迟"] = 0.2,
        ["初始角度修改"] = {
            0,
            0
        },
        ["速度"] = 5000,
        ["重力"] = 0,
        ["追踪目标速度"] = 0,
        ["穿过地形"] = false,
        ["可重复碰撞同一目标"] = false,
        ["对同一目标生效间隔"] = -1,
        ["生效次数"] = 2,
        ["魔法名"] = "火焰豌豆_入口",
        ["打印信息"] = false,
        ["显示在指令选单中"] = true,
        ["冷却"] = 0.3,
        ["各目标冷却"] = 0,
        ["各目标冷却倍率"] = 0,
        ["基础威力"] = 1,
        ["释放给自己"] = false,
        ["延迟"] = 0,
        ["子魔法"] = {
            {
                ["魔法"] = "火焰豌豆_范围"
            }
        },
        ["特效_前摇"] = {
            {
                ["_type"] = "CameraShakeGraphic",
                ["频率"] = 0.05,
                ["强度"] = 1,
                ["旋转"] = {
                    0,
                    0,
                    0
                },
                ["位移"] = {
                    0,
                    1,
                    0
                },
                ["循环"] = false,
                ["目标"] = "自己",
                ["目标场景名"] = "",
                ["延迟"] = 0,
                ["持续时间"] = 0,
                ["重复次数"] = 1,
                ["重复延迟"] = 0
            }
        },
        ["宽度倍率"] = 1,
        ["高度倍率"] = 1,
        ["尺寸倍率"] = 1,
        ["必须要目标"] = false
    }),
    ["火焰豌豆_范围"] = Spell.Load({
        ["类型"] = "AOESpell",
        ["持续时间"] = 0,
        ["范围形状"] = "圆形",
        ["圆形半径"] = 300,
        ["偏移"] = {
            0,
            0,
            0
        },
        ["魔法名"] = "火焰豌豆_范围",
        ["打印信息"] = false,
        ["显示在指令选单中"] = true,
        ["冷却"] = 0,
        ["各目标冷却"] = 0,
        ["各目标冷却倍率"] = 0,
        ["基础威力"] = 1,
        ["释放给自己"] = false,
        ["延迟"] = 0,
        ["子魔法"] = {
            {
                ["魔法"] = "火焰豌豆-伤害"
            },
            {
                ["魔法"] = "火焰豌豆_dot"
            }
        },
        ["宽度倍率"] = 1,
        ["高度倍率"] = 1,
        ["尺寸倍率"] = 1,
        ["必须要目标"] = true
    }),
    ["豌豆射手-伤害"] = Spell.Load({
        ["类型"] = "PainSpell",
        ["基础伤害"] = 0,
        ["基础倍率"] = 1,
        ["元素类型"] = "无",
        ["属性增伤"] = {
            {
                ["属性类型"] = "攻击",
                ["倍率"] = 1,
                ["增加类型"] = "增加",
                ["乘以基础数值"] = false
            }
        },
        ["魔法名"] = "豌豆射手-伤害",
        ["打印信息"] = false,
        ["显示在指令选单中"] = true,
        ["冷却"] = 0,
        ["各目标冷却"] = 0,
        ["各目标冷却倍率"] = 0,
        ["基础威力"] = 1,
        ["释放给自己"] = false,
        ["延迟"] = 0,
        ["宽度倍率"] = 1,
        ["高度倍率"] = 1,
        ["尺寸倍率"] = 1,
        ["必须要目标"] = true
    }),
    ["豌豆射手_入口"] = Spell.Load({
        ["类型"] = "ProjectileSpell",
        ["飞弹模型"] = "豌豆",
        ["持续时间"] = 5,
        ["寻找目标"] = false,
        ["生成于自己位置"] = true,
        ["散射次数"] = 1,
        ["散射角度"] = 0,
        ["散射延迟"] = 0,
        ["初始角度修改"] = {
            0,
            0
        },
        ["速度"] = 5000,
        ["重力"] = 0,
        ["追踪目标速度"] = 0,
        ["穿过地形"] = false,
        ["可重复碰撞同一目标"] = false,
        ["对同一目标生效间隔"] = -1,
        ["生效次数"] = 1,
        ["魔法名"] = "豌豆射手_入口",
        ["打印信息"] = false,
        ["显示在指令选单中"] = true,
        ["冷却"] = 0.3,
        ["各目标冷却"] = 0,
        ["各目标冷却倍率"] = 0,
        ["基础威力"] = 1,
        ["释放给自己"] = false,
        ["延迟"] = 0,
        ["子魔法"] = {
            {
                ["魔法"] = "豌豆射手-伤害"
            }
        },
        ["特效_前摇"] = {
            {
                ["_type"] = "CameraShakeGraphic",
                ["频率"] = 0.05,
                ["强度"] = 1,
                ["旋转"] = {
                    0,
                    0,
                    0
                },
                ["位移"] = {
                    0,
                    1,
                    0
                },
                ["循环"] = false,
                ["目标"] = "自己",
                ["目标场景名"] = "",
                ["延迟"] = 0,
                ["持续时间"] = 0,
                ["重复次数"] = 1,
                ["重复延迟"] = 0
            }
        },
        ["宽度倍率"] = 1,
        ["高度倍率"] = 1,
        ["尺寸倍率"] = 1,
        ["必须要目标"] = false
    }),
    ["高速加特林-伤害"] = Spell.Load({
        ["类型"] = "PainSpell",
        ["基础伤害"] = 0,
        ["基础倍率"] = 1,
        ["元素类型"] = "无",
        ["属性增伤"] = {
            {
                ["属性类型"] = "攻击",
                ["倍率"] = 1.7,
                ["增加类型"] = "增加",
                ["乘以基础数值"] = false
            }
        },
        ["魔法名"] = "高速加特林-伤害",
        ["打印信息"] = false,
        ["显示在指令选单中"] = true,
        ["冷却"] = 0,
        ["各目标冷却"] = 0,
        ["各目标冷却倍率"] = 0,
        ["基础威力"] = 1,
        ["释放给自己"] = false,
        ["延迟"] = 0,
        ["宽度倍率"] = 1,
        ["高度倍率"] = 1,
        ["尺寸倍率"] = 1,
        ["必须要目标"] = true
    }),
    ["高速加特林-额外伤害"] = Spell.Load({
        ["类型"] = "PainSpell",
        ["基础伤害"] = 0,
        ["基础倍率"] = 1,
        ["元素类型"] = "无",
        ["属性增伤"] = {
            {
                ["属性类型"] = "攻击",
                ["倍率"] = 2.5,
                ["增加类型"] = "增加",
                ["乘以基础数值"] = false
            }
        },
        ["魔法名"] = "高速加特林-额外伤害",
        ["打印信息"] = false,
        ["显示在指令选单中"] = true,
        ["冷却"] = 0,
        ["各目标冷却"] = 0,
        ["各目标冷却倍率"] = 0,
        ["基础威力"] = 1,
        ["释放给自己"] = false,
        ["延迟"] = 0,
        ["释放条件"] = Modifiers.New({
            {
                ["目标"] = "自己",
                ["条件类型"] = "ChanceCondition",
                ["条件"] = {
                    ["最小值"] = 30
                },
                ["动作"] = "必须"
            }
        }),
        ["宽度倍率"] = 1,
        ["高度倍率"] = 1,
        ["尺寸倍率"] = 1,
        ["必须要目标"] = true
    }),
    ["高速加特林_入口"] = Spell.Load({
        ["类型"] = "ProjectileSpell",
        ["飞弹模型"] = "豌豆",
        ["持续时间"] = 5,
        ["寻找目标"] = false,
        ["生成于自己位置"] = true,
        ["散射次数"] = 2,
        ["散射角度"] = 0,
        ["散射延迟"] = 0.15,
        ["初始角度修改"] = {
            0,
            0
        },
        ["速度"] = 5000,
        ["重力"] = 0,
        ["追踪目标速度"] = 0,
        ["穿过地形"] = false,
        ["可重复碰撞同一目标"] = false,
        ["对同一目标生效间隔"] = -1,
        ["生效次数"] = 2,
        ["魔法名"] = "高速加特林_入口",
        ["打印信息"] = false,
        ["显示在指令选单中"] = true,
        ["冷却"] = 0.3,
        ["各目标冷却"] = 0,
        ["各目标冷却倍率"] = 0,
        ["基础威力"] = 1,
        ["释放给自己"] = false,
        ["延迟"] = 0,
        ["子魔法"] = {
            {
                ["魔法"] = "高速加特林-伤害"
            },
            {
                ["魔法"] = "高速加特林-额外伤害"
            }
        },
        ["特效_前摇"] = {
            {
                ["_type"] = "CameraShakeGraphic",
                ["频率"] = 0.05,
                ["强度"] = 1,
                ["旋转"] = {
                    0,
                    0,
                    0
                },
                ["位移"] = {
                    0,
                    1,
                    0
                },
                ["循环"] = false,
                ["目标"] = "自己",
                ["目标场景名"] = "",
                ["延迟"] = 0,
                ["持续时间"] = 0,
                ["重复次数"] = 1,
                ["重复延迟"] = 0
            }
        },
        ["宽度倍率"] = 1,
        ["高度倍率"] = 1,
        ["尺寸倍率"] = 1,
        ["必须要目标"] = false
    }),
    ["高速射手-伤害"] = Spell.Load({
        ["类型"] = "PainSpell",
        ["基础伤害"] = 0,
        ["基础倍率"] = 1,
        ["元素类型"] = "无",
        ["属性增伤"] = {
            {
                ["属性类型"] = "攻击",
                ["倍率"] = 1.5,
                ["增加类型"] = "增加",
                ["乘以基础数值"] = false
            }
        },
        ["魔法名"] = "高速射手-伤害",
        ["打印信息"] = false,
        ["显示在指令选单中"] = true,
        ["冷却"] = 0,
        ["各目标冷却"] = 0,
        ["各目标冷却倍率"] = 0,
        ["基础威力"] = 1,
        ["释放给自己"] = false,
        ["延迟"] = 0,
        ["宽度倍率"] = 1,
        ["高度倍率"] = 1,
        ["尺寸倍率"] = 1,
        ["必须要目标"] = true
    }),
    ["高速射手_入口"] = Spell.Load({
        ["类型"] = "ProjectileSpell",
        ["飞弹模型"] = "豌豆",
        ["持续时间"] = 5,
        ["寻找目标"] = false,
        ["生成于自己位置"] = true,
        ["散射次数"] = 2,
        ["散射角度"] = 0,
        ["散射延迟"] = 0,
        ["初始角度修改"] = {
            0,
            0
        },
        ["速度"] = 5000,
        ["重力"] = 0,
        ["追踪目标速度"] = 0,
        ["穿过地形"] = false,
        ["可重复碰撞同一目标"] = false,
        ["对同一目标生效间隔"] = -1,
        ["生效次数"] = 2,
        ["魔法名"] = "高速射手_入口",
        ["打印信息"] = false,
        ["显示在指令选单中"] = true,
        ["冷却"] = 0.3,
        ["各目标冷却"] = 0,
        ["各目标冷却倍率"] = 0,
        ["基础威力"] = 1,
        ["释放给自己"] = false,
        ["延迟"] = 0,
        ["子魔法"] = {
            {
                ["魔法"] = "高速射手-伤害"
            }
        },
        ["特效_前摇"] = {
            {
                ["_type"] = "CameraShakeGraphic",
                ["频率"] = 0.05,
                ["强度"] = 1,
                ["旋转"] = {
                    0,
                    0,
                    0
                },
                ["位移"] = {
                    0,
                    1,
                    0
                },
                ["循环"] = false,
                ["目标"] = "自己",
                ["目标场景名"] = "",
                ["延迟"] = 0,
                ["持续时间"] = 0,
                ["重复次数"] = 1,
                ["重复延迟"] = 0
            }
        },
        ["宽度倍率"] = 1,
        ["高度倍率"] = 1,
        ["尺寸倍率"] = 1,
        ["必须要目标"] = false
    }),
    ["副_仙人掌_伤害"] = Spell.Load({
        ["类型"] = "PainSpell",
        ["基础伤害"] = 80,
        ["基础倍率"] = 1,
        ["元素类型"] = "无",
        ["魔法名"] = "副_仙人掌_伤害",
        ["打印信息"] = false,
        ["显示在指令选单中"] = true,
        ["冷却"] = 0,
        ["各目标冷却"] = 0,
        ["各目标冷却倍率"] = 0,
        ["基础威力"] = 1,
        ["释放给自己"] = false,
        ["延迟"] = 0,
        ["宽度倍率"] = 1,
        ["高度倍率"] = 1,
        ["尺寸倍率"] = 1,
        ["必须要目标"] = true
    }),
    ["副_仙人掌_入口"] = Spell.Load({
        ["类型"] = "ProjectileSpell",
        ["飞弹模型"] = "仙人掌刺",
        ["持续时间"] = -1,
        ["寻找目标"] = false,
        ["生成于自己位置"] = false,
        ["散射次数"] = 1,
        ["散射角度"] = 0,
        ["散射延迟"] = 0,
        ["初始角度修改"] = {
            0,
            0
        },
        ["速度"] = 2000,
        ["重力"] = 0,
        ["追踪目标速度"] = 0,
        ["穿过地形"] = false,
        ["结束子魔法"] = {
            {
                ["魔法"] = "副_仙人掌_伤害"
            }
        },
        ["可重复碰撞同一目标"] = false,
        ["对同一目标生效间隔"] = -1,
        ["生效次数"] = 3,
        ["魔法名"] = "副_仙人掌_入口",
        ["打印信息"] = false,
        ["显示在指令选单中"] = true,
        ["冷却"] = 0,
        ["各目标冷却"] = 0,
        ["各目标冷却倍率"] = 0,
        ["基础威力"] = 1,
        ["释放给自己"] = false,
        ["延迟"] = 0,
        ["宽度倍率"] = 1,
        ["高度倍率"] = 1,
        ["尺寸倍率"] = 1,
        ["必须要目标"] = false
    }),
    ["副_召唤_仙人掌"] = Spell.Load({
        ["类型"] = "SummonSpell",
        ["召唤在目标位置"] = false,
        ["怪物类型"] = "副-召唤物-仙人掌",
        ["最大数量"] = 1,
        ["召唤范围"] = 100,
        ["持续时间"] = 0,
        ["继承等级"] = false,
        ["魔法名"] = "副_召唤_仙人掌",
        ["打印信息"] = false,
        ["显示在指令选单中"] = true,
        ["冷却"] = 40,
        ["各目标冷却"] = 0,
        ["各目标冷却倍率"] = 0,
        ["基础威力"] = 1,
        ["释放给自己"] = true,
        ["延迟"] = 0,
        ["宽度倍率"] = 1,
        ["高度倍率"] = 1,
        ["尺寸倍率"] = 1,
        ["必须要目标"] = true
    }),
    ["地刺_dot"] = Spell.Load({
        ["类型"] = "DOTBuff",
        ["基础伤害"] = 90,
        ["基础倍率"] = 1,
        ["脉冲时间"] = 0.1,
        ["持续时间"] = 3,
        ["持续时间独立计算"] = false,
        ["重复释放刷新时间"] = true,
        ["生效次数"] = 0,
        ["最大层数"] = 0,
        ["无需更新"] = false,
        ["魔法名"] = "地刺_dot",
        ["打印信息"] = false,
        ["显示在指令选单中"] = true,
        ["冷却"] = 0,
        ["各目标冷却"] = 0,
        ["各目标冷却倍率"] = 0,
        ["基础威力"] = 1,
        ["释放给自己"] = false,
        ["延迟"] = 0,
        ["宽度倍率"] = 1,
        ["高度倍率"] = 1,
        ["尺寸倍率"] = 1,
        ["必须要目标"] = true
    }),
    ["地刺_脉冲"] = Spell.Load({
        ["类型"] = "AOESpell",
        ["持续时间"] = 30,
        ["可重复击中同一目标"] = false,
        ["击中间隔"] = 1,
        ["特效_持续"] = {
            {
                ["_type"] = "ParticleGraphic",
                ["特效对象"] = "",
                ["特效资产"] = "",
                ["绑定实体"] = false,
                ["绑定挂点"] = "",
                ["偏移"] = {
                    0,
                    0,
                    0
                },
                ["目标"] = "自己",
                ["目标场景名"] = "",
                ["延迟"] = 0,
                ["持续时间"] = 0,
                ["重复次数"] = 1,
                ["重复延迟"] = 0
            }
        },
        ["范围形状"] = "圆形",
        ["圆形半径"] = 0,
        ["偏移"] = {
            0,
            0,
            0
        },
        ["魔法名"] = "地刺_脉冲",
        ["打印信息"] = false,
        ["显示在指令选单中"] = true,
        ["冷却"] = 50,
        ["各目标冷却"] = 0,
        ["各目标冷却倍率"] = 0,
        ["基础威力"] = 1,
        ["释放给自己"] = false,
        ["延迟"] = 0,
        ["子魔法"] = {
            {
                ["魔法"] = "地刺_dot"
            }
        },
        ["宽度倍率"] = 1,
        ["高度倍率"] = 1,
        ["尺寸倍率"] = 1,
        ["必须要目标"] = true
    }),
    ["副_召唤_坚果"] = Spell.Load({
        ["类型"] = "SummonSpell",
        ["召唤在目标位置"] = false,
        ["怪物类型"] = "副-召唤物-坚果",
        ["最大数量"] = 1,
        ["召唤范围"] = 100,
        ["持续时间"] = 0,
        ["继承等级"] = false,
        ["魔法名"] = "副_召唤_坚果",
        ["打印信息"] = false,
        ["显示在指令选单中"] = true,
        ["冷却"] = 40,
        ["各目标冷却"] = 0,
        ["各目标冷却倍率"] = 0,
        ["基础威力"] = 1,
        ["释放给自己"] = true,
        ["延迟"] = 0,
        ["宽度倍率"] = 1,
        ["高度倍率"] = 1,
        ["尺寸倍率"] = 1,
        ["必须要目标"] = true
    }),
    ["副_召唤_星星果"] = Spell.Load({
        ["类型"] = "SummonSpell",
        ["召唤在目标位置"] = false,
        ["怪物类型"] = "副-召唤物-星星果",
        ["最大数量"] = 1,
        ["召唤范围"] = 100,
        ["持续时间"] = 10,
        ["继承等级"] = false,
        ["魔法名"] = "副_召唤_星星果",
        ["打印信息"] = false,
        ["显示在指令选单中"] = true,
        ["冷却"] = 30,
        ["各目标冷却"] = 0,
        ["各目标冷却倍率"] = 0,
        ["基础威力"] = 1,
        ["释放给自己"] = true,
        ["延迟"] = 0,
        ["宽度倍率"] = 1,
        ["高度倍率"] = 1,
        ["尺寸倍率"] = 1,
        ["必须要目标"] = true
    }),
    ["副_星星果_伤害"] = Spell.Load({
        ["类型"] = "PainSpell",
        ["基础伤害"] = 150,
        ["基础倍率"] = 1,
        ["元素类型"] = "无",
        ["魔法名"] = "副_星星果_伤害",
        ["打印信息"] = false,
        ["显示在指令选单中"] = true,
        ["冷却"] = 0,
        ["各目标冷却"] = 0,
        ["各目标冷却倍率"] = 0,
        ["基础威力"] = 1,
        ["释放给自己"] = false,
        ["延迟"] = 0,
        ["宽度倍率"] = 1,
        ["高度倍率"] = 1,
        ["尺寸倍率"] = 1,
        ["必须要目标"] = true
    }),
    ["副_星星果_入口"] = Spell.Load({
        ["类型"] = "ProjectileSpell",
        ["飞弹模型"] = "豌豆",
        ["持续时间"] = -1,
        ["寻找目标"] = false,
        ["生成于自己位置"] = false,
        ["散射次数"] = 5,
        ["散射角度"] = 72,
        ["散射延迟"] = 0,
        ["初始角度修改"] = {
            0,
            0
        },
        ["速度"] = 500,
        ["重力"] = 0,
        ["追踪目标速度"] = 0,
        ["穿过地形"] = false,
        ["可重复碰撞同一目标"] = false,
        ["对同一目标生效间隔"] = -1,
        ["生效次数"] = -1,
        ["魔法名"] = "副_星星果_入口",
        ["打印信息"] = false,
        ["显示在指令选单中"] = true,
        ["冷却"] = 0.5,
        ["各目标冷却"] = 0,
        ["各目标冷却倍率"] = 0,
        ["基础威力"] = 1,
        ["释放给自己"] = false,
        ["延迟"] = 0,
        ["子魔法"] = {
            {
                ["魔法"] = "副_星星果_伤害"
            }
        },
        ["宽度倍率"] = 1,
        ["高度倍率"] = 1,
        ["尺寸倍率"] = 1,
        ["必须要目标"] = false
    }),
    ["副_召唤_椰子炮"] = Spell.Load({
        ["类型"] = "SummonSpell",
        ["召唤在目标位置"] = false,
        ["怪物类型"] = "副-召唤物-豌豆射手",
        ["最大数量"] = 1,
        ["召唤范围"] = 100,
        ["持续时间"] = 0,
        ["继承等级"] = false,
        ["魔法名"] = "副_召唤_椰子炮",
        ["打印信息"] = false,
        ["显示在指令选单中"] = true,
        ["冷却"] = 0,
        ["各目标冷却"] = 0,
        ["各目标冷却倍率"] = 0,
        ["基础威力"] = 1,
        ["释放给自己"] = true,
        ["延迟"] = 0,
        ["宽度倍率"] = 1,
        ["高度倍率"] = 1,
        ["尺寸倍率"] = 1,
        ["必须要目标"] = true
    }),
    ["椰子炮_入口"] = Spell.Load({
        ["类型"] = "ProjectileSpell",
        ["飞弹模型"] = "椰子飞弹",
        ["持续时间"] = -1,
        ["寻找目标"] = false,
        ["生成于自己位置"] = false,
        ["散射次数"] = 1,
        ["散射角度"] = 0,
        ["散射延迟"] = 0,
        ["初始角度修改"] = {
            0,
            0
        },
        ["速度"] = 500,
        ["重力"] = 0,
        ["追踪目标速度"] = 0,
        ["穿过地形"] = false,
        ["结束子魔法"] = {
            {
                ["魔法"] = "椰子炮_范围魔法"
            }
        },
        ["可重复碰撞同一目标"] = false,
        ["对同一目标生效间隔"] = -1,
        ["生效次数"] = -1,
        ["魔法名"] = "椰子炮_入口",
        ["打印信息"] = true,
        ["显示在指令选单中"] = true,
        ["冷却"] = 2,
        ["各目标冷却"] = 0,
        ["各目标冷却倍率"] = 0,
        ["基础威力"] = 1,
        ["释放给自己"] = false,
        ["延迟"] = 0,
        ["宽度倍率"] = 1,
        ["高度倍率"] = 1,
        ["尺寸倍率"] = 1,
        ["必须要目标"] = false
    }),
    ["椰子炮_范围伤害"] = Spell.Load({
        ["类型"] = "PainSpell",
        ["基础伤害"] = 100,
        ["基础倍率"] = 1,
        ["元素类型"] = "无",
        ["属性增伤"] = {
            {
                ["倍率"] = 0,
                ["增加类型"] = "增加",
                ["乘以基础数值"] = false
            }
        },
        ["魔法名"] = "椰子炮_范围伤害",
        ["打印信息"] = false,
        ["显示在指令选单中"] = true,
        ["冷却"] = 0,
        ["各目标冷却"] = 0,
        ["各目标冷却倍率"] = 0,
        ["基础威力"] = 1,
        ["释放给自己"] = false,
        ["延迟"] = 0,
        ["宽度倍率"] = 1,
        ["高度倍率"] = 1,
        ["尺寸倍率"] = 1,
        ["必须要目标"] = true
    }),
    ["椰子炮_范围魔法"] = Spell.Load({
        ["类型"] = "AOESpell",
        ["持续时间"] = 0,
        ["范围形状"] = "圆形",
        ["圆形半径"] = 300,
        ["偏移"] = {
            0,
            0,
            0
        },
        ["魔法名"] = "椰子炮_范围魔法",
        ["打印信息"] = false,
        ["显示在指令选单中"] = true,
        ["冷却"] = 0,
        ["各目标冷却"] = 0,
        ["各目标冷却倍率"] = 0,
        ["基础威力"] = 1,
        ["释放给自己"] = false,
        ["延迟"] = 0,
        ["子魔法"] = {
            {
                ["魔法"] = "椰子炮_范围伤害"
            }
        },
        ["宽度倍率"] = 1,
        ["高度倍率"] = 1,
        ["尺寸倍率"] = 1,
        ["必须要目标"] = true
    }),
    ["副-樱桃炸弹-飞弹-范围-伤害"] = Spell.Load({
        ["类型"] = "PainSpell",
        ["基础伤害"] = 5,
        ["基础倍率"] = 1,
        ["元素类型"] = "无",
        ["魔法名"] = "副-樱桃炸弹-飞弹-范围-伤害",
        ["打印信息"] = true,
        ["显示在指令选单中"] = true,
        ["冷却"] = 0,
        ["各目标冷却"] = 0,
        ["各目标冷却倍率"] = 0,
        ["基础威力"] = 1,
        ["释放给自己"] = false,
        ["延迟"] = 0,
        ["宽度倍率"] = 1,
        ["高度倍率"] = 1,
        ["尺寸倍率"] = 1,
        ["必须要目标"] = true
    }),
    ["副-樱桃炸弹-飞弹-范围"] = Spell.Load({
        ["类型"] = "AOESpell",
        ["持续时间"] = 0,
        ["范围形状"] = "圆形",
        ["圆形半径"] = 200,
        ["偏移"] = {
            0,
            0,
            0
        },
        ["魔法名"] = "副-樱桃炸弹-飞弹-范围",
        ["打印信息"] = true,
        ["显示在指令选单中"] = true,
        ["冷却"] = 0,
        ["各目标冷却"] = 0,
        ["各目标冷却倍率"] = 0,
        ["基础威力"] = 1,
        ["释放给自己"] = false,
        ["延迟"] = 0,
        ["子魔法"] = {
            {
                ["魔法"] = "副-樱桃炸弹-飞弹-范围-伤害"
            }
        },
        ["宽度倍率"] = 1,
        ["高度倍率"] = 1,
        ["尺寸倍率"] = 1,
        ["必须要目标"] = true
    }),
    ["副-樱桃炸弹-飞弹"] = Spell.Load({
        ["类型"] = "ProjectileSpell",
        ["飞弹模型"] = "樱桃炸弹",
        ["持续时间"] = 20,
        ["寻找目标"] = false,
        ["生成于自己位置"] = true,
        ["散射次数"] = 1,
        ["散射角度"] = 0,
        ["散射延迟"] = 0,
        ["初始角度修改"] = {
            45,
            0
        },
        ["速度"] = 500,
        ["重力"] = 0,
        ["追踪目标速度"] = 100,
        ["穿过地形"] = false,
        ["结束子魔法"] = {
            {
                ["魔法"] = "副-樱桃炸弹-飞弹-范围"
            }
        },
        ["可重复碰撞同一目标"] = false,
        ["对同一目标生效间隔"] = -1,
        ["生效次数"] = 1,
        ["魔法名"] = "副-樱桃炸弹-飞弹",
        ["打印信息"] = true,
        ["显示在指令选单中"] = true,
        ["冷却"] = 45,
        ["各目标冷却"] = 0,
        ["各目标冷却倍率"] = 0,
        ["基础威力"] = 1,
        ["释放给自己"] = false,
        ["延迟"] = 0,
        ["特效_释放"] = {
            {
                ["_type"] = "ParticleGraphic",
                ["特效对象"] = "爆炸_紫红色",
                ["特效资产"] = "",
                ["绑定实体"] = false,
                ["绑定挂点"] = "",
                ["偏移"] = {
                    0,
                    0,
                    0
                },
                ["目标"] = "目标",
                ["目标场景名"] = "",
                ["延迟"] = 1,
                ["持续时间"] = 1.5,
                ["重复次数"] = 0,
                ["重复延迟"] = 0
            }
        },
        ["宽度倍率"] = 1,
        ["高度倍率"] = 1,
        ["尺寸倍率"] = 1,
        ["必须要目标"] = false
    }),
    ["副-火爆辣椒-飞弹-范围-伤害"] = Spell.Load({
        ["类型"] = "PainSpell",
        ["基础伤害"] = 500,
        ["基础倍率"] = 1,
        ["元素类型"] = "无",
        ["魔法名"] = "副-火爆辣椒-飞弹-范围-伤害",
        ["打印信息"] = true,
        ["显示在指令选单中"] = true,
        ["冷却"] = 0,
        ["各目标冷却"] = 0,
        ["各目标冷却倍率"] = 0,
        ["基础威力"] = 1,
        ["释放给自己"] = false,
        ["延迟"] = 0,
        ["宽度倍率"] = 1,
        ["高度倍率"] = 1,
        ["尺寸倍率"] = 1,
        ["必须要目标"] = true
    }),
    ["副-火爆辣椒-飞弹-范围"] = Spell.Load({
        ["类型"] = "AOESpell",
        ["持续时间"] = 0,
        ["范围形状"] = "方形",
        ["方形长宽旋转"] = {
            600,
            100,
            0
        },
        ["偏移"] = {
            0,
            0,
            0
        },
        ["魔法名"] = "副-火爆辣椒-飞弹-范围",
        ["打印信息"] = true,
        ["显示在指令选单中"] = true,
        ["冷却"] = 0,
        ["各目标冷却"] = 0,
        ["各目标冷却倍率"] = 0,
        ["基础威力"] = 1,
        ["释放给自己"] = false,
        ["延迟"] = 0,
        ["子魔法"] = {
            {
                ["魔法"] = "副-火爆辣椒-飞弹-范围-伤害"
            }
        },
        ["宽度倍率"] = 1,
        ["高度倍率"] = 1,
        ["尺寸倍率"] = 1,
        ["必须要目标"] = true
    }),
    ["副-火爆辣椒-飞弹"] = Spell.Load({
        ["类型"] = "ProjectileSpell",
        ["飞弹模型"] = "火爆辣椒",
        ["持续时间"] = 20,
        ["寻找目标"] = false,
        ["生成于自己位置"] = true,
        ["散射次数"] = 1,
        ["散射角度"] = 0,
        ["散射延迟"] = 0,
        ["初始角度修改"] = {
            45,
            0
        },
        ["速度"] = 500,
        ["重力"] = 0,
        ["追踪目标速度"] = 100,
        ["穿过地形"] = false,
        ["结束子魔法"] = {
            {
                ["魔法"] = "副-火爆辣椒-飞弹-范围"
            }
        },
        ["可重复碰撞同一目标"] = false,
        ["对同一目标生效间隔"] = -1,
        ["生效次数"] = 1,
        ["魔法名"] = "副-火爆辣椒-飞弹",
        ["打印信息"] = true,
        ["显示在指令选单中"] = true,
        ["冷却"] = 0,
        ["各目标冷却"] = 0,
        ["各目标冷却倍率"] = 0,
        ["基础威力"] = 1,
        ["释放给自己"] = false,
        ["延迟"] = 0,
        ["特效_释放"] = {
            {
                ["_type"] = "ParticleGraphic",
                ["特效对象"] = "",
                ["特效资产"] = "",
                ["绑定实体"] = false,
                ["绑定挂点"] = "",
                ["偏移"] = {
                    0,
                    0,
                    0
                },
                ["目标"] = "自己",
                ["目标场景名"] = "",
                ["延迟"] = 0,
                ["持续时间"] = 0,
                ["重复次数"] = 1,
                ["重复延迟"] = 0
            }
        },
        ["宽度倍率"] = 1,
        ["高度倍率"] = 1,
        ["尺寸倍率"] = 1,
        ["必须要目标"] = false
    }),
    ["副_白菜拳击手召唤"] = Spell.Load({
        ["类型"] = "SummonSpell",
        ["召唤在目标位置"] = false,
        ["怪物类型"] = "副-召唤物-白菜拳击手",
        ["最大数量"] = 1,
        ["召唤范围"] = 100,
        ["持续时间"] = 0,
        ["继承等级"] = false,
        ["魔法名"] = "副_白菜拳击手召唤",
        ["打印信息"] = false,
        ["显示在指令选单中"] = true,
        ["冷却"] = 0,
        ["各目标冷却"] = 0,
        ["各目标冷却倍率"] = 0,
        ["基础威力"] = 1,
        ["释放给自己"] = false,
        ["延迟"] = 0,
        ["宽度倍率"] = 1,
        ["高度倍率"] = 1,
        ["尺寸倍率"] = 1,
        ["必须要目标"] = true
    }),
    ["副_窝瓜_范围伤害"] = Spell.Load({
        ["类型"] = "PainSpell",
        ["基础伤害"] = 300,
        ["基础倍率"] = 1,
        ["元素类型"] = "无",
        ["属性增伤"] = {
            {
                ["倍率"] = 0,
                ["增加类型"] = "增加",
                ["乘以基础数值"] = false
            }
        },
        ["魔法名"] = "副_窝瓜_范围伤害",
        ["打印信息"] = false,
        ["显示在指令选单中"] = true,
        ["冷却"] = 0,
        ["各目标冷却"] = 0,
        ["各目标冷却倍率"] = 0,
        ["基础威力"] = 1,
        ["释放给自己"] = false,
        ["延迟"] = 0,
        ["宽度倍率"] = 1,
        ["高度倍率"] = 1,
        ["尺寸倍率"] = 1,
        ["必须要目标"] = true
    }),
    ["副_窝瓜_范围魔法"] = Spell.Load({
        ["类型"] = "AOESpell",
        ["持续时间"] = 0,
        ["范围形状"] = "圆形",
        ["圆形半径"] = 400,
        ["偏移"] = {
            0,
            0,
            0
        },
        ["魔法名"] = "副_窝瓜_范围魔法",
        ["打印信息"] = false,
        ["显示在指令选单中"] = true,
        ["冷却"] = 60,
        ["各目标冷却"] = 0,
        ["各目标冷却倍率"] = 0,
        ["基础威力"] = 1,
        ["释放给自己"] = false,
        ["延迟"] = 0,
        ["子魔法"] = {
            {
                ["魔法"] = "副_窝瓜_范围伤害"
            }
        },
        ["宽度倍率"] = 1,
        ["高度倍率"] = 1,
        ["尺寸倍率"] = 1,
        ["必须要目标"] = true
    }),
    ["副_窝瓜_飞弹"] = Spell.Load({
        ["类型"] = "ProjectileSpell",
        ["飞弹模型"] = "窝瓜",
        ["持续时间"] = 5,
        ["寻找目标"] = false,
        ["生成于自己位置"] = true,
        ["散射次数"] = 1,
        ["散射角度"] = 0,
        ["散射延迟"] = 0,
        ["初始角度修改"] = {
            0,
            0
        },
        ["速度"] = 500,
        ["重力"] = 0,
        ["追踪目标速度"] = 0,
        ["穿过地形"] = false,
        ["结束子魔法"] = {
            {
                ["魔法"] = "副_窝瓜_范围魔法"
            }
        },
        ["可重复碰撞同一目标"] = false,
        ["对同一目标生效间隔"] = -1,
        ["生效次数"] = 1,
        ["魔法名"] = "副_窝瓜_飞弹",
        ["打印信息"] = false,
        ["显示在指令选单中"] = true,
        ["冷却"] = 0,
        ["各目标冷却"] = 0,
        ["各目标冷却倍率"] = 0,
        ["基础威力"] = 1,
        ["释放给自己"] = false,
        ["延迟"] = 0,
        ["宽度倍率"] = 1,
        ["高度倍率"] = 1,
        ["尺寸倍率"] = 1,
        ["必须要目标"] = false
    }),
    ["副_召唤_豌豆射手"] = Spell.Load({
        ["类型"] = "SummonSpell",
        ["召唤在目标位置"] = false,
        ["怪物类型"] = "副-召唤物-豌豆射手",
        ["最大数量"] = 1,
        ["召唤范围"] = 100,
        ["持续时间"] = 0,
        ["继承等级"] = false,
        ["魔法名"] = "副_召唤_豌豆射手",
        ["打印信息"] = false,
        ["显示在指令选单中"] = true,
        ["冷却"] = 30,
        ["各目标冷却"] = 0,
        ["各目标冷却倍率"] = 0,
        ["基础威力"] = 1,
        ["释放给自己"] = true,
        ["延迟"] = 0,
        ["宽度倍率"] = 1,
        ["高度倍率"] = 1,
        ["尺寸倍率"] = 1,
        ["必须要目标"] = true
    }),
    ["副_豌豆射手_伤害"] = Spell.Load({
        ["类型"] = "PainSpell",
        ["基础伤害"] = 50,
        ["基础倍率"] = 1,
        ["元素类型"] = "无",
        ["魔法名"] = "副_豌豆射手_伤害",
        ["打印信息"] = false,
        ["显示在指令选单中"] = true,
        ["冷却"] = 0,
        ["各目标冷却"] = 0,
        ["各目标冷却倍率"] = 0,
        ["基础威力"] = 1,
        ["释放给自己"] = false,
        ["延迟"] = 0,
        ["宽度倍率"] = 1,
        ["高度倍率"] = 1,
        ["尺寸倍率"] = 1,
        ["必须要目标"] = true
    }),
    ["副_豌豆射手_入口"] = Spell.Load({
        ["类型"] = "ProjectileSpell",
        ["飞弹模型"] = "豌豆",
        ["持续时间"] = -1,
        ["寻找目标"] = false,
        ["生成于自己位置"] = false,
        ["散射次数"] = 1,
        ["散射角度"] = 0,
        ["散射延迟"] = 0,
        ["初始角度修改"] = {
            0,
            0
        },
        ["速度"] = 500,
        ["重力"] = 0,
        ["追踪目标速度"] = 0,
        ["穿过地形"] = false,
        ["可重复碰撞同一目标"] = false,
        ["对同一目标生效间隔"] = -1,
        ["生效次数"] = -1,
        ["魔法名"] = "副_豌豆射手_入口",
        ["打印信息"] = false,
        ["显示在指令选单中"] = true,
        ["冷却"] = 0.5,
        ["各目标冷却"] = 0,
        ["各目标冷却倍率"] = 0,
        ["基础威力"] = 1,
        ["释放给自己"] = false,
        ["延迟"] = 0,
        ["子魔法"] = {
            {
                ["魔法"] = "副_豌豆射手_伤害"
            }
        },
        ["宽度倍率"] = 1,
        ["高度倍率"] = 1,
        ["尺寸倍率"] = 1,
        ["必须要目标"] = false
    }),
    ["副_召唤_辣椒投手"] = Spell.Load({
        ["类型"] = "SummonSpell",
        ["召唤在目标位置"] = false,
        ["怪物类型"] = "副-召唤物-辣椒投手",
        ["最大数量"] = 1,
        ["召唤范围"] = 100,
        ["持续时间"] = 0,
        ["继承等级"] = false,
        ["魔法名"] = "副_召唤_辣椒投手",
        ["打印信息"] = false,
        ["显示在指令选单中"] = true,
        ["冷却"] = 50,
        ["各目标冷却"] = 0,
        ["各目标冷却倍率"] = 0,
        ["基础威力"] = 1,
        ["释放给自己"] = true,
        ["延迟"] = 0,
        ["宽度倍率"] = 1,
        ["高度倍率"] = 1,
        ["尺寸倍率"] = 1,
        ["必须要目标"] = true
    }),
    ["副_辣椒投手_入口"] = Spell.Load({
        ["类型"] = "ProjectileSpell",
        ["飞弹模型"] = "辣椒投手飞弹",
        ["持续时间"] = -1,
        ["寻找目标"] = false,
        ["生成于自己位置"] = false,
        ["散射次数"] = 1,
        ["散射角度"] = 0,
        ["散射延迟"] = 0,
        ["初始角度修改"] = {
            0,
            0
        },
        ["速度"] = 500,
        ["重力"] = 0,
        ["追踪目标速度"] = 0,
        ["穿过地形"] = false,
        ["结束子魔法"] = {
            {
                ["魔法"] = "副_辣椒投手_范围魔法"
            }
        },
        ["可重复碰撞同一目标"] = false,
        ["对同一目标生效间隔"] = -1,
        ["生效次数"] = -1,
        ["魔法名"] = "副_辣椒投手_入口",
        ["打印信息"] = false,
        ["显示在指令选单中"] = true,
        ["冷却"] = 2,
        ["各目标冷却"] = 0,
        ["各目标冷却倍率"] = 0,
        ["基础威力"] = 1,
        ["释放给自己"] = false,
        ["延迟"] = 0,
        ["宽度倍率"] = 1,
        ["高度倍率"] = 1,
        ["尺寸倍率"] = 1,
        ["必须要目标"] = false
    }),
    ["副_辣椒投手_持续伤害"] = Spell.Load({
        ["类型"] = "DOTBuff",
        ["基础伤害"] = 150,
        ["基础倍率"] = 1,
        ["脉冲时间"] = 0.5,
        ["持续时间"] = 3,
        ["持续时间独立计算"] = false,
        ["重复释放刷新时间"] = true,
        ["生效次数"] = 0,
        ["最大层数"] = 0,
        ["无需更新"] = false,
        ["魔法名"] = "副_辣椒投手_持续伤害",
        ["打印信息"] = false,
        ["显示在指令选单中"] = true,
        ["冷却"] = 0,
        ["各目标冷却"] = 0,
        ["各目标冷却倍率"] = 0,
        ["基础威力"] = 1,
        ["释放给自己"] = false,
        ["延迟"] = 0,
        ["宽度倍率"] = 1,
        ["高度倍率"] = 1,
        ["尺寸倍率"] = 1,
        ["必须要目标"] = true
    }),
    ["副_辣椒投手_范围伤害"] = Spell.Load({
        ["类型"] = "PainSpell",
        ["基础伤害"] = 100,
        ["基础倍率"] = 1,
        ["元素类型"] = "无",
        ["属性增伤"] = {
            {
                ["倍率"] = 0,
                ["增加类型"] = "增加",
                ["乘以基础数值"] = false
            }
        },
        ["魔法名"] = "副_辣椒投手_范围伤害",
        ["打印信息"] = false,
        ["显示在指令选单中"] = true,
        ["冷却"] = 0,
        ["各目标冷却"] = 0,
        ["各目标冷却倍率"] = 0,
        ["基础威力"] = 1,
        ["释放给自己"] = false,
        ["延迟"] = 0,
        ["宽度倍率"] = 1,
        ["高度倍率"] = 1,
        ["尺寸倍率"] = 1,
        ["必须要目标"] = true
    }),
    ["副_辣椒投手_范围魔法"] = Spell.Load({
        ["类型"] = "AOESpell",
        ["持续时间"] = 0,
        ["范围形状"] = "圆形",
        ["圆形半径"] = 300,
        ["偏移"] = {
            0,
            0,
            0
        },
        ["魔法名"] = "副_辣椒投手_范围魔法",
        ["打印信息"] = false,
        ["显示在指令选单中"] = true,
        ["冷却"] = 0,
        ["各目标冷却"] = 0,
        ["各目标冷却倍率"] = 0,
        ["基础威力"] = 1,
        ["释放给自己"] = false,
        ["延迟"] = 0,
        ["子魔法"] = {
            {
                ["魔法"] = "椰子炮_范围伤害"
            },
            {
                ["魔法"] = "副_辣椒投手_持续伤害"
            }
        },
        ["宽度倍率"] = 1,
        ["高度倍率"] = 1,
        ["尺寸倍率"] = 1,
        ["必须要目标"] = true
    }),
    ["钢铁地刺_dot"] = Spell.Load({
        ["类型"] = "DOTBuff",
        ["基础伤害"] = 500,
        ["基础倍率"] = 1,
        ["脉冲时间"] = 0.1,
        ["持续时间"] = 5,
        ["持续时间独立计算"] = false,
        ["重复释放刷新时间"] = true,
        ["生效次数"] = 0,
        ["最大层数"] = 0,
        ["无需更新"] = false,
        ["魔法名"] = "钢铁地刺_dot",
        ["打印信息"] = false,
        ["显示在指令选单中"] = true,
        ["冷却"] = 0,
        ["各目标冷却"] = 0,
        ["各目标冷却倍率"] = 0,
        ["基础威力"] = 1,
        ["释放给自己"] = false,
        ["延迟"] = 0,
        ["宽度倍率"] = 1,
        ["高度倍率"] = 1,
        ["尺寸倍率"] = 1,
        ["必须要目标"] = true
    }),
    ["钢铁地刺_脉冲"] = Spell.Load({
        ["类型"] = "AOESpell",
        ["持续时间"] = 30,
        ["可重复击中同一目标"] = false,
        ["击中间隔"] = 1,
        ["特效_持续"] = {
            {
                ["_type"] = "ParticleGraphic",
                ["特效对象"] = "",
                ["特效资产"] = "",
                ["绑定实体"] = false,
                ["绑定挂点"] = "",
                ["偏移"] = {
                    0,
                    0,
                    0
                },
                ["目标"] = "自己",
                ["目标场景名"] = "",
                ["延迟"] = 0,
                ["持续时间"] = 0,
                ["重复次数"] = 1,
                ["重复延迟"] = 0
            }
        },
        ["范围形状"] = "圆形",
        ["圆形半径"] = 0,
        ["偏移"] = {
            0,
            0,
            0
        },
        ["魔法名"] = "钢铁地刺_脉冲",
        ["打印信息"] = false,
        ["显示在指令选单中"] = true,
        ["冷却"] = 50,
        ["各目标冷却"] = 0,
        ["各目标冷却倍率"] = 0,
        ["基础威力"] = 1,
        ["释放给自己"] = false,
        ["延迟"] = 0,
        ["子魔法"] = {
            {
                ["魔法"] = "钢铁地刺_dot"
            }
        },
        ["宽度倍率"] = 1,
        ["高度倍率"] = 1,
        ["尺寸倍率"] = 1,
        ["必须要目标"] = true
    }),
    ["伤害魔法"] = Spell.Load({
        ["类型"] = "PainSpell",
        ["基础伤害"] = 30,
        ["基础倍率"] = 1,
        ["元素类型"] = "无",
        ["魔法名"] = "伤害魔法",
        ["打印信息"] = true,
        ["显示在指令选单中"] = true,
        ["冷却"] = 0,
        ["各目标冷却"] = 0,
        ["各目标冷却倍率"] = 0,
        ["基础威力"] = 1,
        ["释放给自己"] = false,
        ["延迟"] = 0,
        ["释放条件"] = Modifiers.New({
            {
                ["目标"] = "自己",
                ["条件类型"] = "HealthCondition",
                ["条件"] = {
                    ["百分比"] = true,
                    ["最小值"] = 0,
                    ["最大值"] = 100
                },
                ["动作"] = "必须"
            }
        }),
        ["特效_释放"] = {
            {
                ["_type"] = "ParticleGraphic",
                ["特效对象"] = "CherryBomb",
                ["特效资产"] = "",
                ["绑定实体"] = false,
                ["绑定挂点"] = "",
                ["偏移"] = {
                    0,
                    0,
                    0
                },
                ["目标"] = "目标",
                ["目标场景名"] = "",
                ["延迟"] = 0,
                ["持续时间"] = 2,
                ["重复次数"] = 1,
                ["重复延迟"] = 0
            }
        },
        ["宽度倍率"] = 1,
        ["高度倍率"] = 1,
        ["尺寸倍率"] = 1,
        ["必须要目标"] = true
    }),
    ["减速BUFF"] = Spell.Load({
        ["类型"] = "AttributeBuffSpell",
        ["属性类型"] = "速度",
        ["属性值"] = -50,
        ["百分比"] = true,
        ["持续时间"] = 1,
        ["持续时间独立计算"] = false,
        ["重复释放刷新时间"] = true,
        ["生效次数"] = 0,
        ["最大层数"] = 0,
        ["无需更新"] = false,
        ["魔法名"] = "减速BUFF",
        ["打印信息"] = false,
        ["显示在指令选单中"] = true,
        ["冷却"] = 0,
        ["各目标冷却"] = 0,
        ["各目标冷却倍率"] = 0,
        ["基础威力"] = 1,
        ["释放给自己"] = false,
        ["延迟"] = 0,
        ["宽度倍率"] = 1,
        ["高度倍率"] = 1,
        ["尺寸倍率"] = 1,
        ["必须要目标"] = true
    }),
    ["灼烧BUFF"] = Spell.Load({
        ["类型"] = "DOTBuff",
        ["基础伤害"] = 10,
        ["基础倍率"] = 1,
        ["属性增伤"] = {
            {
                ["属性类型"] = "攻击",
                ["倍率"] = 1,
                ["增加类型"] = "增加",
                ["乘以基础数值"] = false
            }
        },
        ["脉冲时间"] = 0,
        ["持续时间"] = 0,
        ["持续时间独立计算"] = false,
        ["重复释放刷新时间"] = true,
        ["生效次数"] = 0,
        ["最大层数"] = 0,
        ["无需更新"] = false,
        ["魔法名"] = "灼烧BUFF",
        ["打印信息"] = false,
        ["显示在指令选单中"] = true,
        ["注释"] = "火系异常状态",
        ["冷却"] = 0,
        ["各目标冷却"] = 0,
        ["各目标冷却倍率"] = 0,
        ["基础威力"] = 1,
        ["释放给自己"] = false,
        ["延迟"] = 0,
        ["宽度倍率"] = 1,
        ["高度倍率"] = 1,
        ["尺寸倍率"] = 1,
        ["必须要目标"] = true
    }),
    ["获得物品魔法"] = Spell.Load({
        ["类型"] = "ItemSpell",
        ["物品类型"] = "阳光",
        ["基础数量"] = 10,
        ["基础倍率"] = 1,
        ["魔法名"] = "获得物品魔法",
        ["打印信息"] = false,
        ["显示在指令选单中"] = true,
        ["冷却"] = 0,
        ["各目标冷却"] = 0,
        ["各目标冷却倍率"] = 0,
        ["基础威力"] = 1,
        ["释放给自己"] = false,
        ["延迟"] = 0,
        ["宽度倍率"] = 1,
        ["高度倍率"] = 1,
        ["尺寸倍率"] = 1,
        ["必须要目标"] = true
    })
}loaded = true
end

---@param spellName string
---@return Spell
function SpellConfig.Get(spellName)
    if not loaded then
        LoadConfig()
    end
    return SpellConfig.config[spellName]
end

---@return Spell[]
function SpellConfig.GetAll()
    if not loaded then
        LoadConfig()
    end
    return SpellConfig.config
end
return SpellConfig
