local MainStorage = game:GetService('MainStorage')
local gg                = require(MainStorage.code.common.MGlobal)    ---@type gg
local TagType      = require(MainStorage.code.common.config_type.tags.TagType)    ---@type TagType

--- 词条配置文件
---@class TagTypeConfig
local TagTypeConfig = {}
local loaded = false

local function LoadConfig()
    TagTypeConfig.config ={
    ["丰收葵_阳光产量提升_词条"] = TagType.New({
        ["名字"] = "丰收葵_阳光产量提升_词条",
        ["最高等级"] = 10,
        ["描述"] = "白天的阳光产量提升",
        ["详细属性"] = "阳光产量+[1.威力增加]%",
        ["功能"] = {
            {
                ["影响魔法"] = {
                    "丰收葵_阳光获取"
                },
                ["影响魔法关键字"] = "",
                ["威力增加"] = 10,
                ["威力增加表达式"] = "",
                ["取消"] = false,
                ["修改数值倍率"] = 1,
                ["释放魔法继承威力"] = false,
                ["释放魔法威力增加"] = 0,
                ["类型"] = "SpellTagHandler",
                ["打印信息"] = false,
                ["m_trigger"] = "释放魔法时",
                ["优先级"] = 5,
                ["冷却"] = 0,
                ["每级增强"] = 1,
                ["几率"] = 0,
                ["条件"] = {
                    {
                        ["目标"] = "场景对象",
                        ["目标场景名"] = "terrain/昼夜交替/山坡太阳",
                        ["条件类型"] = "AxisPositionCondition",
                        ["条件"] = {
                            ["轴"] = "Y",
                            ["最小值"] = 0,
                            ["最大值"] = 100
                        },
                        ["动作"] = "必须"
                    }
                },
                ["升级增加数值"] = {
                    {
                        ["paramName"] = "威力增加",
                        ["number"] = 1
                    }
                }
            }
        }
    }),
    ["伤害强化_词条"] = TagType.New({
        ["名字"] = "伤害强化_词条",
        ["最高等级"] = 10,
        ["描述"] = "所有植物造成的伤害提升",
        ["详细属性"] = "伤害 +[1.属性增伤.1]",
        ["功能"] = {
            {
                ["影响魔法关键字"] = "豌豆射手",
                ["即将击杀"] = false,
                ["要求元素类型"] = "无",
                ["增伤"] = 0,
                ["增加暴击率"] = 0,
                ["增加暴击伤害"] = 0,
                ["属性增伤"] = {
                    {
                        ["倍率"] = 10,
                        ["增加类型"] = "增加",
                        ["乘以基础数值"] = false
                    }
                },
                ["属性增伤倍率"] = 1,
                ["释放魔法继承威力"] = false,
                ["释放魔法威力增加"] = 0,
                ["类型"] = "DamageTagHandler",
                ["打印信息"] = false,
                ["m_trigger"] = "攻击时",
                ["优先级"] = 5,
                ["冷却"] = 0,
                ["每级增强"] = 1,
                ["几率"] = 0,
                ["升级增加数值"] = {
                    {
                        ["paramName"] = "属性增伤倍率",
                        ["number"] = 1
                    }
                }
            }
        }
    }),
    ["射速增加_词条"] = TagType.New({
        ["名字"] = "射速增加_词条",
        ["最高等级"] = 10,
        ["描述"] = "所有植物的射速增加",
        ["详细属性"] = "射速 +[1.修改数值.1]%",
        ["功能"] = {
            {
                ["影响魔法关键字"] = "",
                ["威力增加"] = 0,
                ["威力增加表达式"] = "",
                ["取消"] = false,
                ["修改数值"] = {
                    {
                        ["objectName"] = "伤害魔法",
                        ["paramName"] = "冷却加速",
                        ["paramValue"] = {
                            ["倍率"] = 3,
                            ["增加类型"] = "增加",
                            ["乘以基础数值"] = false
                        },
                        ["isAlways"] = false
                    }
                },
                ["修改数值倍率"] = 1,
                ["释放魔法继承威力"] = false,
                ["释放魔法威力增加"] = 0,
                ["类型"] = "SpellTagHandler",
                ["打印信息"] = false,
                ["m_trigger"] = "释放魔法时",
                ["优先级"] = 5,
                ["冷却"] = 0,
                ["每级增强"] = 1,
                ["几率"] = 0,
                ["升级增加数值"] = {
                    {
                        ["paramName"] = "修改数值倍率",
                        ["number"] = 1
                    }
                }
            }
        }
    }),
    ["产量增加_额外概率提升_词条"] = TagType.New({
        ["名字"] = "产量增加_额外概率提升_词条",
        ["最高等级"] = 10,
        ["描述"] = [[夜晚击败僵尸后额外获得阳光的几率提升
白天的阳光产量提升 ]],
        ["详细属性"] = [[击败僵尸后额外获得阳光几率+[1.几率]%
阳光产量+[2.威力增加]% ]],
        ["功能"] = {
            {
                ["影响魔法关键字"] = "",
                ["即将击杀"] = true,
                ["要求元素类型"] = "无",
                ["增伤"] = 0,
                ["增加暴击率"] = 0,
                ["增加暴击伤害"] = 0,
                ["属性增伤倍率"] = 1,
                ["释放魔法"] = {
                    {
                        ["魔法"] = "向日葵_阳光获取"
                    }
                },
                ["释放魔法继承威力"] = false,
                ["释放魔法威力增加"] = 0,
                ["类型"] = "DamageTagHandler",
                ["打印信息"] = false,
                ["m_trigger"] = "攻击时",
                ["优先级"] = 5,
                ["冷却"] = 0,
                ["每级增强"] = 1,
                ["几率"] = 5,
                ["条件"] = {
                    {
                        ["目标"] = "场景对象",
                        ["目标场景名"] = "terrain/昼夜交替/山坡月亮",
                        ["条件类型"] = "AxisPositionCondition",
                        ["条件"] = {
                            ["轴"] = "Y",
                            ["最小值"] = 0,
                            ["最大值"] = 100
                        },
                        ["动作"] = "必须"
                    }
                },
                ["升级增加数值"] = {
                    {
                        ["paramName"] = "几率",
                        ["number"] = 0.2
                    }
                }
            },
            {
                ["影响魔法"] = {
                    "向日葵_阳光获取"
                },
                ["影响魔法关键字"] = "",
                ["威力增加"] = 7,
                ["威力增加表达式"] = "",
                ["取消"] = false,
                ["修改数值倍率"] = 1,
                ["释放魔法继承威力"] = false,
                ["释放魔法威力增加"] = 0,
                ["类型"] = "SpellTagHandler",
                ["打印信息"] = false,
                ["m_trigger"] = "释放魔法时",
                ["优先级"] = 5,
                ["冷却"] = 0,
                ["每级增强"] = 1,
                ["几率"] = 0,
                ["条件"] = {
                    {
                        ["目标"] = "场景对象",
                        ["目标场景名"] = "terrain/昼夜交替/山坡太阳",
                        ["条件类型"] = "AxisPositionCondition",
                        ["条件"] = {
                            ["轴"] = "Y",
                            ["最小值"] = 0,
                            ["最大值"] = 100
                        },
                        ["动作"] = "必须"
                    }
                },
                ["升级增加数值"] = {
                    {
                        ["paramName"] = "威力增加",
                        ["number"] = 1
                    }
                }
            }
        }
    }),
    ["伤害提升_产量增加_词条"] = TagType.New({
        ["名字"] = "伤害提升_产量增加_词条",
        ["最高等级"] = 10,
        ["描述"] = [[所有植物造成的伤害提升
白天的阳光产量提升 ]],
        ["详细属性"] = [[植物伤害+[1.属性增伤.1]
阳光产量+[2.威力增加]% ]],
        ["功能"] = {
            {
                ["影响魔法关键字"] = "",
                ["即将击杀"] = false,
                ["要求元素类型"] = "无",
                ["增伤"] = 0,
                ["增加暴击率"] = 0,
                ["增加暴击伤害"] = 0,
                ["属性增伤"] = {
                    {
                        ["倍率"] = 2,
                        ["增加类型"] = "增加",
                        ["乘以基础数值"] = false
                    }
                },
                ["属性增伤倍率"] = 1,
                ["释放魔法继承威力"] = false,
                ["释放魔法威力增加"] = 0,
                ["类型"] = "DamageTagHandler",
                ["打印信息"] = false,
                ["m_trigger"] = "攻击时",
                ["优先级"] = 5,
                ["冷却"] = 0,
                ["每级增强"] = 1,
                ["几率"] = 0,
                ["升级增加数值"] = {
                    {
                        ["paramName"] = "属性增伤倍率",
                        ["number"] = 1
                    }
                }
            },
            {
                ["影响魔法"] = {
                    "向日葵_阳光获取"
                },
                ["影响魔法关键字"] = "",
                ["威力增加"] = 5,
                ["威力增加表达式"] = "",
                ["取消"] = false,
                ["修改数值倍率"] = 1,
                ["释放魔法继承威力"] = false,
                ["释放魔法威力增加"] = 0,
                ["类型"] = "SpellTagHandler",
                ["打印信息"] = false,
                ["m_trigger"] = "释放魔法时",
                ["优先级"] = 5,
                ["冷却"] = 0,
                ["每级增强"] = 1,
                ["几率"] = 0,
                ["条件"] = {
                    {
                        ["目标"] = "场景对象",
                        ["目标场景名"] = "terrain/昼夜交替/山坡太阳",
                        ["条件类型"] = "AxisPositionCondition",
                        ["条件"] = {
                            ["轴"] = "Y",
                            ["最小值"] = 0,
                            ["最大值"] = 100
                        },
                        ["动作"] = "必须"
                    }
                },
                ["升级增加数值"] = {
                    {
                        ["paramName"] = "威力增加",
                        ["number"] = 1
                    }
                }
            }
        }
    }),
    ["向日葵_阳光产量提升2_词条"] = TagType.New({
        ["名字"] = "向日葵_阳光产量提升2_词条",
        ["最高等级"] = 10,
        ["描述"] = "白天的阳光产量提升",
        ["详细属性"] = "阳光产量+[1.威力增加]%",
        ["功能"] = {
            {
                ["影响魔法"] = {
                    "向日葵_阳光获取"
                },
                ["影响魔法关键字"] = "向日葵",
                ["威力增加"] = 10,
                ["威力增加表达式"] = "",
                ["取消"] = false,
                ["修改数值倍率"] = 1,
                ["释放魔法继承威力"] = false,
                ["释放魔法威力增加"] = 0,
                ["类型"] = "SpellTagHandler",
                ["打印信息"] = false,
                ["m_trigger"] = "释放魔法时",
                ["优先级"] = 5,
                ["冷却"] = 0,
                ["每级增强"] = 1,
                ["几率"] = 0,
                ["条件"] = {
                    {
                        ["目标"] = "场景对象",
                        ["目标场景名"] = "terrain/昼夜交替/山坡太阳",
                        ["条件类型"] = "AxisPositionCondition",
                        ["条件"] = {
                            ["轴"] = "Y",
                            ["最小值"] = 0,
                            ["最大值"] = 100
                        },
                        ["动作"] = "必须"
                    }
                },
                ["升级增加数值"] = {
                    {
                        ["paramName"] = "威力增加",
                        ["number"] = 1
                    }
                }
            }
        }
    }),
    ["向日葵_阳光产量提升_词条"] = TagType.New({
        ["名字"] = "向日葵_阳光产量提升_词条",
        ["最高等级"] = 10,
        ["描述"] = "白天的阳光产量提升",
        ["详细属性"] = "阳光产量+[1.威力增加]%",
        ["功能"] = {
            {
                ["影响魔法"] = {
                    "向日葵_阳光获取"
                },
                ["影响魔法关键字"] = "向日葵",
                ["威力增加"] = 5,
                ["威力增加表达式"] = "",
                ["取消"] = false,
                ["修改数值倍率"] = 1,
                ["释放魔法继承威力"] = false,
                ["释放魔法威力增加"] = 0,
                ["类型"] = "SpellTagHandler",
                ["打印信息"] = false,
                ["m_trigger"] = "释放魔法时",
                ["优先级"] = 5,
                ["冷却"] = 0,
                ["每级增强"] = 1,
                ["几率"] = 0,
                ["条件"] = {
                    {
                        ["目标"] = "场景对象",
                        ["目标场景名"] = "terrain/昼夜交替/山坡太阳",
                        ["条件类型"] = "AxisPositionCondition",
                        ["条件"] = {
                            ["轴"] = "Y",
                            ["最小值"] = 0,
                            ["最大值"] = 1000
                        },
                        ["动作"] = "必须"
                    }
                },
                ["升级增加数值"] = {
                    {
                        ["paramName"] = "威力增加",
                        ["number"] = 1
                    }
                }
            }
        }
    }),
    ["向日葵_额外获得阳光_词条"] = TagType.New({
        ["名字"] = "向日葵_额外获得阳光_词条",
        ["最高等级"] = 10,
        ["描述"] = "夜晚击败僵尸后额外获得阳光的几率提升",
        ["详细属性"] = "击败僵尸后额外获得阳光几率+[1.几率]%",
        ["功能"] = {
            {
                ["影响魔法关键字"] = "",
                ["即将击杀"] = true,
                ["要求元素类型"] = "无",
                ["增伤"] = 0,
                ["增加暴击率"] = 0,
                ["增加暴击伤害"] = 0,
                ["属性增伤倍率"] = 1,
                ["释放魔法"] = {
                    {
                        ["魔法"] = "向日葵_阳光获取"
                    }
                },
                ["释放魔法继承威力"] = false,
                ["释放魔法威力增加"] = 0,
                ["类型"] = "DamageTagHandler",
                ["打印信息"] = false,
                ["m_trigger"] = "攻击时",
                ["优先级"] = 5,
                ["冷却"] = 0,
                ["每级增强"] = 1,
                ["几率"] = 5,
                ["条件"] = {
                    {
                        ["目标"] = "场景对象",
                        ["目标场景名"] = "terrain/昼夜交替/山坡月亮",
                        ["条件类型"] = "AxisPositionCondition",
                        ["条件"] = {
                            ["轴"] = "Y",
                            ["最小值"] = 0,
                            ["最大值"] = 100
                        },
                        ["动作"] = "必须"
                    }
                },
                ["升级增加数值"] = {
                    {
                        ["paramName"] = "几率",
                        ["number"] = 0.35
                    }
                }
            }
        }
    }),
    ["持续伤害_词条_大喷菇"] = TagType.New({
        ["名字"] = "持续伤害_词条_大喷菇",
        ["最高等级"] = 20,
        ["描述"] = "持续伤害增加",
        ["详细属性"] = "持续伤害+[1.增伤]%",
        ["功能"] = {
            {
                ["影响魔法"] = {
                    "胆小菇_dot"
                },
                ["影响魔法关键字"] = "",
                ["即将击杀"] = false,
                ["要求元素类型"] = "毒",
                ["增伤"] = 5,
                ["增加暴击率"] = 0,
                ["增加暴击伤害"] = 0,
                ["属性增伤倍率"] = 1,
                ["释放魔法继承威力"] = false,
                ["释放魔法威力增加"] = 0,
                ["类型"] = "DamageTagHandler",
                ["打印信息"] = false,
                ["m_trigger"] = "攻击时",
                ["优先级"] = 5,
                ["冷却"] = 0,
                ["每级增强"] = 1,
                ["几率"] = 0,
                ["升级增加数值"] = {
                    {
                        ["paramName"] = "增伤",
                        ["number"] = 1
                    }
                }
            }
        }
    }),
    ["攻击1_词条_大喷菇"] = TagType.New({
        ["名字"] = "攻击1_词条_大喷菇",
        ["最高等级"] = 20,
        ["描述"] = "伤害增加",
        ["详细属性"] = "伤害 +[1.增伤]%",
        ["功能"] = {
            {
                ["影响魔法关键字"] = "大喷菇",
                ["即将击杀"] = false,
                ["要求元素类型"] = "无",
                ["增伤"] = 10,
                ["增加暴击率"] = 0,
                ["增加暴击伤害"] = 0,
                ["属性增伤倍率"] = 1,
                ["释放魔法继承威力"] = false,
                ["释放魔法威力增加"] = 0,
                ["类型"] = "DamageTagHandler",
                ["打印信息"] = false,
                ["m_trigger"] = "攻击时",
                ["优先级"] = 5,
                ["冷却"] = 0,
                ["每级增强"] = 1,
                ["几率"] = 0,
                ["升级增加数值"] = {
                    {
                        ["paramName"] = "增伤",
                        ["number"] = 1
                    }
                }
            }
        }
    }),
    ["射速1_词条_小喷菇"] = TagType.New({
        ["名字"] = "射速1_词条_小喷菇",
        ["最高等级"] = 10,
        ["描述"] = "射速增加",
        ["详细属性"] = "射速 +[1.修改数值.1]%",
        ["功能"] = {
            {
                ["影响魔法关键字"] = "小喷菇",
                ["威力增加"] = 0,
                ["威力增加表达式"] = "",
                ["取消"] = false,
                ["修改数值"] = {
                    {
                        ["objectName"] = "伤害魔法",
                        ["paramName"] = "冷却加速",
                        ["paramValue"] = {
                            ["倍率"] = 5,
                            ["增加类型"] = "增加",
                            ["乘以基础数值"] = false
                        },
                        ["isAlways"] = false
                    }
                },
                ["修改数值倍率"] = 1,
                ["释放魔法继承威力"] = false,
                ["释放魔法威力增加"] = 0,
                ["类型"] = "SpellTagHandler",
                ["打印信息"] = false,
                ["m_trigger"] = "释放魔法时",
                ["优先级"] = 5,
                ["冷却"] = 0,
                ["每级增强"] = 1,
                ["几率"] = 0,
                ["升级增加数值"] = {
                    {
                        ["paramName"] = "修改数值倍率",
                        ["number"] = 1
                    }
                }
            }
        }
    }),
    ["攻击1_词条_小喷菇"] = TagType.New({
        ["名字"] = "攻击1_词条_小喷菇",
        ["最高等级"] = 10,
        ["描述"] = "伤害增加",
        ["详细属性"] = "伤害 +[1.增伤]%",
        ["功能"] = {
            {
                ["影响魔法关键字"] = "小喷菇",
                ["即将击杀"] = false,
                ["要求元素类型"] = "无",
                ["增伤"] = 5,
                ["增加暴击率"] = 0,
                ["增加暴击伤害"] = 0,
                ["属性增伤倍率"] = 1,
                ["释放魔法继承威力"] = false,
                ["释放魔法威力增加"] = 0,
                ["类型"] = "DamageTagHandler",
                ["打印信息"] = false,
                ["m_trigger"] = "攻击时",
                ["优先级"] = 5,
                ["冷却"] = 0,
                ["每级增强"] = 1,
                ["几率"] = 0,
                ["升级增加数值"] = {
                    {
                        ["paramName"] = "增伤",
                        ["number"] = 1
                    }
                }
            }
        }
    }),
    ["生命1_词条_小喷菇"] = TagType.New({
        ["名字"] = "生命1_词条_小喷菇",
        ["最高等级"] = 10,
        ["描述"] = "生命增加",
        ["详细属性"] = "生命+[1.增加]",
        ["功能"] = {
            {
                ["属性"] = "生命",
                ["增加"] = 10,
                ["百分比"] = false,
                ["类型"] = "AttributeTagHandler",
                ["打印信息"] = false,
                ["m_trigger"] = "生命",
                ["优先级"] = 5,
                ["冷却"] = 0,
                ["每级增强"] = 1,
                ["几率"] = 0,
                ["升级增加数值"] = {
                    {
                        ["paramName"] = "增加",
                        ["number"] = 1
                    }
                }
            }
        }
    }),
    ["持续伤害_词条_胆小菇"] = TagType.New({
        ["名字"] = "持续伤害_词条_胆小菇",
        ["最高等级"] = 10,
        ["描述"] = "持续伤害提升",
        ["详细属性"] = "持续伤害+[1.增伤]%",
        ["功能"] = {
            {
                ["影响魔法"] = {
                    "胆小菇_dot"
                },
                ["影响魔法关键字"] = "",
                ["即将击杀"] = false,
                ["要求元素类型"] = "毒",
                ["增伤"] = 10,
                ["增加暴击率"] = 0,
                ["增加暴击伤害"] = 0,
                ["属性增伤倍率"] = 1,
                ["释放魔法继承威力"] = false,
                ["释放魔法威力增加"] = 0,
                ["类型"] = "DamageTagHandler",
                ["打印信息"] = false,
                ["m_trigger"] = "攻击时",
                ["优先级"] = 5,
                ["冷却"] = 0,
                ["每级增强"] = 1,
                ["几率"] = 0,
                ["升级增加数值"] = {
                    {
                        ["paramName"] = "增伤",
                        ["number"] = 1
                    }
                }
            }
        }
    }),
    ["攻击1_词条_胆小菇"] = TagType.New({
        ["名字"] = "攻击1_词条_胆小菇",
        ["最高等级"] = 10,
        ["描述"] = "伤害增加",
        ["详细属性"] = "伤害 +[1.增伤]%",
        ["功能"] = {
            {
                ["影响魔法关键字"] = "小喷菇",
                ["即将击杀"] = false,
                ["要求元素类型"] = "无",
                ["增伤"] = 5,
                ["增加暴击率"] = 0,
                ["增加暴击伤害"] = 0,
                ["属性增伤倍率"] = 1,
                ["释放魔法继承威力"] = false,
                ["释放魔法威力增加"] = 0,
                ["类型"] = "DamageTagHandler",
                ["打印信息"] = false,
                ["m_trigger"] = "攻击时",
                ["优先级"] = 5,
                ["冷却"] = 0,
                ["每级增强"] = 1,
                ["几率"] = 0,
                ["升级增加数值"] = {
                    {
                        ["paramName"] = "增伤",
                        ["number"] = 1
                    }
                }
            }
        }
    }),
    ["减速1_词条_寒冰射手"] = TagType.New({
        ["名字"] = "减速1_词条_寒冰射手",
        ["最高等级"] = 10,
        ["描述"] = "减速持续时间增加",
        ["详细属性"] = "减速时间 +[1.修改数值.1]%",
        ["功能"] = {
            {
                ["影响魔法"] = {
                    "减速BUFF"
                },
                ["影响魔法关键字"] = "",
                ["威力增加"] = 0,
                ["威力增加表达式"] = "",
                ["取消"] = false,
                ["修改数值"] = {
                    {
                        ["objectName"] = "减速BUFF",
                        ["paramName"] = "持续时间",
                        ["paramValue"] = {
                            ["倍率"] = 2,
                            ["增加类型"] = "倍率",
                            ["乘以基础数值"] = false
                        },
                        ["isAlways"] = false
                    }
                },
                ["修改数值倍率"] = 1,
                ["释放魔法继承威力"] = false,
                ["释放魔法威力增加"] = 0,
                ["类型"] = "SpellTagHandler",
                ["打印信息"] = false,
                ["m_trigger"] = "释放魔法时",
                ["优先级"] = 5,
                ["冷却"] = 0,
                ["每级增强"] = 1,
                ["几率"] = 0,
                ["升级增加数值"] = {
                    {
                        ["paramName"] = "修改数值倍率",
                        ["number"] = 1
                    }
                }
            }
        }
    }),
    ["攻击1_词条_寒冰射手"] = TagType.New({
        ["名字"] = "攻击1_词条_寒冰射手",
        ["最高等级"] = 10,
        ["描述"] = "伤害增加",
        ["详细属性"] = "伤害 +[1.增伤]%",
        ["功能"] = {
            {
                ["影响魔法关键字"] = "寒冰射手",
                ["即将击杀"] = false,
                ["要求元素类型"] = "无",
                ["增伤"] = 5,
                ["增加暴击率"] = 0,
                ["增加暴击伤害"] = 0,
                ["属性增伤倍率"] = 1,
                ["释放魔法继承威力"] = false,
                ["释放魔法威力增加"] = 0,
                ["类型"] = "DamageTagHandler",
                ["打印信息"] = false,
                ["m_trigger"] = "攻击时",
                ["优先级"] = 5,
                ["冷却"] = 0,
                ["每级增强"] = 1,
                ["几率"] = 0,
                ["升级增加数值"] = {
                    {
                        ["paramName"] = "增伤",
                        ["number"] = 1
                    }
                }
            }
        }
    }),
    ["生命1_词条_寒冰射手"] = TagType.New({
        ["名字"] = "生命1_词条_寒冰射手",
        ["最高等级"] = 10,
        ["描述"] = "生命增加",
        ["详细属性"] = "生命+[1.增加]",
        ["功能"] = {
            {
                ["属性"] = "生命",
                ["增加"] = 10,
                ["百分比"] = false,
                ["类型"] = "AttributeTagHandler",
                ["打印信息"] = false,
                ["m_trigger"] = "生命",
                ["优先级"] = 5,
                ["冷却"] = 0,
                ["每级增强"] = 1,
                ["几率"] = 0,
                ["升级增加数值"] = {
                    {
                        ["paramName"] = "增加",
                        ["number"] = 1
                    }
                }
            }
        }
    }),
    ["冷冻1_词条_寒冰加特林"] = TagType.New({
        ["名字"] = "冷冻1_词条_寒冰加特林",
        ["最高等级"] = 10,
        ["描述"] = "造成冷冻的概率提升",
        ["详细属性"] = "冷冻概率 +[1.修改数值.1]%",
        ["功能"] = {
            {
                ["影响魔法"] = {
                    "冰冻BUFF"
                },
                ["影响魔法关键字"] = "",
                ["威力增加"] = 0,
                ["威力增加表达式"] = "",
                ["取消"] = false,
                ["修改数值"] = {
                    {
                        ["objectName"] = "冰冻BUFF",
                        ["paramName"] = "几率",
                        ["paramValue"] = {
                            ["倍率"] = 1.5,
                            ["增加类型"] = "倍率",
                            ["乘以基础数值"] = false
                        },
                        ["isAlways"] = false
                    }
                },
                ["修改数值倍率"] = 1,
                ["释放魔法继承威力"] = false,
                ["释放魔法威力增加"] = 0,
                ["类型"] = "SpellTagHandler",
                ["打印信息"] = false,
                ["m_trigger"] = "释放魔法时",
                ["优先级"] = 5,
                ["冷却"] = 0,
                ["每级增强"] = 1,
                ["几率"] = 0,
                ["升级增加数值"] = {
                    {
                        ["paramName"] = "修改数值倍率",
                        ["number"] = 1
                    }
                }
            }
        }
    }),
    ["减速1_词条_寒冰加特林"] = TagType.New({
        ["名字"] = "减速1_词条_寒冰加特林",
        ["最高等级"] = 10,
        ["描述"] = "减速持续时间增加",
        ["详细属性"] = "减速时间+[1.修改数值.1]%",
        ["功能"] = {
            {
                ["影响魔法关键字"] = "",
                ["威力增加"] = 0,
                ["威力增加表达式"] = "",
                ["取消"] = false,
                ["修改数值"] = {
                    {
                        ["objectName"] = "减速BUFF",
                        ["paramName"] = "持续时间",
                        ["paramValue"] = {
                            ["倍率"] = 5,
                            ["增加类型"] = "倍率",
                            ["乘以基础数值"] = false
                        },
                        ["isAlways"] = false
                    }
                },
                ["修改数值倍率"] = 1,
                ["释放魔法继承威力"] = false,
                ["释放魔法威力增加"] = 0,
                ["类型"] = "SpellTagHandler",
                ["打印信息"] = false,
                ["m_trigger"] = "释放魔法时",
                ["优先级"] = 5,
                ["冷却"] = 0,
                ["每级增强"] = 1,
                ["几率"] = 0,
                ["升级增加数值"] = {
                    {
                        ["paramName"] = "修改数值倍率",
                        ["number"] = 1
                    }
                }
            }
        }
    }),
    ["持续伤害_词条_寒冰加特林"] = TagType.New({
        ["名字"] = "持续伤害_词条_寒冰加特林",
        ["最高等级"] = 10,
        ["描述"] = "持续伤害增加",
        ["详细属性"] = "持续伤害+[1.增伤]%",
        ["功能"] = {
            {
                ["影响魔法"] = {
                    "寒冰加特林_dot"
                },
                ["影响魔法关键字"] = "",
                ["即将击杀"] = false,
                ["要求元素类型"] = "无",
                ["增伤"] = 5,
                ["增加暴击率"] = 0,
                ["增加暴击伤害"] = 0,
                ["属性增伤倍率"] = 1,
                ["释放魔法继承威力"] = false,
                ["释放魔法威力增加"] = 0,
                ["类型"] = "DamageTagHandler",
                ["打印信息"] = false,
                ["m_trigger"] = "攻击时",
                ["优先级"] = 5,
                ["冷却"] = 0,
                ["每级增强"] = 1,
                ["几率"] = 0,
                ["升级增加数值"] = {
                    {
                        ["paramName"] = "增伤",
                        ["number"] = 1
                    }
                }
            }
        }
    }),
    ["攻击1_词条_寒冰加特林"] = TagType.New({
        ["名字"] = "攻击1_词条_寒冰加特林",
        ["最高等级"] = 10,
        ["描述"] = "伤害增加",
        ["详细属性"] = "伤害 +[1.增伤]%",
        ["功能"] = {
            {
                ["影响魔法关键字"] = "寒冰加特林",
                ["即将击杀"] = false,
                ["要求元素类型"] = "无",
                ["增伤"] = 8,
                ["增加暴击率"] = 0,
                ["增加暴击伤害"] = 0,
                ["属性增伤倍率"] = 1,
                ["释放魔法继承威力"] = false,
                ["释放魔法威力增加"] = 0,
                ["类型"] = "DamageTagHandler",
                ["打印信息"] = false,
                ["m_trigger"] = "攻击时",
                ["优先级"] = 5,
                ["冷却"] = 0,
                ["每级增强"] = 1,
                ["几率"] = 0,
                ["升级增加数值"] = {
                    {
                        ["paramName"] = "增伤",
                        ["number"] = 1
                    }
                }
            }
        }
    }),
    ["攻击1_词条_火焰豌豆"] = TagType.New({
        ["名字"] = "攻击1_词条_火焰豌豆",
        ["最高等级"] = 10,
        ["描述"] = "伤害增加",
        ["详细属性"] = "伤害 +[1.增伤]%",
        ["功能"] = {
            {
                ["影响魔法关键字"] = "火焰豌豆",
                ["即将击杀"] = false,
                ["要求元素类型"] = "无",
                ["增伤"] = 10,
                ["增加暴击率"] = 0,
                ["增加暴击伤害"] = 0,
                ["属性增伤倍率"] = 1,
                ["释放魔法继承威力"] = false,
                ["释放魔法威力增加"] = 0,
                ["类型"] = "DamageTagHandler",
                ["打印信息"] = false,
                ["m_trigger"] = "攻击时",
                ["优先级"] = 5,
                ["冷却"] = 0,
                ["每级增强"] = 1,
                ["几率"] = 0,
                ["升级增加数值"] = {
                    {
                        ["paramName"] = "增伤",
                        ["number"] = 1
                    }
                }
            }
        }
    }),
    ["射速1_词条_三头豌豆"] = TagType.New({
        ["名字"] = "射速1_词条_三头豌豆",
        ["最高等级"] = 10,
        ["描述"] = "射速增加",
        ["详细属性"] = "射速 +[1.修改数值.1]%",
        ["功能"] = {
            {
                ["影响魔法关键字"] = "三头豌豆",
                ["威力增加"] = 0,
                ["威力增加表达式"] = "",
                ["取消"] = false,
                ["修改数值"] = {
                    {
                        ["objectName"] = "伤害魔法",
                        ["paramName"] = "冷却加速",
                        ["paramValue"] = {
                            ["倍率"] = 6,
                            ["增加类型"] = "增加",
                            ["乘以基础数值"] = false
                        },
                        ["isAlways"] = false
                    }
                },
                ["修改数值倍率"] = 1,
                ["释放魔法继承威力"] = false,
                ["释放魔法威力增加"] = 0,
                ["类型"] = "SpellTagHandler",
                ["打印信息"] = false,
                ["m_trigger"] = "释放魔法时",
                ["优先级"] = 5,
                ["冷却"] = 0,
                ["每级增强"] = 1,
                ["几率"] = 0,
                ["升级增加数值"] = {
                    {
                        ["paramName"] = "修改数值倍率",
                        ["number"] = 1
                    }
                }
            }
        }
    }),
    ["射速1_词条_高速射手"] = TagType.New({
        ["名字"] = "射速1_词条_高速射手",
        ["最高等级"] = 10,
        ["描述"] = "射速增加",
        ["详细属性"] = "射速 +[1.修改数值.1]%",
        ["功能"] = {
            {
                ["影响魔法关键字"] = "高速射手",
                ["威力增加"] = 0,
                ["威力增加表达式"] = "",
                ["取消"] = false,
                ["修改数值"] = {
                    {
                        ["objectName"] = "伤害魔法",
                        ["paramName"] = "冷却加速",
                        ["paramValue"] = {
                            ["倍率"] = 6,
                            ["增加类型"] = "增加",
                            ["乘以基础数值"] = false
                        },
                        ["isAlways"] = false
                    }
                },
                ["修改数值倍率"] = 1,
                ["释放魔法继承威力"] = false,
                ["释放魔法威力增加"] = 0,
                ["类型"] = "SpellTagHandler",
                ["打印信息"] = false,
                ["m_trigger"] = "释放魔法时",
                ["优先级"] = 5,
                ["冷却"] = 0,
                ["每级增强"] = 1,
                ["几率"] = 0,
                ["升级增加数值"] = {
                    {
                        ["paramName"] = "修改数值倍率",
                        ["number"] = 1
                    }
                }
            }
        }
    }),
    ["射速1_词条_高速加特林"] = TagType.New({
        ["名字"] = "射速1_词条_高速加特林",
        ["最高等级"] = 10,
        ["描述"] = "射速增加",
        ["详细属性"] = "射速 +[1.修改数值.1]%",
        ["功能"] = {
            {
                ["影响魔法关键字"] = "高速加特林",
                ["威力增加"] = 0,
                ["威力增加表达式"] = "",
                ["取消"] = false,
                ["修改数值"] = {
                    {
                        ["objectName"] = "伤害魔法",
                        ["paramName"] = "冷却加速",
                        ["paramValue"] = {
                            ["倍率"] = 8,
                            ["增加类型"] = "增加",
                            ["乘以基础数值"] = false
                        },
                        ["isAlways"] = false
                    }
                },
                ["修改数值倍率"] = 1,
                ["释放魔法继承威力"] = false,
                ["释放魔法威力增加"] = 0,
                ["类型"] = "SpellTagHandler",
                ["打印信息"] = false,
                ["m_trigger"] = "释放魔法时",
                ["优先级"] = 5,
                ["冷却"] = 0,
                ["每级增强"] = 1,
                ["几率"] = 0,
                ["升级增加数值"] = {
                    {
                        ["paramName"] = "修改数值倍率",
                        ["number"] = 1
                    }
                }
            }
        }
    }),
    ["射速1_词条_双头豌豆"] = TagType.New({
        ["名字"] = "射速1_词条_双头豌豆",
        ["最高等级"] = 10,
        ["描述"] = "射速增加",
        ["详细属性"] = "射速 +[1.修改数值.1]%",
        ["功能"] = {
            {
                ["影响魔法关键字"] = "双发豌豆",
                ["威力增加"] = 0,
                ["威力增加表达式"] = "",
                ["取消"] = false,
                ["修改数值"] = {
                    {
                        ["objectName"] = "伤害魔法",
                        ["paramName"] = "冷却加速",
                        ["paramValue"] = {
                            ["倍率"] = 5,
                            ["增加类型"] = "增加",
                            ["乘以基础数值"] = false
                        },
                        ["isAlways"] = false
                    }
                },
                ["修改数值倍率"] = 1,
                ["释放魔法继承威力"] = false,
                ["释放魔法威力增加"] = 0,
                ["类型"] = "SpellTagHandler",
                ["打印信息"] = false,
                ["m_trigger"] = "释放魔法时",
                ["优先级"] = 5,
                ["冷却"] = 0,
                ["每级增强"] = 1,
                ["几率"] = 0,
                ["升级增加数值"] = {
                    {
                        ["paramName"] = "修改数值倍率",
                        ["number"] = 1
                    }
                }
            }
        }
    }),
    ["攻击1_词条_双头豌豆"] = TagType.New({
        ["名字"] = "攻击1_词条_双头豌豆",
        ["最高等级"] = 10,
        ["描述"] = "伤害增加",
        ["详细属性"] = "伤害 +[1.增伤]%",
        ["功能"] = {
            {
                ["影响魔法关键字"] = "双发豌豆",
                ["即将击杀"] = false,
                ["要求元素类型"] = "无",
                ["增伤"] = 5,
                ["增加暴击率"] = 0,
                ["增加暴击伤害"] = 0,
                ["属性增伤倍率"] = 1,
                ["释放魔法继承威力"] = false,
                ["释放魔法威力增加"] = 0,
                ["类型"] = "DamageTagHandler",
                ["打印信息"] = false,
                ["m_trigger"] = "攻击时",
                ["优先级"] = 5,
                ["冷却"] = 0,
                ["每级增强"] = 1,
                ["几率"] = 0,
                ["升级增加数值"] = {
                    {
                        ["paramName"] = "增伤",
                        ["number"] = 1
                    }
                }
            }
        }
    }),
    ["射速1_词条_豌豆射手"] = TagType.New({
        ["名字"] = "射速1_词条_豌豆射手",
        ["最高等级"] = 10,
        ["描述"] = "射速增加",
        ["详细属性"] = "射速 +[1.修改数值.1]%",
        ["功能"] = {
            {
                ["影响魔法关键字"] = "豌豆射手",
                ["威力增加"] = 0,
                ["威力增加表达式"] = "",
                ["取消"] = false,
                ["修改数值"] = {
                    {
                        ["objectName"] = "伤害魔法",
                        ["paramName"] = "冷却加速",
                        ["paramValue"] = {
                            ["倍率"] = 2,
                            ["增加类型"] = "增加",
                            ["乘以基础数值"] = false
                        },
                        ["isAlways"] = false
                    }
                },
                ["修改数值倍率"] = 1,
                ["释放魔法继承威力"] = false,
                ["释放魔法威力增加"] = 0,
                ["类型"] = "SpellTagHandler",
                ["打印信息"] = false,
                ["m_trigger"] = "释放魔法时",
                ["优先级"] = 5,
                ["冷却"] = 0,
                ["每级增强"] = 1,
                ["几率"] = 0,
                ["升级增加数值"] = {
                    {
                        ["paramName"] = "修改数值倍率",
                        ["number"] = 1
                    }
                }
            }
        }
    }),
    ["攻击1_词条_豌豆射手"] = TagType.New({
        ["名字"] = "攻击1_词条_豌豆射手",
        ["最高等级"] = 10,
        ["描述"] = "伤害增加",
        ["详细属性"] = "伤害 +[1.属性增伤.1]",
        ["功能"] = {
            {
                ["影响魔法关键字"] = "豌豆射手",
                ["即将击杀"] = false,
                ["要求元素类型"] = "无",
                ["增伤"] = 20,
                ["增加暴击率"] = 0,
                ["增加暴击伤害"] = 0,
                ["属性增伤"] = {
                    {
                        ["倍率"] = 5,
                        ["增加类型"] = "增加",
                        ["乘以基础数值"] = false
                    }
                },
                ["属性增伤倍率"] = 1,
                ["释放魔法继承威力"] = false,
                ["释放魔法威力增加"] = 0,
                ["类型"] = "DamageTagHandler",
                ["打印信息"] = false,
                ["m_trigger"] = "攻击时",
                ["优先级"] = 5,
                ["冷却"] = 0,
                ["每级增强"] = 1,
                ["几率"] = 0,
                ["升级增加数值"] = {
                    {
                        ["paramName"] = "属性增伤倍率",
                        ["number"] = 1
                    }
                }
            }
        }
    }),
    ["生命1_词条_豌豆射手"] = TagType.New({
        ["名字"] = "生命1_词条_豌豆射手",
        ["最高等级"] = 10,
        ["描述"] = "生命增加",
        ["详细属性"] = "生命+[1.增加]",
        ["功能"] = {
            {
                ["属性"] = "生命",
                ["增加"] = 10,
                ["百分比"] = false,
                ["类型"] = "AttributeTagHandler",
                ["打印信息"] = false,
                ["m_trigger"] = "生命",
                ["优先级"] = 5,
                ["冷却"] = 0,
                ["每级增强"] = 1,
                ["几率"] = 0,
                ["升级增加数值"] = {
                    {
                        ["paramName"] = "增加",
                        ["number"] = 1
                    }
                }
            }
        }
    }),
    ["副-地刺-词条"] = TagType.New({
        ["名字"] = "副-地刺-词条",
        ["最高等级"] = 100,
        ["详细属性"] = "伤害: {[地刺_dot.属性增伤.1.倍率]*100*(1+[1.威力增加])}%",
        ["功能"] = {
            {
                ["影响魔法"] = {
                    "地刺_脉冲"
                },
                ["影响魔法关键字"] = "",
                ["威力增加"] = 0.05,
                ["威力增加表达式"] = "",
                ["取消"] = false,
                ["修改数值倍率"] = 1,
                ["释放魔法继承威力"] = false,
                ["释放魔法威力增加"] = 0,
                ["类型"] = "SpellTagHandler",
                ["打印信息"] = false,
                ["m_trigger"] = "释放魔法时",
                ["优先级"] = 5,
                ["冷却"] = 0,
                ["每级增强"] = 1,
                ["几率"] = 0,
                ["升级增加数值"] = {
                    {
                        ["paramName"] = "威力增加",
                        ["number"] = 1
                    }
                }
            }
        },
        ["各级描述"] = {
            "伤害: 189%",
            "伤害: 198%",
            "伤害: 207%",
            "伤害: 216%",
            "伤害: 225%",
            "伤害: 234%",
            "伤害: 243%",
            "伤害: 252%",
            "伤害: 261%",
            "伤害: 270%",
            "伤害: 279%",
            "伤害: 288%",
            "伤害: 297%",
            "伤害: 306%",
            "伤害: 315%",
            "伤害: 324%",
            "伤害: 333%",
            "伤害: 342%",
            "伤害: 351%",
            "伤害: 360%",
            "伤害: 369%",
            "伤害: 378%",
            "伤害: 387%",
            "伤害: 396%",
            "伤害: 405%",
            "伤害: 414%",
            "伤害: 423%",
            "伤害: 432%",
            "伤害: 441%",
            "伤害: 450%",
            "伤害: 459%",
            "伤害: 468%",
            "伤害: 477%",
            "伤害: 486%",
            "伤害: 495%",
            "伤害: 504%",
            "伤害: 513%",
            "伤害: 522%",
            "伤害: 531%",
            "伤害: 540%",
            "伤害: 549%",
            "伤害: 558%",
            "伤害: 567%",
            "伤害: 576%",
            "伤害: 585%",
            "伤害: 594%",
            "伤害: 603%",
            "伤害: 612%",
            "伤害: 621%",
            "伤害: 630%",
            "伤害: 639%",
            "伤害: 648%",
            "伤害: 657%",
            "伤害: 666%",
            "伤害: 675%",
            "伤害: 684%",
            "伤害: 693%",
            "伤害: 702%",
            "伤害: 711%",
            "伤害: 720%",
            "伤害: 729%",
            "伤害: 738%",
            "伤害: 747%",
            "伤害: 756%",
            "伤害: 765%",
            "伤害: 774%",
            "伤害: 783%",
            "伤害: 792%",
            "伤害: 801%",
            "伤害: 810%",
            "伤害: 819%",
            "伤害: 828%",
            "伤害: 837%",
            "伤害: 846%",
            "伤害: 855%",
            "伤害: 864%",
            "伤害: 873%",
            "伤害: 882%",
            "伤害: 891%",
            "伤害: 900%",
            "伤害: 909%",
            "伤害: 918%",
            "伤害: 927%",
            "伤害: 936%",
            "伤害: 945%",
            "伤害: 954%",
            "伤害: 963%",
            "伤害: 972%",
            "伤害: 981%",
            "伤害: 990%",
            "伤害: 999%",
            "伤害: 1008%",
            "伤害: 1017%",
            "伤害: 1026%",
            "伤害: 1035%",
            "伤害: 1044%",
            "伤害: 1053%",
            "伤害: 1062%",
            "伤害: 1071%",
            "伤害: 1080%"
        }
    }),
    ["副-坚果-词条"] = TagType.New({
        ["名字"] = "副-坚果-词条",
        ["最高等级"] = 100,
        ["详细属性"] = "[1.属性乘以百分比]",
        ["功能"] = {
            {
                ["影响怪物"] = {
                    "副-召唤物-坚果"
                },
                ["影响关键字"] = "",
                ["属性乘以百分比"] = {
                    ["生命"] = "6",
                    ["仇恨"] = "5"
                },
                ["额外属性倍率"] = 1,
                ["额外词条等级"] = 1,
                ["类型"] = "SummonTagHandler",
                ["打印信息"] = false,
                ["m_trigger"] = "召唤时",
                ["优先级"] = 5,
                ["冷却"] = 0,
                ["每级增强"] = 1,
                ["几率"] = 0,
                ["升级增加数值"] = {
                    {
                        ["paramName"] = "额外属性倍率",
                        ["number"] = 1
                    }
                }
            }
        }
    }),
    ["副-樱桃炸弹-词条"] = TagType.New({
        ["名字"] = "副-樱桃炸弹-词条",
        ["最高等级"] = 100,
        ["详细属性"] = "伤害: {[副_樱桃炸弹_飞弹_范围_伤害.属性增伤.1.倍率]*100*(1+[1.威力增加])}%",
        ["功能"] = {
            {
                ["影响魔法"] = {
                    "副_樱桃炸弹_飞弹_范围_伤害"
                },
                ["影响魔法关键字"] = "",
                ["威力增加"] = 0.05,
                ["威力增加表达式"] = "",
                ["取消"] = false,
                ["修改数值倍率"] = 1,
                ["释放魔法继承威力"] = false,
                ["释放魔法威力增加"] = 0,
                ["类型"] = "SpellTagHandler",
                ["打印信息"] = false,
                ["m_trigger"] = "释放魔法时",
                ["优先级"] = 5,
                ["冷却"] = 0,
                ["每级增强"] = 1,
                ["几率"] = 0,
                ["升级增加数值"] = {
                    {
                        ["paramName"] = "威力增加",
                        ["number"] = 1
                    }
                }
            }
        },
        ["各级描述"] = {
            "伤害: 210%",
            "伤害: 220%",
            "伤害: 230%",
            "伤害: 240%",
            "伤害: 250%",
            "伤害: 260%",
            "伤害: 270%",
            "伤害: 280%",
            "伤害: 290%",
            "伤害: 300%",
            "伤害: 310%",
            "伤害: 320%",
            "伤害: 330%",
            "伤害: 340%",
            "伤害: 350%",
            "伤害: 360%",
            "伤害: 370%",
            "伤害: 380%",
            "伤害: 390%",
            "伤害: 400%",
            "伤害: 410%",
            "伤害: 420%",
            "伤害: 430%",
            "伤害: 440%",
            "伤害: 450%",
            "伤害: 460%",
            "伤害: 470%",
            "伤害: 480%",
            "伤害: 490%",
            "伤害: 500%",
            "伤害: 510%",
            "伤害: 520%",
            "伤害: 530%",
            "伤害: 540%",
            "伤害: 550%",
            "伤害: 560%",
            "伤害: 570%",
            "伤害: 580%",
            "伤害: 590%",
            "伤害: 600%",
            "伤害: 610%",
            "伤害: 620%",
            "伤害: 630%",
            "伤害: 640%",
            "伤害: 650%",
            "伤害: 660%",
            "伤害: 670%",
            "伤害: 680%",
            "伤害: 690%",
            "伤害: 700%",
            "伤害: 710%",
            "伤害: 720%",
            "伤害: 730%",
            "伤害: 740%",
            "伤害: 750%",
            "伤害: 760%",
            "伤害: 770%",
            "伤害: 780%",
            "伤害: 790%",
            "伤害: 800%",
            "伤害: 810%",
            "伤害: 820%",
            "伤害: 830%",
            "伤害: 840%",
            "伤害: 850%",
            "伤害: 860%",
            "伤害: 870%",
            "伤害: 880%",
            "伤害: 890%",
            "伤害: 900%",
            "伤害: 910%",
            "伤害: 920%",
            "伤害: 930%",
            "伤害: 940%",
            "伤害: 950%",
            "伤害: 960%",
            "伤害: 970%",
            "伤害: 980%",
            "伤害: 990%",
            "伤害: 1000%",
            "伤害: 1010%",
            "伤害: 1020%",
            "伤害: 1030%",
            "伤害: 1040%",
            "伤害: 1050%",
            "伤害: 1060%",
            "伤害: 1070%",
            "伤害: 1080%",
            "伤害: 1090%",
            "伤害: 1100%",
            "伤害: 1110%",
            "伤害: 1120%",
            "伤害: 1130%",
            "伤害: 1140%",
            "伤害: 1150%",
            "伤害: 1160%",
            "伤害: 1170%",
            "伤害: 1180%",
            "伤害: 1190%",
            "伤害: 1200%"
        }
    }),
    ["副-菜问-词条"] = TagType.New({
        ["名字"] = "副-菜问-词条",
        ["最高等级"] = 100,
        ["详细属性"] = [[生命：{[副_菜问召唤.额外召唤物属性.1.属性增伤.倍率]*100*(1+[1.属性乘以百分比.生命]/100)}%
攻击：{[副_菜问召唤.额外召唤物属性.2.属性增伤.倍率]*100*(1+[1.属性乘以百分比.攻击]/100)}% ]],
        ["功能"] = {
            {
                ["影响怪物"] = {
                    "副-召唤物-菜问"
                },
                ["影响关键字"] = "",
                ["属性乘以百分比"] = {
                    ["生命"] = "5",
                    ["攻击"] = "5"
                },
                ["额外属性倍率"] = 1,
                ["额外词条等级"] = 1,
                ["类型"] = "SummonTagHandler",
                ["打印信息"] = false,
                ["m_trigger"] = "召唤时",
                ["优先级"] = 5,
                ["冷却"] = 0,
                ["每级增强"] = 1,
                ["几率"] = 0,
                ["升级增加数值"] = {
                    {
                        ["paramName"] = "额外属性倍率",
                        ["number"] = 1
                    }
                }
            }
        },
        ["各级描述"] = {
            [[生命：210%
攻击：32% ]],
            [[生命：220%
攻击：33% ]],
            [[生命：230%
攻击：35% ]],
            [[生命：240%
攻击：36% ]],
            [[生命：250%
攻击：38% ]],
            [[生命：260%
攻击：39% ]],
            [[生命：270%
攻击：41% ]],
            [[生命：280%
攻击：42% ]],
            [[生命：290%
攻击：44% ]],
            [[生命：300%
攻击：45% ]],
            [[生命：310%
攻击：47% ]],
            [[生命：320%
攻击：48% ]],
            [[生命：330%
攻击：50% ]],
            [[生命：340%
攻击：51% ]],
            [[生命：350%
攻击：53% ]],
            [[生命：360%
攻击：54% ]],
            [[生命：370%
攻击：56% ]],
            [[生命：380%
攻击：57% ]],
            [[生命：390%
攻击：59% ]],
            [[生命：400%
攻击：60% ]],
            [[生命：410%
攻击：62% ]],
            [[生命：420%
攻击：63% ]],
            [[生命：430%
攻击：65% ]],
            [[生命：440%
攻击：66% ]],
            [[生命：450%
攻击：68% ]],
            [[生命：460%
攻击：69% ]],
            [[生命：470%
攻击：71% ]],
            [[生命：480%
攻击：72% ]],
            [[生命：490%
攻击：74% ]],
            [[生命：500%
攻击：75% ]],
            [[生命：510%
攻击：77% ]],
            [[生命：520%
攻击：78% ]],
            [[生命：530%
攻击：80% ]],
            [[生命：540%
攻击：81% ]],
            [[生命：550%
攻击：83% ]],
            [[生命：560%
攻击：84% ]],
            [[生命：570%
攻击：86% ]],
            [[生命：580%
攻击：87% ]],
            [[生命：590%
攻击：89% ]],
            [[生命：600%
攻击：90% ]],
            [[生命：610%
攻击：92% ]],
            [[生命：620%
攻击：93% ]],
            [[生命：630%
攻击：95% ]],
            [[生命：640%
攻击：96% ]],
            [[生命：650%
攻击：98% ]],
            [[生命：660%
攻击：99% ]],
            [[生命：670%
攻击：101% ]],
            [[生命：680%
攻击：102% ]],
            [[生命：690%
攻击：104% ]],
            [[生命：700%
攻击：105% ]],
            [[生命：710%
攻击：107% ]],
            [[生命：720%
攻击：108% ]],
            [[生命：730%
攻击：110% ]],
            [[生命：740%
攻击：111% ]],
            [[生命：750%
攻击：113% ]],
            [[生命：760%
攻击：114% ]],
            [[生命：770%
攻击：116% ]],
            [[生命：780%
攻击：117% ]],
            [[生命：790%
攻击：119% ]],
            [[生命：800%
攻击：120% ]],
            [[生命：810%
攻击：122% ]],
            [[生命：820%
攻击：123% ]],
            [[生命：830%
攻击：125% ]],
            [[生命：840%
攻击：126% ]],
            [[生命：850%
攻击：128% ]],
            [[生命：860%
攻击：129% ]],
            [[生命：870%
攻击：131% ]],
            [[生命：880%
攻击：132% ]],
            [[生命：890%
攻击：134% ]],
            [[生命：900%
攻击：135% ]],
            [[生命：910%
攻击：137% ]],
            [[生命：920%
攻击：138% ]],
            [[生命：930%
攻击：140% ]],
            [[生命：940%
攻击：141% ]],
            [[生命：950%
攻击：143% ]],
            [[生命：960%
攻击：144% ]],
            [[生命：970%
攻击：146% ]],
            [[生命：980%
攻击：147% ]],
            [[生命：990%
攻击：149% ]],
            [[生命：1000%
攻击：150% ]],
            [[生命：1010%
攻击：152% ]],
            [[生命：1020%
攻击：153% ]],
            [[生命：1030%
攻击：155% ]],
            [[生命：1040%
攻击：156% ]],
            [[生命：1050%
攻击：158% ]],
            [[生命：1060%
攻击：159% ]],
            [[生命：1070%
攻击：161% ]],
            [[生命：1080%
攻击：162% ]],
            [[生命：1090%
攻击：164% ]],
            [[生命：1100%
攻击：165% ]],
            [[生命：1110%
攻击：167% ]],
            [[生命：1120%
攻击：168% ]],
            [[生命：1130%
攻击：170% ]],
            [[生命：1140%
攻击：171% ]],
            [[生命：1150%
攻击：173% ]],
            [[生命：1160%
攻击：174% ]],
            [[生命：1170%
攻击：176% ]],
            [[生命：1180%
攻击：177% ]],
            [[生命：1190%
攻击：179% ]],
            [[生命：1200%
攻击：180% ]]
        }
    }),
    ["副-仙人掌-词条"] = TagType.New({
        ["名字"] = "副-仙人掌-词条",
        ["最高等级"] = 100,
        ["详细属性"] = [[生命：{[副_召唤_仙人掌.额外召唤物属性.1.属性增伤.倍率]*100*(1+[1.属性乘以百分比.生命]/100)}%
攻击：{[副_召唤_仙人掌.额外召唤物属性.2.属性增伤.倍率]*100*(1+[1.属性乘以百分比.攻击]/100)}% ]],
        ["功能"] = {
            {
                ["影响怪物"] = {
                    "副-召唤物-仙人掌"
                },
                ["影响关键字"] = "",
                ["属性乘以百分比"] = {
                    ["攻击"] = "5",
                    ["生命"] = "5"
                },
                ["额外属性倍率"] = 1,
                ["额外词条等级"] = 1,
                ["类型"] = "SummonTagHandler",
                ["打印信息"] = false,
                ["m_trigger"] = "召唤时",
                ["优先级"] = 5,
                ["冷却"] = 0,
                ["每级增强"] = 1,
                ["几率"] = 0,
                ["升级增加数值"] = {
                    {
                        ["paramName"] = "额外属性倍率",
                        ["number"] = 1
                    }
                }
            }
        },
        ["各级描述"] = {
            [[生命：210%
攻击：21% ]],
            [[生命：220%
攻击：22% ]],
            [[生命：230%
攻击：23% ]],
            [[生命：240%
攻击：24% ]],
            [[生命：250%
攻击：25% ]],
            [[生命：260%
攻击：26% ]],
            [[生命：270%
攻击：27% ]],
            [[生命：280%
攻击：28% ]],
            [[生命：290%
攻击：29% ]],
            [[生命：300%
攻击：30% ]],
            [[生命：310%
攻击：31% ]],
            [[生命：320%
攻击：32% ]],
            [[生命：330%
攻击：33% ]],
            [[生命：340%
攻击：34% ]],
            [[生命：350%
攻击：35% ]],
            [[生命：360%
攻击：36% ]],
            [[生命：370%
攻击：37% ]],
            [[生命：380%
攻击：38% ]],
            [[生命：390%
攻击：39% ]],
            [[生命：400%
攻击：40% ]],
            [[生命：410%
攻击：41% ]],
            [[生命：420%
攻击：42% ]],
            [[生命：430%
攻击：43% ]],
            [[生命：440%
攻击：44% ]],
            [[生命：450%
攻击：45% ]],
            [[生命：460%
攻击：46% ]],
            [[生命：470%
攻击：47% ]],
            [[生命：480%
攻击：48% ]],
            [[生命：490%
攻击：49% ]],
            [[生命：500%
攻击：50% ]],
            [[生命：510%
攻击：51% ]],
            [[生命：520%
攻击：52% ]],
            [[生命：530%
攻击：53% ]],
            [[生命：540%
攻击：54% ]],
            [[生命：550%
攻击：55% ]],
            [[生命：560%
攻击：56% ]],
            [[生命：570%
攻击：57% ]],
            [[生命：580%
攻击：58% ]],
            [[生命：590%
攻击：59% ]],
            [[生命：600%
攻击：60% ]],
            [[生命：610%
攻击：61% ]],
            [[生命：620%
攻击：62% ]],
            [[生命：630%
攻击：63% ]],
            [[生命：640%
攻击：64% ]],
            [[生命：650%
攻击：65% ]],
            [[生命：660%
攻击：66% ]],
            [[生命：670%
攻击：67% ]],
            [[生命：680%
攻击：68% ]],
            [[生命：690%
攻击：69% ]],
            [[生命：700%
攻击：70% ]],
            [[生命：710%
攻击：71% ]],
            [[生命：720%
攻击：72% ]],
            [[生命：730%
攻击：73% ]],
            [[生命：740%
攻击：74% ]],
            [[生命：750%
攻击：75% ]],
            [[生命：760%
攻击：76% ]],
            [[生命：770%
攻击：77% ]],
            [[生命：780%
攻击：78% ]],
            [[生命：790%
攻击：79% ]],
            [[生命：800%
攻击：80% ]],
            [[生命：810%
攻击：81% ]],
            [[生命：820%
攻击：82% ]],
            [[生命：830%
攻击：83% ]],
            [[生命：840%
攻击：84% ]],
            [[生命：850%
攻击：85% ]],
            [[生命：860%
攻击：86% ]],
            [[生命：870%
攻击：87% ]],
            [[生命：880%
攻击：88% ]],
            [[生命：890%
攻击：89% ]],
            [[生命：900%
攻击：90% ]],
            [[生命：910%
攻击：91% ]],
            [[生命：920%
攻击：92% ]],
            [[生命：930%
攻击：93% ]],
            [[生命：940%
攻击：94% ]],
            [[生命：950%
攻击：95% ]],
            [[生命：960%
攻击：96% ]],
            [[生命：970%
攻击：97% ]],
            [[生命：980%
攻击：98% ]],
            [[生命：990%
攻击：99% ]],
            [[生命：1000%
攻击：100% ]],
            [[生命：1010%
攻击：101% ]],
            [[生命：1020%
攻击：102% ]],
            [[生命：1030%
攻击：103% ]],
            [[生命：1040%
攻击：104% ]],
            [[生命：1050%
攻击：105% ]],
            [[生命：1060%
攻击：106% ]],
            [[生命：1070%
攻击：107% ]],
            [[生命：1080%
攻击：108% ]],
            [[生命：1090%
攻击：109% ]],
            [[生命：1100%
攻击：110% ]],
            [[生命：1110%
攻击：111% ]],
            [[生命：1120%
攻击：112% ]],
            [[生命：1130%
攻击：113% ]],
            [[生命：1140%
攻击：114% ]],
            [[生命：1150%
攻击：115% ]],
            [[生命：1160%
攻击：116% ]],
            [[生命：1170%
攻击：117% ]],
            [[生命：1180%
攻击：118% ]],
            [[生命：1190%
攻击：119% ]],
            [[生命：1200%
攻击：120% ]]
        }
    }),
    ["副-椰子炮-词条"] = TagType.New({
        ["名字"] = "副-椰子炮-词条",
        ["最高等级"] = 100,
        ["详细属性"] = [[生命：{[副_召唤_椰子炮.额外召唤物属性.1.属性增伤.倍率]*100*(1+[1.属性乘以百分比.生命]/100)}%
攻击：{[副_召唤_椰子炮.额外召唤物属性.2.属性增伤.倍率]*100*(1+[1.属性乘以百分比.攻击]/100)}% ]],
        ["功能"] = {
            {
                ["影响怪物"] = {
                    "副-召唤物-椰子炮"
                },
                ["影响关键字"] = "",
                ["属性乘以百分比"] = {
                    ["生命"] = "5",
                    ["攻击"] = "5"
                },
                ["额外属性倍率"] = 1,
                ["额外词条等级"] = 1,
                ["类型"] = "SummonTagHandler",
                ["打印信息"] = false,
                ["m_trigger"] = "召唤时",
                ["优先级"] = 5,
                ["冷却"] = 0,
                ["每级增强"] = 1,
                ["几率"] = 0,
                ["升级增加数值"] = {
                    {
                        ["paramName"] = "额外属性倍率",
                        ["number"] = 1
                    }
                }
            }
        },
        ["各级描述"] = {
            [[生命：210%
攻击：42% ]],
            [[生命：220%
攻击：44% ]],
            [[生命：230%
攻击：46% ]],
            [[生命：240%
攻击：48% ]],
            [[生命：250%
攻击：50% ]],
            [[生命：260%
攻击：52% ]],
            [[生命：270%
攻击：54% ]],
            [[生命：280%
攻击：56% ]],
            [[生命：290%
攻击：58% ]],
            [[生命：300%
攻击：60% ]],
            [[生命：310%
攻击：62% ]],
            [[生命：320%
攻击：64% ]],
            [[生命：330%
攻击：66% ]],
            [[生命：340%
攻击：68% ]],
            [[生命：350%
攻击：70% ]],
            [[生命：360%
攻击：72% ]],
            [[生命：370%
攻击：74% ]],
            [[生命：380%
攻击：76% ]],
            [[生命：390%
攻击：78% ]],
            [[生命：400%
攻击：80% ]],
            [[生命：410%
攻击：82% ]],
            [[生命：420%
攻击：84% ]],
            [[生命：430%
攻击：86% ]],
            [[生命：440%
攻击：88% ]],
            [[生命：450%
攻击：90% ]],
            [[生命：460%
攻击：92% ]],
            [[生命：470%
攻击：94% ]],
            [[生命：480%
攻击：96% ]],
            [[生命：490%
攻击：98% ]],
            [[生命：500%
攻击：100% ]],
            [[生命：510%
攻击：102% ]],
            [[生命：520%
攻击：104% ]],
            [[生命：530%
攻击：106% ]],
            [[生命：540%
攻击：108% ]],
            [[生命：550%
攻击：110% ]],
            [[生命：560%
攻击：112% ]],
            [[生命：570%
攻击：114% ]],
            [[生命：580%
攻击：116% ]],
            [[生命：590%
攻击：118% ]],
            [[生命：600%
攻击：120% ]],
            [[生命：610%
攻击：122% ]],
            [[生命：620%
攻击：124% ]],
            [[生命：630%
攻击：126% ]],
            [[生命：640%
攻击：128% ]],
            [[生命：650%
攻击：130% ]],
            [[生命：660%
攻击：132% ]],
            [[生命：670%
攻击：134% ]],
            [[生命：680%
攻击：136% ]],
            [[生命：690%
攻击：138% ]],
            [[生命：700%
攻击：140% ]],
            [[生命：710%
攻击：142% ]],
            [[生命：720%
攻击：144% ]],
            [[生命：730%
攻击：146% ]],
            [[生命：740%
攻击：148% ]],
            [[生命：750%
攻击：150% ]],
            [[生命：760%
攻击：152% ]],
            [[生命：770%
攻击：154% ]],
            [[生命：780%
攻击：156% ]],
            [[生命：790%
攻击：158% ]],
            [[生命：800%
攻击：160% ]],
            [[生命：810%
攻击：162% ]],
            [[生命：820%
攻击：164% ]],
            [[生命：830%
攻击：166% ]],
            [[生命：840%
攻击：168% ]],
            [[生命：850%
攻击：170% ]],
            [[生命：860%
攻击：172% ]],
            [[生命：870%
攻击：174% ]],
            [[生命：880%
攻击：176% ]],
            [[生命：890%
攻击：178% ]],
            [[生命：900%
攻击：180% ]],
            [[生命：910%
攻击：182% ]],
            [[生命：920%
攻击：184% ]],
            [[生命：930%
攻击：186% ]],
            [[生命：940%
攻击：188% ]],
            [[生命：950%
攻击：190% ]],
            [[生命：960%
攻击：192% ]],
            [[生命：970%
攻击：194% ]],
            [[生命：980%
攻击：196% ]],
            [[生命：990%
攻击：198% ]],
            [[生命：1000%
攻击：200% ]],
            [[生命：1010%
攻击：202% ]],
            [[生命：1020%
攻击：204% ]],
            [[生命：1030%
攻击：206% ]],
            [[生命：1040%
攻击：208% ]],
            [[生命：1050%
攻击：210% ]],
            [[生命：1060%
攻击：212% ]],
            [[生命：1070%
攻击：214% ]],
            [[生命：1080%
攻击：216% ]],
            [[生命：1090%
攻击：218% ]],
            [[生命：1100%
攻击：220% ]],
            [[生命：1110%
攻击：222% ]],
            [[生命：1120%
攻击：224% ]],
            [[生命：1130%
攻击：226% ]],
            [[生命：1140%
攻击：228% ]],
            [[生命：1150%
攻击：230% ]],
            [[生命：1160%
攻击：232% ]],
            [[生命：1170%
攻击：234% ]],
            [[生命：1180%
攻击：236% ]],
            [[生命：1190%
攻击：238% ]],
            [[生命：1200%
攻击：240% ]]
        }
    }),
    ["副-火爆辣椒-词条"] = TagType.New({
        ["名字"] = "副-火爆辣椒-词条",
        ["最高等级"] = 100,
        ["详细属性"] = [[爆炸伤害： {[副-火爆辣椒-飞弹-范围-伤害.属性增伤.1.倍率]*100*(1+[1.威力增加])}%
点燃伤害： {[副-火爆辣椒_持续伤害.属性增伤.1.倍率]*100*(1+[1.威力增加])}% ]],
        ["功能"] = {
            {
                ["影响魔法关键字"] = "",
                ["威力增加"] = 0.05,
                ["威力增加表达式"] = "",
                ["取消"] = false,
                ["修改数值倍率"] = 1,
                ["释放魔法继承威力"] = false,
                ["释放魔法威力增加"] = 0,
                ["类型"] = "SpellTagHandler",
                ["打印信息"] = false,
                ["m_trigger"] = "释放魔法时",
                ["优先级"] = 5,
                ["冷却"] = 0,
                ["每级增强"] = 1,
                ["几率"] = 0,
                ["升级增加数值"] = {
                    {
                        ["paramName"] = "威力增加",
                        ["number"] = 1
                    }
                }
            }
        },
        ["各级描述"] = {
            [[爆炸伤害： 231%
点燃伤害： 63% ]],
            [[爆炸伤害： 242%
点燃伤害： 66% ]],
            [[爆炸伤害： 253%
点燃伤害： 69% ]],
            [[爆炸伤害： 264%
点燃伤害： 72% ]],
            [[爆炸伤害： 275%
点燃伤害： 75% ]],
            [[爆炸伤害： 286%
点燃伤害： 78% ]],
            [[爆炸伤害： 297%
点燃伤害： 81% ]],
            [[爆炸伤害： 308%
点燃伤害： 84% ]],
            [[爆炸伤害： 319%
点燃伤害： 87% ]],
            [[爆炸伤害： 330%
点燃伤害： 90% ]],
            [[爆炸伤害： 341%
点燃伤害： 93% ]],
            [[爆炸伤害： 352%
点燃伤害： 96% ]],
            [[爆炸伤害： 363%
点燃伤害： 99% ]],
            [[爆炸伤害： 374%
点燃伤害： 102% ]],
            [[爆炸伤害： 385%
点燃伤害： 105% ]],
            [[爆炸伤害： 396%
点燃伤害： 108% ]],
            [[爆炸伤害： 407%
点燃伤害： 111% ]],
            [[爆炸伤害： 418%
点燃伤害： 114% ]],
            [[爆炸伤害： 429%
点燃伤害： 117% ]],
            [[爆炸伤害： 440%
点燃伤害： 120% ]],
            [[爆炸伤害： 451%
点燃伤害： 123% ]],
            [[爆炸伤害： 462%
点燃伤害： 126% ]],
            [[爆炸伤害： 473%
点燃伤害： 129% ]],
            [[爆炸伤害： 484%
点燃伤害： 132% ]],
            [[爆炸伤害： 495%
点燃伤害： 135% ]],
            [[爆炸伤害： 506%
点燃伤害： 138% ]],
            [[爆炸伤害： 517%
点燃伤害： 141% ]],
            [[爆炸伤害： 528%
点燃伤害： 144% ]],
            [[爆炸伤害： 539%
点燃伤害： 147% ]],
            [[爆炸伤害： 550%
点燃伤害： 150% ]],
            [[爆炸伤害： 561%
点燃伤害： 153% ]],
            [[爆炸伤害： 572%
点燃伤害： 156% ]],
            [[爆炸伤害： 583%
点燃伤害： 159% ]],
            [[爆炸伤害： 594%
点燃伤害： 162% ]],
            [[爆炸伤害： 605%
点燃伤害： 165% ]],
            [[爆炸伤害： 616%
点燃伤害： 168% ]],
            [[爆炸伤害： 627%
点燃伤害： 171% ]],
            [[爆炸伤害： 638%
点燃伤害： 174% ]],
            [[爆炸伤害： 649%
点燃伤害： 177% ]],
            [[爆炸伤害： 660%
点燃伤害： 180% ]],
            [[爆炸伤害： 671%
点燃伤害： 183% ]],
            [[爆炸伤害： 682%
点燃伤害： 186% ]],
            [[爆炸伤害： 693%
点燃伤害： 189% ]],
            [[爆炸伤害： 704%
点燃伤害： 192% ]],
            [[爆炸伤害： 715%
点燃伤害： 195% ]],
            [[爆炸伤害： 726%
点燃伤害： 198% ]],
            [[爆炸伤害： 737%
点燃伤害： 201% ]],
            [[爆炸伤害： 748%
点燃伤害： 204% ]],
            [[爆炸伤害： 759%
点燃伤害： 207% ]],
            [[爆炸伤害： 770%
点燃伤害： 210% ]],
            [[爆炸伤害： 781%
点燃伤害： 213% ]],
            [[爆炸伤害： 792%
点燃伤害： 216% ]],
            [[爆炸伤害： 803%
点燃伤害： 219% ]],
            [[爆炸伤害： 814%
点燃伤害： 222% ]],
            [[爆炸伤害： 825%
点燃伤害： 225% ]],
            [[爆炸伤害： 836%
点燃伤害： 228% ]],
            [[爆炸伤害： 847%
点燃伤害： 231% ]],
            [[爆炸伤害： 858%
点燃伤害： 234% ]],
            [[爆炸伤害： 869%
点燃伤害： 237% ]],
            [[爆炸伤害： 880%
点燃伤害： 240% ]],
            [[爆炸伤害： 891%
点燃伤害： 243% ]],
            [[爆炸伤害： 902%
点燃伤害： 246% ]],
            [[爆炸伤害： 913%
点燃伤害： 249% ]],
            [[爆炸伤害： 924%
点燃伤害： 252% ]],
            [[爆炸伤害： 935%
点燃伤害： 255% ]],
            [[爆炸伤害： 946%
点燃伤害： 258% ]],
            [[爆炸伤害： 957%
点燃伤害： 261% ]],
            [[爆炸伤害： 968%
点燃伤害： 264% ]],
            [[爆炸伤害： 979%
点燃伤害： 267% ]],
            [[爆炸伤害： 990%
点燃伤害： 270% ]],
            [[爆炸伤害： 1001%
点燃伤害： 273% ]],
            [[爆炸伤害： 1012%
点燃伤害： 276% ]],
            [[爆炸伤害： 1023%
点燃伤害： 279% ]],
            [[爆炸伤害： 1034%
点燃伤害： 282% ]],
            [[爆炸伤害： 1045%
点燃伤害： 285% ]],
            [[爆炸伤害： 1056%
点燃伤害： 288% ]],
            [[爆炸伤害： 1067%
点燃伤害： 291% ]],
            [[爆炸伤害： 1078%
点燃伤害： 294% ]],
            [[爆炸伤害： 1089%
点燃伤害： 297% ]],
            [[爆炸伤害： 1100%
点燃伤害： 300% ]],
            [[爆炸伤害： 1111%
点燃伤害： 303% ]],
            [[爆炸伤害： 1122%
点燃伤害： 306% ]],
            [[爆炸伤害： 1133%
点燃伤害： 309% ]],
            [[爆炸伤害： 1144%
点燃伤害： 312% ]],
            [[爆炸伤害： 1155%
点燃伤害： 315% ]],
            [[爆炸伤害： 1166%
点燃伤害： 318% ]],
            [[爆炸伤害： 1177%
点燃伤害： 321% ]],
            [[爆炸伤害： 1188%
点燃伤害： 324% ]],
            [[爆炸伤害： 1199%
点燃伤害： 327% ]],
            [[爆炸伤害： 1210%
点燃伤害： 330% ]],
            [[爆炸伤害： 1221%
点燃伤害： 333% ]],
            [[爆炸伤害： 1232%
点燃伤害： 336% ]],
            [[爆炸伤害： 1243%
点燃伤害： 339% ]],
            [[爆炸伤害： 1254%
点燃伤害： 342% ]],
            [[爆炸伤害： 1265%
点燃伤害： 345% ]],
            [[爆炸伤害： 1276%
点燃伤害： 348% ]],
            [[爆炸伤害： 1287%
点燃伤害： 351% ]],
            [[爆炸伤害： 1298%
点燃伤害： 354% ]],
            [[爆炸伤害： 1309%
点燃伤害： 357% ]],
            [[爆炸伤害： 1320%
点燃伤害： 360% ]]
        }
    }),
    ["副-辣椒投手-词条"] = TagType.New({
        ["名字"] = "副-辣椒投手-词条",
        ["最高等级"] = 100,
        ["详细属性"] = [[生命：{[副_召唤_辣椒投手.额外召唤物属性.1.属性增伤.倍率]*100*(1+[1.属性乘以百分比.生命]/100)}%
攻击：{[副_召唤_辣椒投手.额外召唤物属性.2.属性增伤.倍率]*100*(1+[1.属性乘以百分比.攻击]/100)}%

点燃倍率：{[副_辣椒投手_持续伤害.属性增伤.1.倍率]*100}% ]],
        ["功能"] = {
            {
                ["影响怪物"] = {
                    "副-召唤物-辣椒投手"
                },
                ["影响关键字"] = "",
                ["属性乘以百分比"] = {
                    ["攻击"] = "5",
                    ["生命"] = "5"
                },
                ["额外属性倍率"] = 1,
                ["额外词条等级"] = 1,
                ["类型"] = "SummonTagHandler",
                ["打印信息"] = false,
                ["m_trigger"] = "召唤时",
                ["优先级"] = 5,
                ["冷却"] = 0,
                ["每级增强"] = 1,
                ["几率"] = 0,
                ["升级增加数值"] = {
                    {
                        ["paramName"] = "额外属性倍率",
                        ["number"] = 1
                    }
                }
            }
        },
        ["各级描述"] = {
            [[生命：210%
攻击：42%

点燃倍率：60% ]],
            [[生命：220%
攻击：44%

点燃倍率：60% ]],
            [[生命：230%
攻击：46%

点燃倍率：60% ]],
            [[生命：240%
攻击：48%

点燃倍率：60% ]],
            [[生命：250%
攻击：50%

点燃倍率：60% ]],
            [[生命：260%
攻击：52%

点燃倍率：60% ]],
            [[生命：270%
攻击：54%

点燃倍率：60% ]],
            [[生命：280%
攻击：56%

点燃倍率：60% ]],
            [[生命：290%
攻击：58%

点燃倍率：60% ]],
            [[生命：300%
攻击：60%

点燃倍率：60% ]],
            [[生命：310%
攻击：62%

点燃倍率：60% ]],
            [[生命：320%
攻击：64%

点燃倍率：60% ]],
            [[生命：330%
攻击：66%

点燃倍率：60% ]],
            [[生命：340%
攻击：68%

点燃倍率：60% ]],
            [[生命：350%
攻击：70%

点燃倍率：60% ]],
            [[生命：360%
攻击：72%

点燃倍率：60% ]],
            [[生命：370%
攻击：74%

点燃倍率：60% ]],
            [[生命：380%
攻击：76%

点燃倍率：60% ]],
            [[生命：390%
攻击：78%

点燃倍率：60% ]],
            [[生命：400%
攻击：80%

点燃倍率：60% ]],
            [[生命：410%
攻击：82%

点燃倍率：60% ]],
            [[生命：420%
攻击：84%

点燃倍率：60% ]],
            [[生命：430%
攻击：86%

点燃倍率：60% ]],
            [[生命：440%
攻击：88%

点燃倍率：60% ]],
            [[生命：450%
攻击：90%

点燃倍率：60% ]],
            [[生命：460%
攻击：92%

点燃倍率：60% ]],
            [[生命：470%
攻击：94%

点燃倍率：60% ]],
            [[生命：480%
攻击：96%

点燃倍率：60% ]],
            [[生命：490%
攻击：98%

点燃倍率：60% ]],
            [[生命：500%
攻击：100%

点燃倍率：60% ]],
            [[生命：510%
攻击：102%

点燃倍率：60% ]],
            [[生命：520%
攻击：104%

点燃倍率：60% ]],
            [[生命：530%
攻击：106%

点燃倍率：60% ]],
            [[生命：540%
攻击：108%

点燃倍率：60% ]],
            [[生命：550%
攻击：110%

点燃倍率：60% ]],
            [[生命：560%
攻击：112%

点燃倍率：60% ]],
            [[生命：570%
攻击：114%

点燃倍率：60% ]],
            [[生命：580%
攻击：116%

点燃倍率：60% ]],
            [[生命：590%
攻击：118%

点燃倍率：60% ]],
            [[生命：600%
攻击：120%

点燃倍率：60% ]],
            [[生命：610%
攻击：122%

点燃倍率：60% ]],
            [[生命：620%
攻击：124%

点燃倍率：60% ]],
            [[生命：630%
攻击：126%

点燃倍率：60% ]],
            [[生命：640%
攻击：128%

点燃倍率：60% ]],
            [[生命：650%
攻击：130%

点燃倍率：60% ]],
            [[生命：660%
攻击：132%

点燃倍率：60% ]],
            [[生命：670%
攻击：134%

点燃倍率：60% ]],
            [[生命：680%
攻击：136%

点燃倍率：60% ]],
            [[生命：690%
攻击：138%

点燃倍率：60% ]],
            [[生命：700%
攻击：140%

点燃倍率：60% ]],
            [[生命：710%
攻击：142%

点燃倍率：60% ]],
            [[生命：720%
攻击：144%

点燃倍率：60% ]],
            [[生命：730%
攻击：146%

点燃倍率：60% ]],
            [[生命：740%
攻击：148%

点燃倍率：60% ]],
            [[生命：750%
攻击：150%

点燃倍率：60% ]],
            [[生命：760%
攻击：152%

点燃倍率：60% ]],
            [[生命：770%
攻击：154%

点燃倍率：60% ]],
            [[生命：780%
攻击：156%

点燃倍率：60% ]],
            [[生命：790%
攻击：158%

点燃倍率：60% ]],
            [[生命：800%
攻击：160%

点燃倍率：60% ]],
            [[生命：810%
攻击：162%

点燃倍率：60% ]],
            [[生命：820%
攻击：164%

点燃倍率：60% ]],
            [[生命：830%
攻击：166%

点燃倍率：60% ]],
            [[生命：840%
攻击：168%

点燃倍率：60% ]],
            [[生命：850%
攻击：170%

点燃倍率：60% ]],
            [[生命：860%
攻击：172%

点燃倍率：60% ]],
            [[生命：870%
攻击：174%

点燃倍率：60% ]],
            [[生命：880%
攻击：176%

点燃倍率：60% ]],
            [[生命：890%
攻击：178%

点燃倍率：60% ]],
            [[生命：900%
攻击：180%

点燃倍率：60% ]],
            [[生命：910%
攻击：182%

点燃倍率：60% ]],
            [[生命：920%
攻击：184%

点燃倍率：60% ]],
            [[生命：930%
攻击：186%

点燃倍率：60% ]],
            [[生命：940%
攻击：188%

点燃倍率：60% ]],
            [[生命：950%
攻击：190%

点燃倍率：60% ]],
            [[生命：960%
攻击：192%

点燃倍率：60% ]],
            [[生命：970%
攻击：194%

点燃倍率：60% ]],
            [[生命：980%
攻击：196%

点燃倍率：60% ]],
            [[生命：990%
攻击：198%

点燃倍率：60% ]],
            [[生命：1000%
攻击：200%

点燃倍率：60% ]],
            [[生命：1010%
攻击：202%

点燃倍率：60% ]],
            [[生命：1020%
攻击：204%

点燃倍率：60% ]],
            [[生命：1030%
攻击：206%

点燃倍率：60% ]],
            [[生命：1040%
攻击：208%

点燃倍率：60% ]],
            [[生命：1050%
攻击：210%

点燃倍率：60% ]],
            [[生命：1060%
攻击：212%

点燃倍率：60% ]],
            [[生命：1070%
攻击：214%

点燃倍率：60% ]],
            [[生命：1080%
攻击：216%

点燃倍率：60% ]],
            [[生命：1090%
攻击：218%

点燃倍率：60% ]],
            [[生命：1100%
攻击：220%

点燃倍率：60% ]],
            [[生命：1110%
攻击：222%

点燃倍率：60% ]],
            [[生命：1120%
攻击：224%

点燃倍率：60% ]],
            [[生命：1130%
攻击：226%

点燃倍率：60% ]],
            [[生命：1140%
攻击：228%

点燃倍率：60% ]],
            [[生命：1150%
攻击：230%

点燃倍率：60% ]],
            [[生命：1160%
攻击：232%

点燃倍率：60% ]],
            [[生命：1170%
攻击：234%

点燃倍率：60% ]],
            [[生命：1180%
攻击：236%

点燃倍率：60% ]],
            [[生命：1190%
攻击：238%

点燃倍率：60% ]],
            [[生命：1200%
攻击：240%

点燃倍率：60% ]]
        }
    }),
    ["副-钢铁地刺-词条"] = TagType.New({
        ["名字"] = "副-钢铁地刺-词条",
        ["最高等级"] = 100,
        ["详细属性"] = [[伤害: {[钢铁地刺_dot.属性增伤.1.倍率]*100*(1+[1.威力增加])}%
范围：+{[1.修改数值.1.paramValue.倍率]}% ]],
        ["功能"] = {
            {
                ["影响魔法关键字"] = "",
                ["威力增加"] = 0.05,
                ["威力增加表达式"] = "",
                ["取消"] = false,
                ["修改数值"] = {
                    {
                        ["objectName"] = "钢铁地刺_脉冲",
                        ["paramName"] = "尺寸倍率",
                        ["paramValue"] = {
                            ["倍率"] = 1,
                            ["增加类型"] = "增加",
                            ["乘以基础数值"] = false
                        },
                        ["isAlways"] = false
                    }
                },
                ["修改数值倍率"] = 1,
                ["释放魔法继承威力"] = false,
                ["释放魔法威力增加"] = 0,
                ["类型"] = "SpellTagHandler",
                ["打印信息"] = false,
                ["m_trigger"] = "释放魔法时",
                ["优先级"] = 5,
                ["冷却"] = 0,
                ["每级增强"] = 1,
                ["几率"] = 0,
                ["升级增加数值"] = {
                    {
                        ["paramName"] = "威力增加",
                        ["number"] = 1
                    },
                    {
                        ["paramName"] = "修改数值倍率",
                        ["number"] = 1
                    }
                }
            }
        },
        ["各级描述"] = {
            [[伤害: 315%
范围：+1% ]],
            [[伤害: 330%
范围：+2% ]],
            [[伤害: 345%
范围：+3% ]],
            [[伤害: 360%
范围：+4% ]],
            [[伤害: 375%
范围：+5% ]],
            [[伤害: 390%
范围：+6% ]],
            [[伤害: 405%
范围：+7% ]],
            [[伤害: 420%
范围：+8% ]],
            [[伤害: 435%
范围：+9% ]],
            [[伤害: 450%
范围：+10% ]],
            [[伤害: 465%
范围：+11% ]],
            [[伤害: 480%
范围：+12% ]],
            [[伤害: 495%
范围：+13% ]],
            [[伤害: 510%
范围：+14% ]],
            [[伤害: 525%
范围：+15% ]],
            [[伤害: 540%
范围：+16% ]],
            [[伤害: 555%
范围：+17% ]],
            [[伤害: 570%
范围：+18% ]],
            [[伤害: 585%
范围：+19% ]],
            [[伤害: 600%
范围：+20% ]],
            [[伤害: 615%
范围：+21% ]],
            [[伤害: 630%
范围：+22% ]],
            [[伤害: 645%
范围：+23% ]],
            [[伤害: 660%
范围：+24% ]],
            [[伤害: 675%
范围：+25% ]],
            [[伤害: 690%
范围：+26% ]],
            [[伤害: 705%
范围：+27% ]],
            [[伤害: 720%
范围：+28% ]],
            [[伤害: 735%
范围：+29% ]],
            [[伤害: 750%
范围：+30% ]],
            [[伤害: 765%
范围：+31% ]],
            [[伤害: 780%
范围：+32% ]],
            [[伤害: 795%
范围：+33% ]],
            [[伤害: 810%
范围：+34% ]],
            [[伤害: 825%
范围：+35% ]],
            [[伤害: 840%
范围：+36% ]],
            [[伤害: 855%
范围：+37% ]],
            [[伤害: 870%
范围：+38% ]],
            [[伤害: 885%
范围：+39% ]],
            [[伤害: 900%
范围：+40% ]],
            [[伤害: 915%
范围：+41% ]],
            [[伤害: 930%
范围：+42% ]],
            [[伤害: 945%
范围：+43% ]],
            [[伤害: 960%
范围：+44% ]],
            [[伤害: 975%
范围：+45% ]],
            [[伤害: 990%
范围：+46% ]],
            [[伤害: 1005%
范围：+47% ]],
            [[伤害: 1020%
范围：+48% ]],
            [[伤害: 1035%
范围：+49% ]],
            [[伤害: 1050%
范围：+50% ]],
            [[伤害: 1065%
范围：+51% ]],
            [[伤害: 1080%
范围：+52% ]],
            [[伤害: 1095%
范围：+53% ]],
            [[伤害: 1110%
范围：+54% ]],
            [[伤害: 1125%
范围：+55% ]],
            [[伤害: 1140%
范围：+56% ]],
            [[伤害: 1155%
范围：+57% ]],
            [[伤害: 1170%
范围：+58% ]],
            [[伤害: 1185%
范围：+59% ]],
            [[伤害: 1200%
范围：+60% ]],
            [[伤害: 1215%
范围：+61% ]],
            [[伤害: 1230%
范围：+62% ]],
            [[伤害: 1245%
范围：+63% ]],
            [[伤害: 1260%
范围：+64% ]],
            [[伤害: 1275%
范围：+65% ]],
            [[伤害: 1290%
范围：+66% ]],
            [[伤害: 1305%
范围：+67% ]],
            [[伤害: 1320%
范围：+68% ]],
            [[伤害: 1335%
范围：+69% ]],
            [[伤害: 1350%
范围：+70% ]],
            [[伤害: 1365%
范围：+71% ]],
            [[伤害: 1380%
范围：+72% ]],
            [[伤害: 1395%
范围：+73% ]],
            [[伤害: 1410%
范围：+74% ]],
            [[伤害: 1425%
范围：+75% ]],
            [[伤害: 1440%
范围：+76% ]],
            [[伤害: 1455%
范围：+77% ]],
            [[伤害: 1470%
范围：+78% ]],
            [[伤害: 1485%
范围：+79% ]],
            [[伤害: 1500%
范围：+80% ]],
            [[伤害: 1515%
范围：+81% ]],
            [[伤害: 1530%
范围：+82% ]],
            [[伤害: 1545%
范围：+83% ]],
            [[伤害: 1560%
范围：+84% ]],
            [[伤害: 1575%
范围：+85% ]],
            [[伤害: 1590%
范围：+86% ]],
            [[伤害: 1605%
范围：+87% ]],
            [[伤害: 1620%
范围：+88% ]],
            [[伤害: 1635%
范围：+89% ]],
            [[伤害: 1650%
范围：+90% ]],
            [[伤害: 1665%
范围：+91% ]],
            [[伤害: 1680%
范围：+92% ]],
            [[伤害: 1695%
范围：+93% ]],
            [[伤害: 1710%
范围：+94% ]],
            [[伤害: 1725%
范围：+95% ]],
            [[伤害: 1740%
范围：+96% ]],
            [[伤害: 1755%
范围：+97% ]],
            [[伤害: 1770%
范围：+98% ]],
            [[伤害: 1785%
范围：+99% ]],
            [[伤害: 1800%
范围：+100% ]]
        }
    }),
    ["副-星星果-词条"] = TagType.New({
        ["名字"] = "副-星星果-词条",
        ["最高等级"] = 100,
        ["详细属性"] = [[生命：{[副_召唤_星星果.额外召唤物属性.1.属性增伤.倍率]*100*(1+[1.属性乘以百分比.生命]/100)}%
攻击：{[副_召唤_星星果.额外召唤物属性.2.属性增伤.倍率]*100*(1+[1.属性乘以百分比.攻击]/100)}% ]],
        ["功能"] = {
            {
                ["影响怪物"] = {
                    "副-召唤物-星星果"
                },
                ["影响关键字"] = "",
                ["属性乘以百分比"] = {
                    ["生命"] = "5",
                    ["攻击"] = "5"
                },
                ["额外属性倍率"] = 1,
                ["额外词条等级"] = 1,
                ["类型"] = "SummonTagHandler",
                ["打印信息"] = false,
                ["m_trigger"] = "召唤时",
                ["优先级"] = 5,
                ["冷却"] = 0,
                ["每级增强"] = 1,
                ["几率"] = 0,
                ["升级增加数值"] = {
                    {
                        ["paramName"] = "额外属性倍率",
                        ["number"] = 1
                    }
                }
            }
        },
        ["各级描述"] = {
            [[生命：210%
攻击：42% ]],
            [[生命：220%
攻击：44% ]],
            [[生命：230%
攻击：46% ]],
            [[生命：240%
攻击：48% ]],
            [[生命：250%
攻击：50% ]],
            [[生命：260%
攻击：52% ]],
            [[生命：270%
攻击：54% ]],
            [[生命：280%
攻击：56% ]],
            [[生命：290%
攻击：58% ]],
            [[生命：300%
攻击：60% ]],
            [[生命：310%
攻击：62% ]],
            [[生命：320%
攻击：64% ]],
            [[生命：330%
攻击：66% ]],
            [[生命：340%
攻击：68% ]],
            [[生命：350%
攻击：70% ]],
            [[生命：360%
攻击：72% ]],
            [[生命：370%
攻击：74% ]],
            [[生命：380%
攻击：76% ]],
            [[生命：390%
攻击：78% ]],
            [[生命：400%
攻击：80% ]],
            [[生命：410%
攻击：82% ]],
            [[生命：420%
攻击：84% ]],
            [[生命：430%
攻击：86% ]],
            [[生命：440%
攻击：88% ]],
            [[生命：450%
攻击：90% ]],
            [[生命：460%
攻击：92% ]],
            [[生命：470%
攻击：94% ]],
            [[生命：480%
攻击：96% ]],
            [[生命：490%
攻击：98% ]],
            [[生命：500%
攻击：100% ]],
            [[生命：510%
攻击：102% ]],
            [[生命：520%
攻击：104% ]],
            [[生命：530%
攻击：106% ]],
            [[生命：540%
攻击：108% ]],
            [[生命：550%
攻击：110% ]],
            [[生命：560%
攻击：112% ]],
            [[生命：570%
攻击：114% ]],
            [[生命：580%
攻击：116% ]],
            [[生命：590%
攻击：118% ]],
            [[生命：600%
攻击：120% ]],
            [[生命：610%
攻击：122% ]],
            [[生命：620%
攻击：124% ]],
            [[生命：630%
攻击：126% ]],
            [[生命：640%
攻击：128% ]],
            [[生命：650%
攻击：130% ]],
            [[生命：660%
攻击：132% ]],
            [[生命：670%
攻击：134% ]],
            [[生命：680%
攻击：136% ]],
            [[生命：690%
攻击：138% ]],
            [[生命：700%
攻击：140% ]],
            [[生命：710%
攻击：142% ]],
            [[生命：720%
攻击：144% ]],
            [[生命：730%
攻击：146% ]],
            [[生命：740%
攻击：148% ]],
            [[生命：750%
攻击：150% ]],
            [[生命：760%
攻击：152% ]],
            [[生命：770%
攻击：154% ]],
            [[生命：780%
攻击：156% ]],
            [[生命：790%
攻击：158% ]],
            [[生命：800%
攻击：160% ]],
            [[生命：810%
攻击：162% ]],
            [[生命：820%
攻击：164% ]],
            [[生命：830%
攻击：166% ]],
            [[生命：840%
攻击：168% ]],
            [[生命：850%
攻击：170% ]],
            [[生命：860%
攻击：172% ]],
            [[生命：870%
攻击：174% ]],
            [[生命：880%
攻击：176% ]],
            [[生命：890%
攻击：178% ]],
            [[生命：900%
攻击：180% ]],
            [[生命：910%
攻击：182% ]],
            [[生命：920%
攻击：184% ]],
            [[生命：930%
攻击：186% ]],
            [[生命：940%
攻击：188% ]],
            [[生命：950%
攻击：190% ]],
            [[生命：960%
攻击：192% ]],
            [[生命：970%
攻击：194% ]],
            [[生命：980%
攻击：196% ]],
            [[生命：990%
攻击：198% ]],
            [[生命：1000%
攻击：200% ]],
            [[生命：1010%
攻击：202% ]],
            [[生命：1020%
攻击：204% ]],
            [[生命：1030%
攻击：206% ]],
            [[生命：1040%
攻击：208% ]],
            [[生命：1050%
攻击：210% ]],
            [[生命：1060%
攻击：212% ]],
            [[生命：1070%
攻击：214% ]],
            [[生命：1080%
攻击：216% ]],
            [[生命：1090%
攻击：218% ]],
            [[生命：1100%
攻击：220% ]],
            [[生命：1110%
攻击：222% ]],
            [[生命：1120%
攻击：224% ]],
            [[生命：1130%
攻击：226% ]],
            [[生命：1140%
攻击：228% ]],
            [[生命：1150%
攻击：230% ]],
            [[生命：1160%
攻击：232% ]],
            [[生命：1170%
攻击：234% ]],
            [[生命：1180%
攻击：236% ]],
            [[生命：1190%
攻击：238% ]],
            [[生命：1200%
攻击：240% ]]
        }
    }),
    ["副-窝瓜-词条"] = TagType.New({
        ["名字"] = "副-窝瓜-词条",
        ["最高等级"] = 100,
        ["详细属性"] = "击中伤害： {[副_窝瓜_范围伤害.属性增伤.1.倍率]*100*(1+[1.威力增加])}%",
        ["功能"] = {
            {
                ["影响魔法"] = {
                    "副_窝瓜_飞弹"
                },
                ["影响魔法关键字"] = "",
                ["威力增加"] = 0.05,
                ["威力增加表达式"] = "",
                ["取消"] = false,
                ["修改数值倍率"] = 1,
                ["释放魔法继承威力"] = false,
                ["释放魔法威力增加"] = 0,
                ["类型"] = "SpellTagHandler",
                ["打印信息"] = false,
                ["m_trigger"] = "释放魔法时",
                ["优先级"] = 5,
                ["冷却"] = 0,
                ["每级增强"] = 1,
                ["几率"] = 0,
                ["升级增加数值"] = {
                    {
                        ["paramName"] = "威力增加",
                        ["number"] = 1
                    }
                }
            }
        },
        ["各级描述"] = {
            "击中伤害： 315%",
            "击中伤害： 330%",
            "击中伤害： 345%",
            "击中伤害： 360%",
            "击中伤害： 375%",
            "击中伤害： 390%",
            "击中伤害： 405%",
            "击中伤害： 420%",
            "击中伤害： 435%",
            "击中伤害： 450%",
            "击中伤害： 465%",
            "击中伤害： 480%",
            "击中伤害： 495%",
            "击中伤害： 510%",
            "击中伤害： 525%",
            "击中伤害： 540%",
            "击中伤害： 555%",
            "击中伤害： 570%",
            "击中伤害： 585%",
            "击中伤害： 600%",
            "击中伤害： 615%",
            "击中伤害： 630%",
            "击中伤害： 645%",
            "击中伤害： 660%",
            "击中伤害： 675%",
            "击中伤害： 690%",
            "击中伤害： 705%",
            "击中伤害： 720%",
            "击中伤害： 735%",
            "击中伤害： 750%",
            "击中伤害： 765%",
            "击中伤害： 780%",
            "击中伤害： 795%",
            "击中伤害： 810%",
            "击中伤害： 825%",
            "击中伤害： 840%",
            "击中伤害： 855%",
            "击中伤害： 870%",
            "击中伤害： 885%",
            "击中伤害： 900%",
            "击中伤害： 915%",
            "击中伤害： 930%",
            "击中伤害： 945%",
            "击中伤害： 960%",
            "击中伤害： 975%",
            "击中伤害： 990%",
            "击中伤害： 1005%",
            "击中伤害： 1020%",
            "击中伤害： 1035%",
            "击中伤害： 1050%",
            "击中伤害： 1065%",
            "击中伤害： 1080%",
            "击中伤害： 1095%",
            "击中伤害： 1110%",
            "击中伤害： 1125%",
            "击中伤害： 1140%",
            "击中伤害： 1155%",
            "击中伤害： 1170%",
            "击中伤害： 1185%",
            "击中伤害： 1200%",
            "击中伤害： 1215%",
            "击中伤害： 1230%",
            "击中伤害： 1245%",
            "击中伤害： 1260%",
            "击中伤害： 1275%",
            "击中伤害： 1290%",
            "击中伤害： 1305%",
            "击中伤害： 1320%",
            "击中伤害： 1335%",
            "击中伤害： 1350%",
            "击中伤害： 1365%",
            "击中伤害： 1380%",
            "击中伤害： 1395%",
            "击中伤害： 1410%",
            "击中伤害： 1425%",
            "击中伤害： 1440%",
            "击中伤害： 1455%",
            "击中伤害： 1470%",
            "击中伤害： 1485%",
            "击中伤害： 1500%",
            "击中伤害： 1515%",
            "击中伤害： 1530%",
            "击中伤害： 1545%",
            "击中伤害： 1560%",
            "击中伤害： 1575%",
            "击中伤害： 1590%",
            "击中伤害： 1605%",
            "击中伤害： 1620%",
            "击中伤害： 1635%",
            "击中伤害： 1650%",
            "击中伤害： 1665%",
            "击中伤害： 1680%",
            "击中伤害： 1695%",
            "击中伤害： 1710%",
            "击中伤害： 1725%",
            "击中伤害： 1740%",
            "击中伤害： 1755%",
            "击中伤害： 1770%",
            "击中伤害： 1785%",
            "击中伤害： 1800%"
        }
    }),
    ["副-魅惑菇-词条"] = TagType.New({
        ["名字"] = "副-魅惑菇-词条",
        ["最高等级"] = 100,
        ["详细属性"] = [[生效次数：{[副_召唤_魅惑菇.额外召唤物属性.1.属性增伤.倍率]*(1+[1.属性乘以百分比.生命]/100)}次
控制上限：{[副_召唤_魅惑菇.额外召唤物属性.2.属性增伤.倍率]*100*(1+[1.属性乘以百分比.攻击]/100)}%攻击 ]],
        ["功能"] = {
            {
                ["影响怪物"] = {
                    "副-召唤物-魅惑菇"
                },
                ["影响关键字"] = "",
                ["属性乘以百分比"] = {
                    ["攻击"] = "5",
                    ["生命"] = "5"
                },
                ["额外属性倍率"] = 1,
                ["额外词条等级"] = 1,
                ["类型"] = "SummonTagHandler",
                ["打印信息"] = false,
                ["m_trigger"] = "召唤时",
                ["优先级"] = 5,
                ["冷却"] = 0,
                ["每级增强"] = 1,
                ["几率"] = 0,
                ["升级增加数值"] = {
                    {
                        ["paramName"] = "额外属性倍率",
                        ["number"] = 1
                    }
                }
            }
        },
        ["各级描述"] = {
            [[生效次数：1次
控制上限：1050%攻击 ]],
            [[生效次数：1次
控制上限：1100%攻击 ]],
            [[生效次数：1次
控制上限：1150%攻击 ]],
            [[生效次数：1次
控制上限：1200%攻击 ]],
            [[生效次数：1次
控制上限：1250%攻击 ]],
            [[生效次数：1次
控制上限：1300%攻击 ]],
            [[生效次数：1次
控制上限：1350%攻击 ]],
            [[生效次数：1次
控制上限：1400%攻击 ]],
            [[生效次数：1次
控制上限：1450%攻击 ]],
            [[生效次数：2次
控制上限：1500%攻击 ]],
            [[生效次数：2次
控制上限：1550%攻击 ]],
            [[生效次数：2次
控制上限：1600%攻击 ]],
            [[生效次数：2次
控制上限：1650%攻击 ]],
            [[生效次数：2次
控制上限：1700%攻击 ]],
            [[生效次数：2次
控制上限：1750%攻击 ]],
            [[生效次数：2次
控制上限：1800%攻击 ]],
            [[生效次数：2次
控制上限：1850%攻击 ]],
            [[生效次数：2次
控制上限：1900%攻击 ]],
            [[生效次数：2次
控制上限：1950%攻击 ]],
            [[生效次数：2次
控制上限：2000%攻击 ]],
            [[生效次数：2次
控制上限：2050%攻击 ]],
            [[生效次数：2次
控制上限：2100%攻击 ]],
            [[生效次数：2次
控制上限：2150%攻击 ]],
            [[生效次数：2次
控制上限：2200%攻击 ]],
            [[生效次数：2次
控制上限：2250%攻击 ]],
            [[生效次数：2次
控制上限：2300%攻击 ]],
            [[生效次数：2次
控制上限：2350%攻击 ]],
            [[生效次数：2次
控制上限：2400%攻击 ]],
            [[生效次数：2次
控制上限：2450%攻击 ]],
            [[生效次数：3次
控制上限：2500%攻击 ]],
            [[生效次数：3次
控制上限：2550%攻击 ]],
            [[生效次数：3次
控制上限：2600%攻击 ]],
            [[生效次数：3次
控制上限：2650%攻击 ]],
            [[生效次数：3次
控制上限：2700%攻击 ]],
            [[生效次数：3次
控制上限：2750%攻击 ]],
            [[生效次数：3次
控制上限：2800%攻击 ]],
            [[生效次数：3次
控制上限：2850%攻击 ]],
            [[生效次数：3次
控制上限：2900%攻击 ]],
            [[生效次数：3次
控制上限：2950%攻击 ]],
            [[生效次数：3次
控制上限：3000%攻击 ]],
            [[生效次数：3次
控制上限：3050%攻击 ]],
            [[生效次数：3次
控制上限：3100%攻击 ]],
            [[生效次数：3次
控制上限：3150%攻击 ]],
            [[生效次数：3次
控制上限：3200%攻击 ]],
            [[生效次数：3次
控制上限：3250%攻击 ]],
            [[生效次数：3次
控制上限：3300%攻击 ]],
            [[生效次数：3次
控制上限：3350%攻击 ]],
            [[生效次数：3次
控制上限：3400%攻击 ]],
            [[生效次数：3次
控制上限：3450%攻击 ]],
            [[生效次数：4次
控制上限：3500%攻击 ]],
            [[生效次数：4次
控制上限：3550%攻击 ]],
            [[生效次数：4次
控制上限：3600%攻击 ]],
            [[生效次数：4次
控制上限：3650%攻击 ]],
            [[生效次数：4次
控制上限：3700%攻击 ]],
            [[生效次数：4次
控制上限：3750%攻击 ]],
            [[生效次数：4次
控制上限：3800%攻击 ]],
            [[生效次数：4次
控制上限：3850%攻击 ]],
            [[生效次数：4次
控制上限：3900%攻击 ]],
            [[生效次数：4次
控制上限：3950%攻击 ]],
            [[生效次数：4次
控制上限：4000%攻击 ]],
            [[生效次数：4次
控制上限：4050%攻击 ]],
            [[生效次数：4次
控制上限：4100%攻击 ]],
            [[生效次数：4次
控制上限：4150%攻击 ]],
            [[生效次数：4次
控制上限：4200%攻击 ]],
            [[生效次数：4次
控制上限：4250%攻击 ]],
            [[生效次数：4次
控制上限：4300%攻击 ]],
            [[生效次数：4次
控制上限：4350%攻击 ]],
            [[生效次数：4次
控制上限：4400%攻击 ]],
            [[生效次数：4次
控制上限：4450%攻击 ]],
            [[生效次数：5次
控制上限：4500%攻击 ]],
            [[生效次数：5次
控制上限：4550%攻击 ]],
            [[生效次数：5次
控制上限：4600%攻击 ]],
            [[生效次数：5次
控制上限：4650%攻击 ]],
            [[生效次数：5次
控制上限：4700%攻击 ]],
            [[生效次数：5次
控制上限：4750%攻击 ]],
            [[生效次数：5次
控制上限：4800%攻击 ]],
            [[生效次数：5次
控制上限：4850%攻击 ]],
            [[生效次数：5次
控制上限：4900%攻击 ]],
            [[生效次数：5次
控制上限：4950%攻击 ]],
            [[生效次数：5次
控制上限：5000%攻击 ]],
            [[生效次数：5次
控制上限：5050%攻击 ]],
            [[生效次数：5次
控制上限：5100%攻击 ]],
            [[生效次数：5次
控制上限：5150%攻击 ]],
            [[生效次数：5次
控制上限：5200%攻击 ]],
            [[生效次数：5次
控制上限：5250%攻击 ]],
            [[生效次数：5次
控制上限：5300%攻击 ]],
            [[生效次数：5次
控制上限：5350%攻击 ]],
            [[生效次数：5次
控制上限：5400%攻击 ]],
            [[生效次数：5次
控制上限：5450%攻击 ]],
            [[生效次数：6次
控制上限：5500%攻击 ]],
            [[生效次数：6次
控制上限：5550%攻击 ]],
            [[生效次数：6次
控制上限：5600%攻击 ]],
            [[生效次数：6次
控制上限：5650%攻击 ]],
            [[生效次数：6次
控制上限：5700%攻击 ]],
            [[生效次数：6次
控制上限：5750%攻击 ]],
            [[生效次数：6次
控制上限：5800%攻击 ]],
            [[生效次数：6次
控制上限：5850%攻击 ]],
            [[生效次数：6次
控制上限：5900%攻击 ]],
            [[生效次数：6次
控制上限：5950%攻击 ]],
            [[生效次数：6次
控制上限：6000%攻击 ]]
        }
    }),
    ["特权卡词条"] = TagType.New({
        ["名字"] = "特权卡词条",
        ["最高等级"] = 10,
        ["描述"] = "白天的阳光产量提升",
        ["详细属性"] = "植物伤害+[1.威力增加]%，城墙生命值+[2.威力增加]%，阳光产量+[3.威力增加]%",
        ["功能"] = {
            {
                ["影响魔法"] = {
                    "三头豌豆-伤害",
                    "副-火爆辣椒-飞弹-范围-伤害",
                    "副-火爆辣椒_持续伤害",
                    "副_仙人掌_伤害",
                    "副_坚果_伤害",
                    "副_星星果_伤害",
                    "副_樱桃炸弹_飞弹_范围_伤害",
                    "副_窝瓜_范围伤害",
                    nil,
                    "副_辣椒投手_持续伤害",
                    "副_辣椒投手_范围伤害",
                    "双头豌豆-伤害",
                    "大喷菇_伤害",
                    "寒冰加特林-伤害",
                    "小喷菇_伤害",
                    "椰子炮_范围伤害",
                    "火焰豌豆-伤害",
                    "胆小菇_伤害",
                    "豌豆射手-伤害",
                    "高速加特林-伤害",
                    "高速射手-伤害"
                },
                ["影响魔法关键字"] = "",
                ["威力增加"] = 20,
                ["威力增加表达式"] = "",
                ["取消"] = false,
                ["修改数值倍率"] = 1,
                ["释放魔法继承威力"] = false,
                ["释放魔法威力增加"] = 0,
                ["类型"] = "SpellTagHandler",
                ["打印信息"] = false,
                ["m_trigger"] = "释放魔法时",
                ["优先级"] = 5,
                ["冷却"] = 0,
                ["每级增强"] = 1,
                ["几率"] = 0,
                ["升级增加数值"] = {
                    {
                        ["paramName"] = "威力增加",
                        ["number"] = 1
                    }
                }
            },
            {
                ["属性"] = "生命",
                ["增加"] = 20,
                ["百分比"] = true,
                ["类型"] = "AttributeTagHandler",
                ["打印信息"] = false,
                ["m_trigger"] = "生命",
                ["优先级"] = 5,
                ["冷却"] = 0,
                ["每级增强"] = 1,
                ["几率"] = 0,
                ["升级增加数值"] = {
                    {
                        ["paramName"] = "增加",
                        ["number"] = 1
                    }
                }
            },
            {
                ["影响魔法"] = {
                    "丰收葵_阳光获取"
                },
                ["影响魔法关键字"] = "",
                ["威力增加"] = 10,
                ["威力增加表达式"] = "",
                ["取消"] = false,
                ["修改数值倍率"] = 1,
                ["释放魔法继承威力"] = false,
                ["释放魔法威力增加"] = 0,
                ["类型"] = "SpellTagHandler",
                ["打印信息"] = false,
                ["m_trigger"] = "释放魔法时",
                ["优先级"] = 5,
                ["冷却"] = 0,
                ["每级增强"] = 1,
                ["几率"] = 0,
                ["条件"] = {
                    {
                        ["目标"] = "场景对象",
                        ["目标场景名"] = "terrain/昼夜交替/山坡太阳",
                        ["条件类型"] = "AxisPositionCondition",
                        ["条件"] = {
                            ["轴"] = "Y",
                            ["最小值"] = 0,
                            ["最大值"] = 100
                        },
                        ["动作"] = "必须"
                    }
                },
                ["升级增加数值"] = {
                    {
                        ["paramName"] = "威力增加",
                        ["number"] = 1
                    }
                }
            }
        },
        ["各级描述"] = {
            "植物伤害+20.00%，城墙生命值+[2.威力增加]%，阳光产量+10.00%",
            "植物伤害+40.00%，城墙生命值+[2.威力增加]%，阳光产量+20.00%",
            "植物伤害+60.00%，城墙生命值+[2.威力增加]%，阳光产量+30.00%",
            "植物伤害+80.00%，城墙生命值+[2.威力增加]%，阳光产量+40.00%",
            "植物伤害+100.00%，城墙生命值+[2.威力增加]%，阳光产量+50.00%",
            "植物伤害+120.00%，城墙生命值+[2.威力增加]%，阳光产量+60.00%",
            "植物伤害+140.00%，城墙生命值+[2.威力增加]%，阳光产量+70.00%",
            "植物伤害+160.00%，城墙生命值+[2.威力增加]%，阳光产量+80.00%",
            "植物伤害+180.00%，城墙生命值+[2.威力增加]%，阳光产量+90.00%",
            "植物伤害+200.00%，城墙生命值+[2.威力增加]%，阳光产量+100.00%"
        }
    })
}loaded = true
end

---@param tagTypeName string
---@return TagType
function TagTypeConfig.Get(tagTypeName)
    if not loaded then
        LoadConfig()
    end
    return TagTypeConfig.config[tagTypeName]
end

---@return TagType[]
function TagTypeConfig.GetAll()
    if not loaded then
        LoadConfig()
    end
    return TagTypeConfig.config
end
return TagTypeConfig
