local MainStorage = game:GetService('MainStorage')
local gg                = require(MainStorage.code.common.MGlobal)    ---@type gg
local TagType      = require(MainStorage.code.common.config_type.tags.TagType)    ---@type TagType

--- 词条配置文件
---@class TagTypeConfig
local TagTypeConfig = {}
local loaded = false

local function LoadConfig()
    TagTypeConfig.config ={
    ["丰收葵_阳光产量提升_词条"] = TagType.New({
        ["名字"] = "丰收葵_阳光产量提升_词条",
        ["最高等级"] = 10,
        ["描述"] = "白天的阳光产量提升",
        ["详细属性"] = "阳光产量+[1.威力增加]%",
        ["功能"] = {
            {
                ["影响魔法"] = {
                    "丰收葵_阳光获取"
                },
                ["影响魔法关键字"] = "",
                ["威力增加"] = 10,
                ["威力增加表达式"] = "",
                ["取消"] = false,
                ["修改数值倍率"] = 1,
                ["释放魔法继承威力"] = false,
                ["释放魔法威力增加"] = 0,
                ["类型"] = "SpellTagHandler",
                ["打印信息"] = false,
                ["m_trigger"] = "释放魔法时",
                ["优先级"] = 5,
                ["冷却"] = 0,
                ["每级增强"] = 1,
                ["几率"] = 0,
                ["条件"] = {
                    {
                        ["目标"] = "场景对象",
                        ["目标场景名"] = "terrain/昼夜交替/山坡太阳",
                        ["条件类型"] = "AxisPositionCondition",
                        ["条件"] = {
                            ["轴"] = "Y",
                            ["最小值"] = 0,
                            ["最大值"] = 100
                        },
                        ["动作"] = "必须"
                    }
                },
                ["升级增加数值"] = {
                    {
                        ["paramName"] = "威力增加",
                        ["number"] = 1
                    }
                }
            }
        }
    }),
    ["伤害强化_词条"] = TagType.New({
        ["名字"] = "伤害强化_词条",
        ["最高等级"] = 10,
        ["描述"] = "所有植物造成的伤害提升",
        ["详细属性"] = "伤害 +[1.属性增伤.1]",
        ["功能"] = {
            {
                ["影响魔法关键字"] = "豌豆射手",
                ["即将击杀"] = false,
                ["要求元素类型"] = "无",
                ["增伤"] = 0,
                ["增加暴击率"] = 0,
                ["增加暴击伤害"] = 0,
                ["属性增伤"] = {
                    {
                        ["倍率"] = 10,
                        ["增加类型"] = "增加",
                        ["乘以基础数值"] = false
                    }
                },
                ["属性增伤倍率"] = 1,
                ["释放魔法继承威力"] = false,
                ["释放魔法威力增加"] = 0,
                ["类型"] = "DamageTagHandler",
                ["打印信息"] = false,
                ["m_trigger"] = "攻击时",
                ["优先级"] = 5,
                ["冷却"] = 0,
                ["每级增强"] = 1,
                ["几率"] = 0,
                ["升级增加数值"] = {
                    {
                        ["paramName"] = "属性增伤倍率",
                        ["number"] = 1
                    }
                }
            }
        }
    }),
    ["射速增加_词条"] = TagType.New({
        ["名字"] = "射速增加_词条",
        ["最高等级"] = 10,
        ["描述"] = "所有植物的射速增加",
        ["详细属性"] = "射速 +[1.修改数值.1]%",
        ["功能"] = {
            {
                ["影响魔法关键字"] = "",
                ["威力增加"] = 0,
                ["威力增加表达式"] = "",
                ["取消"] = false,
                ["修改数值"] = {
                    {
                        ["objectName"] = "伤害魔法",
                        ["paramName"] = "冷却加速",
                        ["paramValue"] = {
                            ["倍率"] = 3,
                            ["增加类型"] = "增加",
                            ["乘以基础数值"] = false
                        },
                        ["isAlways"] = false
                    }
                },
                ["修改数值倍率"] = 1,
                ["释放魔法继承威力"] = false,
                ["释放魔法威力增加"] = 0,
                ["类型"] = "SpellTagHandler",
                ["打印信息"] = false,
                ["m_trigger"] = "释放魔法时",
                ["优先级"] = 5,
                ["冷却"] = 0,
                ["每级增强"] = 1,
                ["几率"] = 0,
                ["升级增加数值"] = {
                    {
                        ["paramName"] = "修改数值倍率",
                        ["number"] = 1
                    }
                }
            }
        }
    }),
    ["产量增加_额外概率提升_词条"] = TagType.New({
        ["名字"] = "产量增加_额外概率提升_词条",
        ["最高等级"] = 10,
        ["描述"] = [[夜晚击败僵尸后额外获得阳光的几率提升
白天的阳光产量提升 ]],
        ["详细属性"] = [[击败僵尸后额外获得阳光几率+[1.几率]%
阳光产量+[2.威力增加]% ]],
        ["功能"] = {
            {
                ["影响魔法关键字"] = "",
                ["即将击杀"] = true,
                ["要求元素类型"] = "无",
                ["增伤"] = 0,
                ["增加暴击率"] = 0,
                ["增加暴击伤害"] = 0,
                ["属性增伤倍率"] = 1,
                ["释放魔法"] = {
                    {
                        ["魔法"] = "向日葵_阳光获取"
                    }
                },
                ["释放魔法继承威力"] = false,
                ["释放魔法威力增加"] = 0,
                ["类型"] = "DamageTagHandler",
                ["打印信息"] = false,
                ["m_trigger"] = "攻击时",
                ["优先级"] = 5,
                ["冷却"] = 0,
                ["每级增强"] = 1,
                ["几率"] = 5,
                ["条件"] = {
                    {
                        ["目标"] = "场景对象",
                        ["目标场景名"] = "terrain/昼夜交替/山坡月亮",
                        ["条件类型"] = "AxisPositionCondition",
                        ["条件"] = {
                            ["轴"] = "Y",
                            ["最小值"] = 0,
                            ["最大值"] = 100
                        },
                        ["动作"] = "必须"
                    }
                },
                ["升级增加数值"] = {
                    {
                        ["paramName"] = "几率",
                        ["number"] = 0.2
                    }
                }
            },
            {
                ["影响魔法"] = {
                    "向日葵_阳光获取"
                },
                ["影响魔法关键字"] = "",
                ["威力增加"] = 7,
                ["威力增加表达式"] = "",
                ["取消"] = false,
                ["修改数值倍率"] = 1,
                ["释放魔法继承威力"] = false,
                ["释放魔法威力增加"] = 0,
                ["类型"] = "SpellTagHandler",
                ["打印信息"] = false,
                ["m_trigger"] = "释放魔法时",
                ["优先级"] = 5,
                ["冷却"] = 0,
                ["每级增强"] = 1,
                ["几率"] = 0,
                ["条件"] = {
                    {
                        ["目标"] = "场景对象",
                        ["目标场景名"] = "terrain/昼夜交替/山坡太阳",
                        ["条件类型"] = "AxisPositionCondition",
                        ["条件"] = {
                            ["轴"] = "Y",
                            ["最小值"] = 0,
                            ["最大值"] = 100
                        },
                        ["动作"] = "必须"
                    }
                },
                ["升级增加数值"] = {
                    {
                        ["paramName"] = "威力增加",
                        ["number"] = 1
                    }
                }
            }
        }
    }),
    ["伤害提升_产量增加_词条"] = TagType.New({
        ["名字"] = "伤害提升_产量增加_词条",
        ["最高等级"] = 10,
        ["描述"] = [[所有植物造成的伤害提升
白天的阳光产量提升 ]],
        ["详细属性"] = [[植物伤害+[1.属性增伤.1]
阳光产量+[2.威力增加]% ]],
        ["功能"] = {
            {
                ["影响魔法关键字"] = "",
                ["即将击杀"] = false,
                ["要求元素类型"] = "无",
                ["增伤"] = 0,
                ["增加暴击率"] = 0,
                ["增加暴击伤害"] = 0,
                ["属性增伤"] = {
                    {
                        ["倍率"] = 2,
                        ["增加类型"] = "增加",
                        ["乘以基础数值"] = false
                    }
                },
                ["属性增伤倍率"] = 1,
                ["释放魔法继承威力"] = false,
                ["释放魔法威力增加"] = 0,
                ["类型"] = "DamageTagHandler",
                ["打印信息"] = false,
                ["m_trigger"] = "攻击时",
                ["优先级"] = 5,
                ["冷却"] = 0,
                ["每级增强"] = 1,
                ["几率"] = 0,
                ["升级增加数值"] = {
                    {
                        ["paramName"] = "属性增伤倍率",
                        ["number"] = 1
                    }
                }
            },
            {
                ["影响魔法"] = {
                    "向日葵_阳光获取"
                },
                ["影响魔法关键字"] = "",
                ["威力增加"] = 5,
                ["威力增加表达式"] = "",
                ["取消"] = false,
                ["修改数值倍率"] = 1,
                ["释放魔法继承威力"] = false,
                ["释放魔法威力增加"] = 0,
                ["类型"] = "SpellTagHandler",
                ["打印信息"] = false,
                ["m_trigger"] = "释放魔法时",
                ["优先级"] = 5,
                ["冷却"] = 0,
                ["每级增强"] = 1,
                ["几率"] = 0,
                ["条件"] = {
                    {
                        ["目标"] = "场景对象",
                        ["目标场景名"] = "terrain/昼夜交替/山坡太阳",
                        ["条件类型"] = "AxisPositionCondition",
                        ["条件"] = {
                            ["轴"] = "Y",
                            ["最小值"] = 0,
                            ["最大值"] = 100
                        },
                        ["动作"] = "必须"
                    }
                },
                ["升级增加数值"] = {
                    {
                        ["paramName"] = "威力增加",
                        ["number"] = 1
                    }
                }
            }
        }
    }),
    ["向日葵_阳光产量提升2_词条"] = TagType.New({
        ["名字"] = "向日葵_阳光产量提升2_词条",
        ["最高等级"] = 10,
        ["描述"] = "白天的阳光产量提升",
        ["详细属性"] = "阳光产量+[1.威力增加]%",
        ["功能"] = {
            {
                ["影响魔法"] = {
                    "向日葵_阳光获取"
                },
                ["影响魔法关键字"] = "向日葵",
                ["威力增加"] = 10,
                ["威力增加表达式"] = "",
                ["取消"] = false,
                ["修改数值倍率"] = 1,
                ["释放魔法继承威力"] = false,
                ["释放魔法威力增加"] = 0,
                ["类型"] = "SpellTagHandler",
                ["打印信息"] = false,
                ["m_trigger"] = "释放魔法时",
                ["优先级"] = 5,
                ["冷却"] = 0,
                ["每级增强"] = 1,
                ["几率"] = 0,
                ["条件"] = {
                    {
                        ["目标"] = "场景对象",
                        ["目标场景名"] = "terrain/昼夜交替/山坡太阳",
                        ["条件类型"] = "AxisPositionCondition",
                        ["条件"] = {
                            ["轴"] = "Y",
                            ["最小值"] = 0,
                            ["最大值"] = 100
                        },
                        ["动作"] = "必须"
                    }
                },
                ["升级增加数值"] = {
                    {
                        ["paramName"] = "威力增加",
                        ["number"] = 1
                    }
                }
            }
        }
    }),
    ["向日葵_阳光产量提升_词条"] = TagType.New({
        ["名字"] = "向日葵_阳光产量提升_词条",
        ["最高等级"] = 10,
        ["描述"] = "白天的阳光产量提升",
        ["详细属性"] = "阳光产量+[1.威力增加]%",
        ["功能"] = {
            {
                ["影响魔法"] = {
                    "向日葵_阳光获取"
                },
                ["影响魔法关键字"] = "向日葵",
                ["威力增加"] = 5,
                ["威力增加表达式"] = "",
                ["取消"] = false,
                ["修改数值倍率"] = 1,
                ["释放魔法继承威力"] = false,
                ["释放魔法威力增加"] = 0,
                ["类型"] = "SpellTagHandler",
                ["打印信息"] = false,
                ["m_trigger"] = "释放魔法时",
                ["优先级"] = 5,
                ["冷却"] = 0,
                ["每级增强"] = 1,
                ["几率"] = 0,
                ["条件"] = {
                    {
                        ["目标"] = "场景对象",
                        ["目标场景名"] = "terrain/昼夜交替/山坡太阳",
                        ["条件类型"] = "AxisPositionCondition",
                        ["条件"] = {
                            ["轴"] = "Y",
                            ["最小值"] = 0,
                            ["最大值"] = 1000
                        },
                        ["动作"] = "必须"
                    }
                },
                ["升级增加数值"] = {
                    {
                        ["paramName"] = "威力增加",
                        ["number"] = 1
                    }
                }
            }
        }
    }),
    ["向日葵_额外获得阳光_词条"] = TagType.New({
        ["名字"] = "向日葵_额外获得阳光_词条",
        ["最高等级"] = 10,
        ["描述"] = "夜晚击败僵尸后额外获得阳光的几率提升",
        ["详细属性"] = "击败僵尸后额外获得阳光几率+[1.几率]%",
        ["功能"] = {
            {
                ["影响魔法关键字"] = "",
                ["即将击杀"] = true,
                ["要求元素类型"] = "无",
                ["增伤"] = 0,
                ["增加暴击率"] = 0,
                ["增加暴击伤害"] = 0,
                ["属性增伤倍率"] = 1,
                ["释放魔法"] = {
                    {
                        ["魔法"] = "向日葵_阳光获取"
                    }
                },
                ["释放魔法继承威力"] = false,
                ["释放魔法威力增加"] = 0,
                ["类型"] = "DamageTagHandler",
                ["打印信息"] = false,
                ["m_trigger"] = "攻击时",
                ["优先级"] = 5,
                ["冷却"] = 0,
                ["每级增强"] = 1,
                ["几率"] = 5,
                ["条件"] = {
                    {
                        ["目标"] = "场景对象",
                        ["目标场景名"] = "terrain/昼夜交替/山坡月亮",
                        ["条件类型"] = "AxisPositionCondition",
                        ["条件"] = {
                            ["轴"] = "Y",
                            ["最小值"] = 0,
                            ["最大值"] = 100
                        },
                        ["动作"] = "必须"
                    }
                },
                ["升级增加数值"] = {
                    {
                        ["paramName"] = "几率",
                        ["number"] = 0.35
                    }
                }
            }
        }
    }),
    ["持续伤害_词条_大喷菇"] = TagType.New({
        ["名字"] = "持续伤害_词条_大喷菇",
        ["最高等级"] = 20,
        ["描述"] = "持续伤害增加",
        ["详细属性"] = "持续伤害+[1.增伤]%",
        ["功能"] = {
            {
                ["影响魔法"] = {
                    "胆小菇_dot"
                },
                ["影响魔法关键字"] = "",
                ["即将击杀"] = false,
                ["要求元素类型"] = "毒",
                ["增伤"] = 5,
                ["增加暴击率"] = 0,
                ["增加暴击伤害"] = 0,
                ["属性增伤倍率"] = 1,
                ["释放魔法继承威力"] = false,
                ["释放魔法威力增加"] = 0,
                ["类型"] = "DamageTagHandler",
                ["打印信息"] = false,
                ["m_trigger"] = "攻击时",
                ["优先级"] = 5,
                ["冷却"] = 0,
                ["每级增强"] = 1,
                ["几率"] = 0,
                ["升级增加数值"] = {
                    {
                        ["paramName"] = "增伤",
                        ["number"] = 1
                    }
                }
            }
        }
    }),
    ["攻击1_词条_大喷菇"] = TagType.New({
        ["名字"] = "攻击1_词条_大喷菇",
        ["最高等级"] = 20,
        ["描述"] = "伤害增加",
        ["详细属性"] = "伤害 +[1.增伤]%",
        ["功能"] = {
            {
                ["影响魔法关键字"] = "大喷菇",
                ["即将击杀"] = false,
                ["要求元素类型"] = "无",
                ["增伤"] = 10,
                ["增加暴击率"] = 0,
                ["增加暴击伤害"] = 0,
                ["属性增伤倍率"] = 1,
                ["释放魔法继承威力"] = false,
                ["释放魔法威力增加"] = 0,
                ["类型"] = "DamageTagHandler",
                ["打印信息"] = false,
                ["m_trigger"] = "攻击时",
                ["优先级"] = 5,
                ["冷却"] = 0,
                ["每级增强"] = 1,
                ["几率"] = 0,
                ["升级增加数值"] = {
                    {
                        ["paramName"] = "增伤",
                        ["number"] = 1
                    }
                }
            }
        }
    }),
    ["射速1_词条_小喷菇"] = TagType.New({
        ["名字"] = "射速1_词条_小喷菇",
        ["最高等级"] = 10,
        ["描述"] = "射速增加",
        ["详细属性"] = "射速 +[1.修改数值.1]%",
        ["功能"] = {
            {
                ["影响魔法关键字"] = "小喷菇",
                ["威力增加"] = 0,
                ["威力增加表达式"] = "",
                ["取消"] = false,
                ["修改数值"] = {
                    {
                        ["objectName"] = "伤害魔法",
                        ["paramName"] = "冷却加速",
                        ["paramValue"] = {
                            ["倍率"] = 5,
                            ["增加类型"] = "增加",
                            ["乘以基础数值"] = false
                        },
                        ["isAlways"] = false
                    }
                },
                ["修改数值倍率"] = 1,
                ["释放魔法继承威力"] = false,
                ["释放魔法威力增加"] = 0,
                ["类型"] = "SpellTagHandler",
                ["打印信息"] = false,
                ["m_trigger"] = "释放魔法时",
                ["优先级"] = 5,
                ["冷却"] = 0,
                ["每级增强"] = 1,
                ["几率"] = 0,
                ["升级增加数值"] = {
                    {
                        ["paramName"] = "修改数值倍率",
                        ["number"] = 1
                    }
                }
            }
        }
    }),
    ["攻击1_词条_小喷菇"] = TagType.New({
        ["名字"] = "攻击1_词条_小喷菇",
        ["最高等级"] = 10,
        ["描述"] = "伤害增加",
        ["详细属性"] = "伤害 +[1.增伤]%",
        ["功能"] = {
            {
                ["影响魔法关键字"] = "小喷菇",
                ["即将击杀"] = false,
                ["要求元素类型"] = "无",
                ["增伤"] = 5,
                ["增加暴击率"] = 0,
                ["增加暴击伤害"] = 0,
                ["属性增伤倍率"] = 1,
                ["释放魔法继承威力"] = false,
                ["释放魔法威力增加"] = 0,
                ["类型"] = "DamageTagHandler",
                ["打印信息"] = false,
                ["m_trigger"] = "攻击时",
                ["优先级"] = 5,
                ["冷却"] = 0,
                ["每级增强"] = 1,
                ["几率"] = 0,
                ["升级增加数值"] = {
                    {
                        ["paramName"] = "增伤",
                        ["number"] = 1
                    }
                }
            }
        }
    }),
    ["生命1_词条_小喷菇"] = TagType.New({
        ["名字"] = "生命1_词条_小喷菇",
        ["最高等级"] = 10,
        ["描述"] = "生命增加",
        ["详细属性"] = "生命+[1.增加]",
        ["功能"] = {
            {
                ["属性"] = "生命",
                ["增加"] = 10,
                ["百分比"] = false,
                ["类型"] = "AttributeTagHandler",
                ["打印信息"] = false,
                ["m_trigger"] = "生命",
                ["优先级"] = 5,
                ["冷却"] = 0,
                ["每级增强"] = 1,
                ["几率"] = 0,
                ["升级增加数值"] = {
                    {
                        ["paramName"] = "增加",
                        ["number"] = 1
                    }
                }
            }
        }
    }),
    ["持续伤害_词条_胆小菇"] = TagType.New({
        ["名字"] = "持续伤害_词条_胆小菇",
        ["最高等级"] = 10,
        ["描述"] = "持续伤害提升",
        ["详细属性"] = "持续伤害+[1.增伤]%",
        ["功能"] = {
            {
                ["影响魔法"] = {
                    "胆小菇_dot"
                },
                ["影响魔法关键字"] = "",
                ["即将击杀"] = false,
                ["要求元素类型"] = "毒",
                ["增伤"] = 10,
                ["增加暴击率"] = 0,
                ["增加暴击伤害"] = 0,
                ["属性增伤倍率"] = 1,
                ["释放魔法继承威力"] = false,
                ["释放魔法威力增加"] = 0,
                ["类型"] = "DamageTagHandler",
                ["打印信息"] = false,
                ["m_trigger"] = "攻击时",
                ["优先级"] = 5,
                ["冷却"] = 0,
                ["每级增强"] = 1,
                ["几率"] = 0,
                ["升级增加数值"] = {
                    {
                        ["paramName"] = "增伤",
                        ["number"] = 1
                    }
                }
            }
        }
    }),
    ["攻击1_词条_胆小菇"] = TagType.New({
        ["名字"] = "攻击1_词条_胆小菇",
        ["最高等级"] = 10,
        ["描述"] = "伤害增加",
        ["详细属性"] = "伤害 +[1.增伤]%",
        ["功能"] = {
            {
                ["影响魔法关键字"] = "小喷菇",
                ["即将击杀"] = false,
                ["要求元素类型"] = "无",
                ["增伤"] = 5,
                ["增加暴击率"] = 0,
                ["增加暴击伤害"] = 0,
                ["属性增伤倍率"] = 1,
                ["释放魔法继承威力"] = false,
                ["释放魔法威力增加"] = 0,
                ["类型"] = "DamageTagHandler",
                ["打印信息"] = false,
                ["m_trigger"] = "攻击时",
                ["优先级"] = 5,
                ["冷却"] = 0,
                ["每级增强"] = 1,
                ["几率"] = 0,
                ["升级增加数值"] = {
                    {
                        ["paramName"] = "增伤",
                        ["number"] = 1
                    }
                }
            }
        }
    }),
    ["减速1_词条_寒冰射手"] = TagType.New({
        ["名字"] = "减速1_词条_寒冰射手",
        ["最高等级"] = 10,
        ["描述"] = "减速持续时间增加",
        ["详细属性"] = "减速时间 +[1.修改数值.1]%",
        ["功能"] = {
            {
                ["影响魔法"] = {
                    "减速BUFF"
                },
                ["影响魔法关键字"] = "",
                ["威力增加"] = 0,
                ["威力增加表达式"] = "",
                ["取消"] = false,
                ["修改数值"] = {
                    {
                        ["objectName"] = "减速BUFF",
                        ["paramName"] = "持续时间",
                        ["paramValue"] = {
                            ["倍率"] = 2,
                            ["增加类型"] = "倍率",
                            ["乘以基础数值"] = false
                        },
                        ["isAlways"] = false
                    }
                },
                ["修改数值倍率"] = 1,
                ["释放魔法继承威力"] = false,
                ["释放魔法威力增加"] = 0,
                ["类型"] = "SpellTagHandler",
                ["打印信息"] = false,
                ["m_trigger"] = "释放魔法时",
                ["优先级"] = 5,
                ["冷却"] = 0,
                ["每级增强"] = 1,
                ["几率"] = 0,
                ["升级增加数值"] = {
                    {
                        ["paramName"] = "修改数值倍率",
                        ["number"] = 1
                    }
                }
            }
        }
    }),
    ["攻击1_词条_寒冰射手"] = TagType.New({
        ["名字"] = "攻击1_词条_寒冰射手",
        ["最高等级"] = 10,
        ["描述"] = "伤害增加",
        ["详细属性"] = "伤害 +[1.增伤]%",
        ["功能"] = {
            {
                ["影响魔法关键字"] = "寒冰射手",
                ["即将击杀"] = false,
                ["要求元素类型"] = "无",
                ["增伤"] = 5,
                ["增加暴击率"] = 0,
                ["增加暴击伤害"] = 0,
                ["属性增伤倍率"] = 1,
                ["释放魔法继承威力"] = false,
                ["释放魔法威力增加"] = 0,
                ["类型"] = "DamageTagHandler",
                ["打印信息"] = false,
                ["m_trigger"] = "攻击时",
                ["优先级"] = 5,
                ["冷却"] = 0,
                ["每级增强"] = 1,
                ["几率"] = 0,
                ["升级增加数值"] = {
                    {
                        ["paramName"] = "增伤",
                        ["number"] = 1
                    }
                }
            }
        }
    }),
    ["生命1_词条_寒冰射手"] = TagType.New({
        ["名字"] = "生命1_词条_寒冰射手",
        ["最高等级"] = 10,
        ["描述"] = "生命增加",
        ["详细属性"] = "生命+[1.增加]",
        ["功能"] = {
            {
                ["属性"] = "生命",
                ["增加"] = 10,
                ["百分比"] = false,
                ["类型"] = "AttributeTagHandler",
                ["打印信息"] = false,
                ["m_trigger"] = "生命",
                ["优先级"] = 5,
                ["冷却"] = 0,
                ["每级增强"] = 1,
                ["几率"] = 0,
                ["升级增加数值"] = {
                    {
                        ["paramName"] = "增加",
                        ["number"] = 1
                    }
                }
            }
        }
    }),
    ["冷冻1_词条_寒冰加特林"] = TagType.New({
        ["名字"] = "冷冻1_词条_寒冰加特林",
        ["最高等级"] = 10,
        ["描述"] = "造成冷冻的概率提升",
        ["详细属性"] = "冷冻概率 +[1.修改数值.1]%",
        ["功能"] = {
            {
                ["影响魔法"] = {
                    "冰冻BUFF"
                },
                ["影响魔法关键字"] = "",
                ["威力增加"] = 0,
                ["威力增加表达式"] = "",
                ["取消"] = false,
                ["修改数值"] = {
                    {
                        ["objectName"] = "冰冻BUFF",
                        ["paramName"] = "几率",
                        ["paramValue"] = {
                            ["倍率"] = 1.5,
                            ["增加类型"] = "倍率",
                            ["乘以基础数值"] = false
                        },
                        ["isAlways"] = false
                    }
                },
                ["修改数值倍率"] = 1,
                ["释放魔法继承威力"] = false,
                ["释放魔法威力增加"] = 0,
                ["类型"] = "SpellTagHandler",
                ["打印信息"] = false,
                ["m_trigger"] = "释放魔法时",
                ["优先级"] = 5,
                ["冷却"] = 0,
                ["每级增强"] = 1,
                ["几率"] = 0,
                ["升级增加数值"] = {
                    {
                        ["paramName"] = "修改数值倍率",
                        ["number"] = 1
                    }
                }
            }
        }
    }),
    ["减速1_词条_寒冰加特林"] = TagType.New({
        ["名字"] = "减速1_词条_寒冰加特林",
        ["最高等级"] = 10,
        ["描述"] = "减速持续时间增加",
        ["详细属性"] = "减速时间+[1.修改数值.1]%",
        ["功能"] = {
            {
                ["影响魔法关键字"] = "",
                ["威力增加"] = 0,
                ["威力增加表达式"] = "",
                ["取消"] = false,
                ["修改数值"] = {
                    {
                        ["objectName"] = "减速BUFF",
                        ["paramName"] = "持续时间",
                        ["paramValue"] = {
                            ["倍率"] = 5,
                            ["增加类型"] = "倍率",
                            ["乘以基础数值"] = false
                        },
                        ["isAlways"] = false
                    }
                },
                ["修改数值倍率"] = 1,
                ["释放魔法继承威力"] = false,
                ["释放魔法威力增加"] = 0,
                ["类型"] = "SpellTagHandler",
                ["打印信息"] = false,
                ["m_trigger"] = "释放魔法时",
                ["优先级"] = 5,
                ["冷却"] = 0,
                ["每级增强"] = 1,
                ["几率"] = 0,
                ["升级增加数值"] = {
                    {
                        ["paramName"] = "修改数值倍率",
                        ["number"] = 1
                    }
                }
            }
        }
    }),
    ["持续伤害_词条_寒冰加特林"] = TagType.New({
        ["名字"] = "持续伤害_词条_寒冰加特林",
        ["最高等级"] = 10,
        ["描述"] = "持续伤害增加",
        ["详细属性"] = "持续伤害+[1.增伤]%",
        ["功能"] = {
            {
                ["影响魔法"] = {
                    "寒冰加特林_dot"
                },
                ["影响魔法关键字"] = "",
                ["即将击杀"] = false,
                ["要求元素类型"] = "无",
                ["增伤"] = 5,
                ["增加暴击率"] = 0,
                ["增加暴击伤害"] = 0,
                ["属性增伤倍率"] = 1,
                ["释放魔法继承威力"] = false,
                ["释放魔法威力增加"] = 0,
                ["类型"] = "DamageTagHandler",
                ["打印信息"] = false,
                ["m_trigger"] = "攻击时",
                ["优先级"] = 5,
                ["冷却"] = 0,
                ["每级增强"] = 1,
                ["几率"] = 0,
                ["升级增加数值"] = {
                    {
                        ["paramName"] = "增伤",
                        ["number"] = 1
                    }
                }
            }
        }
    }),
    ["攻击1_词条_寒冰加特林"] = TagType.New({
        ["名字"] = "攻击1_词条_寒冰加特林",
        ["最高等级"] = 10,
        ["描述"] = "伤害增加",
        ["详细属性"] = "伤害 +[1.增伤]%",
        ["功能"] = {
            {
                ["影响魔法关键字"] = "寒冰加特林",
                ["即将击杀"] = false,
                ["要求元素类型"] = "无",
                ["增伤"] = 8,
                ["增加暴击率"] = 0,
                ["增加暴击伤害"] = 0,
                ["属性增伤倍率"] = 1,
                ["释放魔法继承威力"] = false,
                ["释放魔法威力增加"] = 0,
                ["类型"] = "DamageTagHandler",
                ["打印信息"] = false,
                ["m_trigger"] = "攻击时",
                ["优先级"] = 5,
                ["冷却"] = 0,
                ["每级增强"] = 1,
                ["几率"] = 0,
                ["升级增加数值"] = {
                    {
                        ["paramName"] = "增伤",
                        ["number"] = 1
                    }
                }
            }
        }
    }),
    ["攻击1_词条_火焰豌豆"] = TagType.New({
        ["名字"] = "攻击1_词条_火焰豌豆",
        ["最高等级"] = 10,
        ["描述"] = "伤害增加",
        ["详细属性"] = "伤害 +[1.增伤]%",
        ["功能"] = {
            {
                ["影响魔法关键字"] = "火焰豌豆",
                ["即将击杀"] = false,
                ["要求元素类型"] = "无",
                ["增伤"] = 10,
                ["增加暴击率"] = 0,
                ["增加暴击伤害"] = 0,
                ["属性增伤倍率"] = 1,
                ["释放魔法继承威力"] = false,
                ["释放魔法威力增加"] = 0,
                ["类型"] = "DamageTagHandler",
                ["打印信息"] = false,
                ["m_trigger"] = "攻击时",
                ["优先级"] = 5,
                ["冷却"] = 0,
                ["每级增强"] = 1,
                ["几率"] = 0,
                ["升级增加数值"] = {
                    {
                        ["paramName"] = "增伤",
                        ["number"] = 1
                    }
                }
            }
        }
    }),
    ["射速1_词条_三头豌豆"] = TagType.New({
        ["名字"] = "射速1_词条_三头豌豆",
        ["最高等级"] = 10,
        ["描述"] = "射速增加",
        ["详细属性"] = "射速 +[1.修改数值.1]%",
        ["功能"] = {
            {
                ["影响魔法关键字"] = "三头豌豆",
                ["威力增加"] = 0,
                ["威力增加表达式"] = "",
                ["取消"] = false,
                ["修改数值"] = {
                    {
                        ["objectName"] = "伤害魔法",
                        ["paramName"] = "冷却加速",
                        ["paramValue"] = {
                            ["倍率"] = 6,
                            ["增加类型"] = "增加",
                            ["乘以基础数值"] = false
                        },
                        ["isAlways"] = false
                    }
                },
                ["修改数值倍率"] = 1,
                ["释放魔法继承威力"] = false,
                ["释放魔法威力增加"] = 0,
                ["类型"] = "SpellTagHandler",
                ["打印信息"] = false,
                ["m_trigger"] = "释放魔法时",
                ["优先级"] = 5,
                ["冷却"] = 0,
                ["每级增强"] = 1,
                ["几率"] = 0,
                ["升级增加数值"] = {
                    {
                        ["paramName"] = "修改数值倍率",
                        ["number"] = 1
                    }
                }
            }
        }
    }),
    ["射速1_词条_高速射手"] = TagType.New({
        ["名字"] = "射速1_词条_高速射手",
        ["最高等级"] = 10,
        ["描述"] = "射速增加",
        ["详细属性"] = "射速 +[1.修改数值.1]%",
        ["功能"] = {
            {
                ["影响魔法关键字"] = "高速射手",
                ["威力增加"] = 0,
                ["威力增加表达式"] = "",
                ["取消"] = false,
                ["修改数值"] = {
                    {
                        ["objectName"] = "伤害魔法",
                        ["paramName"] = "冷却加速",
                        ["paramValue"] = {
                            ["倍率"] = 6,
                            ["增加类型"] = "增加",
                            ["乘以基础数值"] = false
                        },
                        ["isAlways"] = false
                    }
                },
                ["修改数值倍率"] = 1,
                ["释放魔法继承威力"] = false,
                ["释放魔法威力增加"] = 0,
                ["类型"] = "SpellTagHandler",
                ["打印信息"] = false,
                ["m_trigger"] = "释放魔法时",
                ["优先级"] = 5,
                ["冷却"] = 0,
                ["每级增强"] = 1,
                ["几率"] = 0,
                ["升级增加数值"] = {
                    {
                        ["paramName"] = "修改数值倍率",
                        ["number"] = 1
                    }
                }
            }
        }
    }),
    ["射速1_词条_高速加特林"] = TagType.New({
        ["名字"] = "射速1_词条_高速加特林",
        ["最高等级"] = 10,
        ["描述"] = "射速增加",
        ["详细属性"] = "射速 +[1.修改数值.1]%",
        ["功能"] = {
            {
                ["影响魔法关键字"] = "高速加特林",
                ["威力增加"] = 0,
                ["威力增加表达式"] = "",
                ["取消"] = false,
                ["修改数值"] = {
                    {
                        ["objectName"] = "伤害魔法",
                        ["paramName"] = "冷却加速",
                        ["paramValue"] = {
                            ["倍率"] = 8,
                            ["增加类型"] = "增加",
                            ["乘以基础数值"] = false
                        },
                        ["isAlways"] = false
                    }
                },
                ["修改数值倍率"] = 1,
                ["释放魔法继承威力"] = false,
                ["释放魔法威力增加"] = 0,
                ["类型"] = "SpellTagHandler",
                ["打印信息"] = false,
                ["m_trigger"] = "释放魔法时",
                ["优先级"] = 5,
                ["冷却"] = 0,
                ["每级增强"] = 1,
                ["几率"] = 0,
                ["升级增加数值"] = {
                    {
                        ["paramName"] = "修改数值倍率",
                        ["number"] = 1
                    }
                }
            }
        }
    }),
    ["射速1_词条_双头豌豆"] = TagType.New({
        ["名字"] = "射速1_词条_双头豌豆",
        ["最高等级"] = 10,
        ["描述"] = "射速增加",
        ["详细属性"] = "射速 +[1.修改数值.1]%",
        ["功能"] = {
            {
                ["影响魔法关键字"] = "双发豌豆",
                ["威力增加"] = 0,
                ["威力增加表达式"] = "",
                ["取消"] = false,
                ["修改数值"] = {
                    {
                        ["objectName"] = "伤害魔法",
                        ["paramName"] = "冷却加速",
                        ["paramValue"] = {
                            ["倍率"] = 5,
                            ["增加类型"] = "增加",
                            ["乘以基础数值"] = false
                        },
                        ["isAlways"] = false
                    }
                },
                ["修改数值倍率"] = 1,
                ["释放魔法继承威力"] = false,
                ["释放魔法威力增加"] = 0,
                ["类型"] = "SpellTagHandler",
                ["打印信息"] = false,
                ["m_trigger"] = "释放魔法时",
                ["优先级"] = 5,
                ["冷却"] = 0,
                ["每级增强"] = 1,
                ["几率"] = 0,
                ["升级增加数值"] = {
                    {
                        ["paramName"] = "修改数值倍率",
                        ["number"] = 1
                    }
                }
            }
        }
    }),
    ["攻击1_词条_双头豌豆"] = TagType.New({
        ["名字"] = "攻击1_词条_双头豌豆",
        ["最高等级"] = 10,
        ["描述"] = "伤害增加",
        ["详细属性"] = "伤害 +[1.增伤]%",
        ["功能"] = {
            {
                ["影响魔法关键字"] = "双发豌豆",
                ["即将击杀"] = false,
                ["要求元素类型"] = "无",
                ["增伤"] = 5,
                ["增加暴击率"] = 0,
                ["增加暴击伤害"] = 0,
                ["属性增伤倍率"] = 1,
                ["释放魔法继承威力"] = false,
                ["释放魔法威力增加"] = 0,
                ["类型"] = "DamageTagHandler",
                ["打印信息"] = false,
                ["m_trigger"] = "攻击时",
                ["优先级"] = 5,
                ["冷却"] = 0,
                ["每级增强"] = 1,
                ["几率"] = 0,
                ["升级增加数值"] = {
                    {
                        ["paramName"] = "增伤",
                        ["number"] = 1
                    }
                }
            }
        }
    }),
    ["射速1_词条_豌豆射手"] = TagType.New({
        ["名字"] = "射速1_词条_豌豆射手",
        ["最高等级"] = 10,
        ["描述"] = "射速增加",
        ["详细属性"] = "射速 +[1.修改数值.1]%",
        ["功能"] = {
            {
                ["影响魔法关键字"] = "豌豆射手",
                ["威力增加"] = 0,
                ["威力增加表达式"] = "",
                ["取消"] = false,
                ["修改数值"] = {
                    {
                        ["objectName"] = "伤害魔法",
                        ["paramName"] = "冷却加速",
                        ["paramValue"] = {
                            ["倍率"] = 2,
                            ["增加类型"] = "增加",
                            ["乘以基础数值"] = false
                        },
                        ["isAlways"] = false
                    }
                },
                ["修改数值倍率"] = 1,
                ["释放魔法继承威力"] = false,
                ["释放魔法威力增加"] = 0,
                ["类型"] = "SpellTagHandler",
                ["打印信息"] = false,
                ["m_trigger"] = "释放魔法时",
                ["优先级"] = 5,
                ["冷却"] = 0,
                ["每级增强"] = 1,
                ["几率"] = 0,
                ["升级增加数值"] = {
                    {
                        ["paramName"] = "修改数值倍率",
                        ["number"] = 1
                    }
                }
            }
        }
    }),
    ["攻击1_词条_豌豆射手"] = TagType.New({
        ["名字"] = "攻击1_词条_豌豆射手",
        ["最高等级"] = 10,
        ["描述"] = "伤害增加",
        ["详细属性"] = "伤害 +[1.属性增伤.1]",
        ["功能"] = {
            {
                ["影响魔法关键字"] = "豌豆射手",
                ["即将击杀"] = false,
                ["要求元素类型"] = "无",
                ["增伤"] = 20,
                ["增加暴击率"] = 0,
                ["增加暴击伤害"] = 0,
                ["属性增伤"] = {
                    {
                        ["倍率"] = 5,
                        ["增加类型"] = "增加",
                        ["乘以基础数值"] = false
                    }
                },
                ["属性增伤倍率"] = 1,
                ["释放魔法继承威力"] = false,
                ["释放魔法威力增加"] = 0,
                ["类型"] = "DamageTagHandler",
                ["打印信息"] = false,
                ["m_trigger"] = "攻击时",
                ["优先级"] = 5,
                ["冷却"] = 0,
                ["每级增强"] = 1,
                ["几率"] = 0,
                ["升级增加数值"] = {
                    {
                        ["paramName"] = "属性增伤倍率",
                        ["number"] = 1
                    }
                }
            }
        }
    }),
    ["生命1_词条_豌豆射手"] = TagType.New({
        ["名字"] = "生命1_词条_豌豆射手",
        ["最高等级"] = 10,
        ["描述"] = "生命增加",
        ["详细属性"] = "生命+[1.增加]",
        ["功能"] = {
            {
                ["属性"] = "生命",
                ["增加"] = 10,
                ["百分比"] = false,
                ["类型"] = "AttributeTagHandler",
                ["打印信息"] = false,
                ["m_trigger"] = "生命",
                ["优先级"] = 5,
                ["冷却"] = 0,
                ["每级增强"] = 1,
                ["几率"] = 0,
                ["升级增加数值"] = {
                    {
                        ["paramName"] = "增加",
                        ["number"] = 1
                    }
                }
            }
        }
    }),
    ["副-地刺-词条"] = TagType.New({
        ["名字"] = "副-地刺-词条",
        ["最高等级"] = 100,
        ["详细属性"] = "伤害: {[地刺_dot.属性增伤.1.倍率]*100*(1+[1.威力增加])}%攻击 ",
        ["功能"] = {
            {
                ["影响魔法"] = {
                    "地刺_脉冲"
                },
                ["影响魔法关键字"] = "",
                ["威力增加"] = 0.05,
                ["威力增加表达式"] = "",
                ["取消"] = false,
                ["修改数值倍率"] = 1,
                ["释放魔法继承威力"] = false,
                ["释放魔法威力增加"] = 0,
                ["类型"] = "SpellTagHandler",
                ["打印信息"] = false,
                ["m_trigger"] = "释放魔法时",
                ["优先级"] = 5,
                ["冷却"] = 0,
                ["每级增强"] = 1,
                ["几率"] = 0,
                ["升级增加数值"] = {
                    {
                        ["paramName"] = "威力增加",
                        ["number"] = 1
                    }
                }
            }
        },
        ["各级描述"] = {
            "伤害: 189%攻击 ",
            "伤害: 198%攻击 ",
            "伤害: 207%攻击 ",
            "伤害: 216%攻击 ",
            "伤害: 225%攻击 ",
            "伤害: 234%攻击 ",
            "伤害: 243%攻击 ",
            "伤害: 252%攻击 ",
            "伤害: 261%攻击 ",
            "伤害: 270%攻击 ",
            "伤害: 279%攻击 ",
            "伤害: 288%攻击 ",
            "伤害: 297%攻击 ",
            "伤害: 306%攻击 ",
            "伤害: 315%攻击 ",
            "伤害: 324%攻击 ",
            "伤害: 333%攻击 ",
            "伤害: 342%攻击 ",
            "伤害: 351%攻击 ",
            "伤害: 360%攻击 ",
            "伤害: 369%攻击 ",
            "伤害: 378%攻击 ",
            "伤害: 387%攻击 ",
            "伤害: 396%攻击 ",
            "伤害: 405%攻击 ",
            "伤害: 414%攻击 ",
            "伤害: 423%攻击 ",
            "伤害: 432%攻击 ",
            "伤害: 441%攻击 ",
            "伤害: 450%攻击 ",
            "伤害: 459%攻击 ",
            "伤害: 468%攻击 ",
            "伤害: 477%攻击 ",
            "伤害: 486%攻击 ",
            "伤害: 495%攻击 ",
            "伤害: 504%攻击 ",
            "伤害: 513%攻击 ",
            "伤害: 522%攻击 ",
            "伤害: 531%攻击 ",
            "伤害: 540%攻击 ",
            "伤害: 549%攻击 ",
            "伤害: 558%攻击 ",
            "伤害: 567%攻击 ",
            "伤害: 576%攻击 ",
            "伤害: 585%攻击 ",
            "伤害: 594%攻击 ",
            "伤害: 603%攻击 ",
            "伤害: 612%攻击 ",
            "伤害: 621%攻击 ",
            "伤害: 630%攻击 ",
            "伤害: 639%攻击 ",
            "伤害: 648%攻击 ",
            "伤害: 657%攻击 ",
            "伤害: 666%攻击 ",
            "伤害: 675%攻击 ",
            "伤害: 684%攻击 ",
            "伤害: 693%攻击 ",
            "伤害: 702%攻击 ",
            "伤害: 711%攻击 ",
            "伤害: 720%攻击 ",
            "伤害: 729%攻击 ",
            "伤害: 738%攻击 ",
            "伤害: 747%攻击 ",
            "伤害: 756%攻击 ",
            "伤害: 765%攻击 ",
            "伤害: 774%攻击 ",
            "伤害: 783%攻击 ",
            "伤害: 792%攻击 ",
            "伤害: 801%攻击 ",
            "伤害: 810%攻击 ",
            "伤害: 819%攻击 ",
            "伤害: 828%攻击 ",
            "伤害: 837%攻击 ",
            "伤害: 846%攻击 ",
            "伤害: 855%攻击 ",
            "伤害: 864%攻击 ",
            "伤害: 873%攻击 ",
            "伤害: 882%攻击 ",
            "伤害: 891%攻击 ",
            "伤害: 900%攻击 ",
            "伤害: 909%攻击 ",
            "伤害: 918%攻击 ",
            "伤害: 927%攻击 ",
            "伤害: 936%攻击 ",
            "伤害: 945%攻击 ",
            "伤害: 954%攻击 ",
            "伤害: 963%攻击 ",
            "伤害: 972%攻击 ",
            "伤害: 981%攻击 ",
            "伤害: 990%攻击 ",
            "伤害: 999%攻击 ",
            "伤害: 1008%攻击 ",
            "伤害: 1017%攻击 ",
            "伤害: 1026%攻击 ",
            "伤害: 1035%攻击 ",
            "伤害: 1044%攻击 ",
            "伤害: 1053%攻击 ",
            "伤害: 1062%攻击 ",
            "伤害: 1071%攻击 ",
            "伤害: 1080%攻击 "
        }
    }),
    ["副-坚果-词条"] = TagType.New({
        ["名字"] = "副-坚果-词条",
        ["最高等级"] = 100,
        ["详细属性"] = "[1.属性乘以百分比]",
        ["功能"] = {
            {
                ["影响怪物"] = {
                    "副-召唤物-坚果"
                },
                ["影响关键字"] = "",
                ["属性乘以百分比"] = {
                    ["生命"] = "6",
                    ["仇恨"] = "5"
                },
                ["额外属性倍率"] = 1,
                ["额外词条等级"] = 1,
                ["类型"] = "SummonTagHandler",
                ["打印信息"] = false,
                ["m_trigger"] = "召唤时",
                ["优先级"] = 5,
                ["冷却"] = 0,
                ["每级增强"] = 1,
                ["几率"] = 0,
                ["升级增加数值"] = {
                    {
                        ["paramName"] = "额外属性倍率",
                        ["number"] = 1
                    }
                }
            }
        }
    }),
    ["副-樱桃炸弹-词条"] = TagType.New({
        ["名字"] = "副-樱桃炸弹-词条",
        ["最高等级"] = 100,
        ["详细属性"] = "伤害: {[副_樱桃炸弹_飞弹_范围_伤害.属性增伤.1.倍率]*100*(1+[1.威力增加])}%",
        ["功能"] = {
            {
                ["影响魔法"] = {
                    "副_樱桃炸弹_飞弹_范围_伤害"
                },
                ["影响魔法关键字"] = "",
                ["威力增加"] = 0.05,
                ["威力增加表达式"] = "",
                ["取消"] = false,
                ["修改数值倍率"] = 1,
                ["释放魔法继承威力"] = false,
                ["释放魔法威力增加"] = 0,
                ["类型"] = "SpellTagHandler",
                ["打印信息"] = false,
                ["m_trigger"] = "释放魔法时",
                ["优先级"] = 5,
                ["冷却"] = 0,
                ["每级增强"] = 1,
                ["几率"] = 0,
                ["升级增加数值"] = {
                    {
                        ["paramName"] = "威力增加",
                        ["number"] = 1
                    }
                }
            }
        },
        ["各级描述"] = {
            "伤害: 210%",
            "伤害: 220%",
            "伤害: 230%",
            "伤害: 240%",
            "伤害: 250%",
            "伤害: 260%",
            "伤害: 270%",
            "伤害: 280%",
            "伤害: 290%",
            "伤害: 300%",
            "伤害: 310%",
            "伤害: 320%",
            "伤害: 330%",
            "伤害: 340%",
            "伤害: 350%",
            "伤害: 360%",
            "伤害: 370%",
            "伤害: 380%",
            "伤害: 390%",
            "伤害: 400%",
            "伤害: 410%",
            "伤害: 420%",
            "伤害: 430%",
            "伤害: 440%",
            "伤害: 450%",
            "伤害: 460%",
            "伤害: 470%",
            "伤害: 480%",
            "伤害: 490%",
            "伤害: 500%",
            "伤害: 510%",
            "伤害: 520%",
            "伤害: 530%",
            "伤害: 540%",
            "伤害: 550%",
            "伤害: 560%",
            "伤害: 570%",
            "伤害: 580%",
            "伤害: 590%",
            "伤害: 600%",
            "伤害: 610%",
            "伤害: 620%",
            "伤害: 630%",
            "伤害: 640%",
            "伤害: 650%",
            "伤害: 660%",
            "伤害: 670%",
            "伤害: 680%",
            "伤害: 690%",
            "伤害: 700%",
            "伤害: 710%",
            "伤害: 720%",
            "伤害: 730%",
            "伤害: 740%",
            "伤害: 750%",
            "伤害: 760%",
            "伤害: 770%",
            "伤害: 780%",
            "伤害: 790%",
            "伤害: 800%",
            "伤害: 810%",
            "伤害: 820%",
            "伤害: 830%",
            "伤害: 840%",
            "伤害: 850%",
            "伤害: 860%",
            "伤害: 870%",
            "伤害: 880%",
            "伤害: 890%",
            "伤害: 900%",
            "伤害: 910%",
            "伤害: 920%",
            "伤害: 930%",
            "伤害: 940%",
            "伤害: 950%",
            "伤害: 960%",
            "伤害: 970%",
            "伤害: 980%",
            "伤害: 990%",
            "伤害: 1000%",
            "伤害: 1010%",
            "伤害: 1020%",
            "伤害: 1030%",
            "伤害: 1040%",
            "伤害: 1050%",
            "伤害: 1060%",
            "伤害: 1070%",
            "伤害: 1080%",
            "伤害: 1090%",
            "伤害: 1100%",
            "伤害: 1110%",
            "伤害: 1120%",
            "伤害: 1130%",
            "伤害: 1140%",
            "伤害: 1150%",
            "伤害: 1160%",
            "伤害: 1170%",
            "伤害: 1180%",
            "伤害: 1190%",
            "伤害: 1200%"
        }
    }),
    ["副-菜问-词条"] = TagType.New({
        ["名字"] = "副-菜问-词条",
        ["最高等级"] = 100,
        ["详细属性"] = [[生命：{[副_菜问召唤.额外召唤物属性.1.属性增伤.倍率]*100*(1+[1.属性乘以百分比.生命]/100)}%
攻击：{[副_菜问召唤.额外召唤物属性.2.属性增伤.倍率]*100*(1+[1.属性乘以百分比.攻击]/100)}% ]],
        ["功能"] = {
            {
                ["影响怪物"] = {
                    "副-召唤物-菜问"
                },
                ["影响关键字"] = "",
                ["属性乘以百分比"] = {
                    ["生命"] = "5",
                    ["攻击"] = "5"
                },
                ["额外属性倍率"] = 1,
                ["额外词条等级"] = 1,
                ["类型"] = "SummonTagHandler",
                ["打印信息"] = false,
                ["m_trigger"] = "召唤时",
                ["优先级"] = 5,
                ["冷却"] = 0,
                ["每级增强"] = 1,
                ["几率"] = 0,
                ["升级增加数值"] = {
                    {
                        ["paramName"] = "额外属性倍率",
                        ["number"] = 1
                    }
                }
            }
        },
        ["各级描述"] = {
            [[生命：210%
攻击：32% ]],
            [[生命：220%
攻击：33% ]],
            [[生命：230%
攻击：35% ]],
            [[生命：240%
攻击：36% ]],
            [[生命：250%
攻击：38% ]],
            [[生命：260%
攻击：39% ]],
            [[生命：270%
攻击：41% ]],
            [[生命：280%
攻击：42% ]],
            [[生命：290%
攻击：44% ]],
            [[生命：300%
攻击：45% ]],
            [[生命：310%
攻击：47% ]],
            [[生命：320%
攻击：48% ]],
            [[生命：330%
攻击：50% ]],
            [[生命：340%
攻击：51% ]],
            [[生命：350%
攻击：53% ]],
            [[生命：360%
攻击：54% ]],
            [[生命：370%
攻击：56% ]],
            [[生命：380%
攻击：57% ]],
            [[生命：390%
攻击：59% ]],
            [[生命：400%
攻击：60% ]],
            [[生命：410%
攻击：62% ]],
            [[生命：420%
攻击：63% ]],
            [[生命：430%
攻击：65% ]],
            [[生命：440%
攻击：66% ]],
            [[生命：450%
攻击：68% ]],
            [[生命：460%
攻击：69% ]],
            [[生命：470%
攻击：71% ]],
            [[生命：480%
攻击：72% ]],
            [[生命：490%
攻击：74% ]],
            [[生命：500%
攻击：75% ]],
            [[生命：510%
攻击：77% ]],
            [[生命：520%
攻击：78% ]],
            [[生命：530%
攻击：80% ]],
            [[生命：540%
攻击：81% ]],
            [[生命：550%
攻击：83% ]],
            [[生命：560%
攻击：84% ]],
            [[生命：570%
攻击：86% ]],
            [[生命：580%
攻击：87% ]],
            [[生命：590%
攻击：89% ]],
            [[生命：600%
攻击：90% ]],
            [[生命：610%
攻击：92% ]],
            [[生命：620%
攻击：93% ]],
            [[生命：630%
攻击：95% ]],
            [[生命：640%
攻击：96% ]],
            [[生命：650%
攻击：98% ]],
            [[生命：660%
攻击：99% ]],
            [[生命：670%
攻击：101% ]],
            [[生命：680%
攻击：102% ]],
            [[生命：690%
攻击：104% ]],
            [[生命：700%
攻击：105% ]],
            [[生命：710%
攻击：107% ]],
            [[生命：720%
攻击：108% ]],
            [[生命：730%
攻击：110% ]],
            [[生命：740%
攻击：111% ]],
            [[生命：750%
攻击：113% ]],
            [[生命：760%
攻击：114% ]],
            [[生命：770%
攻击：116% ]],
            [[生命：780%
攻击：117% ]],
            [[生命：790%
攻击：119% ]],
            [[生命：800%
攻击：120% ]],
            [[生命：810%
攻击：122% ]],
            [[生命：820%
攻击：123% ]],
            [[生命：830%
攻击：125% ]],
            [[生命：840%
攻击：126% ]],
            [[生命：850%
攻击：128% ]],
            [[生命：860%
攻击：129% ]],
            [[生命：870%
攻击：131% ]],
            [[生命：880%
攻击：132% ]],
            [[生命：890%
攻击：134% ]],
            [[生命：900%
攻击：135% ]],
            [[生命：910%
攻击：137% ]],
            [[生命：920%
攻击：138% ]],
            [[生命：930%
攻击：140% ]],
            [[生命：940%
攻击：141% ]],
            [[生命：950%
攻击：143% ]],
            [[生命：960%
攻击：144% ]],
            [[生命：970%
攻击：146% ]],
            [[生命：980%
攻击：147% ]],
            [[生命：990%
攻击：149% ]],
            [[生命：1000%
攻击：150% ]],
            [[生命：1010%
攻击：152% ]],
            [[生命：1020%
攻击：153% ]],
            [[生命：1030%
攻击：155% ]],
            [[生命：1040%
攻击：156% ]],
            [[生命：1050%
攻击：158% ]],
            [[生命：1060%
攻击：159% ]],
            [[生命：1070%
攻击：161% ]],
            [[生命：1080%
攻击：162% ]],
            [[生命：1090%
攻击：164% ]],
            [[生命：1100%
攻击：165% ]],
            [[生命：1110%
攻击：167% ]],
            [[生命：1120%
攻击：168% ]],
            [[生命：1130%
攻击：170% ]],
            [[生命：1140%
攻击：171% ]],
            [[生命：1150%
攻击：173% ]],
            [[生命：1160%
攻击：174% ]],
            [[生命：1170%
攻击：176% ]],
            [[生命：1180%
攻击：177% ]],
            [[生命：1190%
攻击：179% ]],
            [[生命：1200%
攻击：180% ]]
        }
    }),
    ["副-豌豆射手-词条"] = TagType.New({
        ["名字"] = "副-豌豆射手-词条",
        ["最高等级"] = 100,
        ["详细属性"] = [[生命：{[副_召唤_豌豆射手.额外召唤物属性.1.属性增伤.倍率]*100*(1+[1.属性乘以百分比.生命]/100)}%
攻击：{[副_召唤_豌豆射手.额外召唤物属性.2.属性增伤.倍率]*100*(1+[1.属性乘以百分比.攻击]/100)}% ]],
        ["功能"] = {
            {
                ["影响怪物"] = {
                    "副-召唤物-豌豆射手"
                },
                ["影响关键字"] = "",
                ["属性乘以百分比"] = {
                    ["生命"] = "5",
                    ["攻击"] = "5"
                },
                ["额外属性倍率"] = 1,
                ["额外词条等级"] = 1,
                ["类型"] = "SummonTagHandler",
                ["打印信息"] = false,
                ["m_trigger"] = "召唤时",
                ["优先级"] = 5,
                ["冷却"] = 0,
                ["每级增强"] = 1,
                ["几率"] = 0
            }
        },
        ["各级描述"] = {
            [[生命：210%
攻击：11% ]],
            [[生命：220%
攻击：11% ]],
            [[生命：230%
攻击：12% ]],
            [[生命：240%
攻击：12% ]],
            [[生命：250%
攻击：13% ]],
            [[生命：260%
攻击：13% ]],
            [[生命：270%
攻击：14% ]],
            [[生命：280%
攻击：14% ]],
            [[生命：290%
攻击：15% ]],
            [[生命：300%
攻击：15% ]],
            [[生命：310%
攻击：16% ]],
            [[生命：320%
攻击：16% ]],
            [[生命：330%
攻击：17% ]],
            [[生命：340%
攻击：17% ]],
            [[生命：350%
攻击：18% ]],
            [[生命：360%
攻击：18% ]],
            [[生命：370%
攻击：19% ]],
            [[生命：380%
攻击：19% ]],
            [[生命：390%
攻击：20% ]],
            [[生命：400%
攻击：20% ]],
            [[生命：410%
攻击：21% ]],
            [[生命：420%
攻击：21% ]],
            [[生命：430%
攻击：22% ]],
            [[生命：440%
攻击：22% ]],
            [[生命：450%
攻击：23% ]],
            [[生命：460%
攻击：23% ]],
            [[生命：470%
攻击：24% ]],
            [[生命：480%
攻击：24% ]],
            [[生命：490%
攻击：25% ]],
            [[生命：500%
攻击：25% ]],
            [[生命：510%
攻击：26% ]],
            [[生命：520%
攻击：26% ]],
            [[生命：530%
攻击：27% ]],
            [[生命：540%
攻击：27% ]],
            [[生命：550%
攻击：28% ]],
            [[生命：560%
攻击：28% ]],
            [[生命：570%
攻击：29% ]],
            [[生命：580%
攻击：29% ]],
            [[生命：590%
攻击：30% ]],
            [[生命：600%
攻击：30% ]],
            [[生命：610%
攻击：31% ]],
            [[生命：620%
攻击：31% ]],
            [[生命：630%
攻击：32% ]],
            [[生命：640%
攻击：32% ]],
            [[生命：650%
攻击：33% ]],
            [[生命：660%
攻击：33% ]],
            [[生命：670%
攻击：34% ]],
            [[生命：680%
攻击：34% ]],
            [[生命：690%
攻击：35% ]],
            [[生命：700%
攻击：35% ]],
            [[生命：710%
攻击：36% ]],
            [[生命：720%
攻击：36% ]],
            [[生命：730%
攻击：37% ]],
            [[生命：740%
攻击：37% ]],
            [[生命：750%
攻击：38% ]],
            [[生命：760%
攻击：38% ]],
            [[生命：770%
攻击：39% ]],
            [[生命：780%
攻击：39% ]],
            [[生命：790%
攻击：40% ]],
            [[生命：800%
攻击：40% ]],
            [[生命：810%
攻击：41% ]],
            [[生命：820%
攻击：41% ]],
            [[生命：830%
攻击：42% ]],
            [[生命：840%
攻击：42% ]],
            [[生命：850%
攻击：43% ]],
            [[生命：860%
攻击：43% ]],
            [[生命：870%
攻击：44% ]],
            [[生命：880%
攻击：44% ]],
            [[生命：890%
攻击：45% ]],
            [[生命：900%
攻击：45% ]],
            [[生命：910%
攻击：46% ]],
            [[生命：920%
攻击：46% ]],
            [[生命：930%
攻击：47% ]],
            [[生命：940%
攻击：47% ]],
            [[生命：950%
攻击：48% ]],
            [[生命：960%
攻击：48% ]],
            [[生命：970%
攻击：49% ]],
            [[生命：980%
攻击：49% ]],
            [[生命：990%
攻击：50% ]],
            [[生命：1000%
攻击：50% ]],
            [[生命：1010%
攻击：51% ]],
            [[生命：1020%
攻击：51% ]],
            [[生命：1030%
攻击：52% ]],
            [[生命：1040%
攻击：52% ]],
            [[生命：1050%
攻击：53% ]],
            [[生命：1060%
攻击：53% ]],
            [[生命：1070%
攻击：54% ]],
            [[生命：1080%
攻击：54% ]],
            [[生命：1090%
攻击：55% ]],
            [[生命：1100%
攻击：55% ]],
            [[生命：1110%
攻击：56% ]],
            [[生命：1120%
攻击：56% ]],
            [[生命：1130%
攻击：57% ]],
            [[生命：1140%
攻击：57% ]],
            [[生命：1150%
攻击：58% ]],
            [[生命：1160%
攻击：58% ]],
            [[生命：1170%
攻击：59% ]],
            [[生命：1180%
攻击：59% ]],
            [[生命：1190%
攻击：60% ]],
            [[生命：1200%
攻击：60% ]]
        }
    }),
    ["副-仙人掌-词条"] = TagType.New({
        ["名字"] = "副-仙人掌-词条",
        ["最高等级"] = 100,
        ["详细属性"] = "[1.属性乘以百分比]",
        ["功能"] = {
            {
                ["影响怪物"] = {
                    "副-召唤物-仙人掌"
                },
                ["影响关键字"] = "",
                ["属性乘以百分比"] = {
                    ["攻击"] = "5",
                    ["生命"] = "5"
                },
                ["额外属性倍率"] = 1,
                ["额外词条等级"] = 1,
                ["类型"] = "SummonTagHandler",
                ["打印信息"] = false,
                ["m_trigger"] = "召唤时",
                ["优先级"] = 5,
                ["冷却"] = 0,
                ["每级增强"] = 1,
                ["几率"] = 0,
                ["升级增加数值"] = {
                    {
                        ["paramName"] = "额外属性倍率",
                        ["number"] = 1
                    }
                }
            }
        }
    }),
    ["副-椰子炮-词条"] = TagType.New({
        ["名字"] = "副-椰子炮-词条",
        ["最高等级"] = 100,
        ["详细属性"] = "[1.属性乘以百分比]",
        ["功能"] = {
            {
                ["影响怪物"] = {
                    "副-召唤物-椰子炮"
                },
                ["影响关键字"] = "",
                ["属性乘以百分比"] = {
                    ["生命"] = "3",
                    ["攻击"] = "3"
                },
                ["额外属性倍率"] = 1,
                ["额外词条等级"] = 1,
                ["类型"] = "SummonTagHandler",
                ["打印信息"] = false,
                ["m_trigger"] = "召唤时",
                ["优先级"] = 5,
                ["冷却"] = 0,
                ["每级增强"] = 1,
                ["几率"] = 0,
                ["升级增加数值"] = {
                    {
                        ["paramName"] = "额外属性倍率",
                        ["number"] = 1
                    }
                }
            }
        }
    }),
    ["副-火爆辣椒-词条"] = TagType.New({
        ["名字"] = "副-火爆辣椒-词条",
        ["最高等级"] = 100,
        ["详细属性"] = "爆炸伤害： [220:1.2]",
        ["功能"] = {
            {
                ["影响怪物"] = {
                    nil
                },
                ["影响关键字"] = "",
                ["额外属性倍率"] = 1,
                ["额外词条等级"] = 1,
                ["类型"] = "SummonTagHandler",
                ["打印信息"] = false,
                ["m_trigger"] = "召唤时",
                ["优先级"] = 5,
                ["冷却"] = 0,
                ["每级增强"] = 1,
                ["几率"] = 0
            }
        }
    }),
    ["副-辣椒投手-词条"] = TagType.New({
        ["名字"] = "副-辣椒投手-词条",
        ["最高等级"] = 100,
        ["详细属性"] = "[1.属性乘以百分比]",
        ["功能"] = {
            {
                ["影响怪物"] = {
                    "副-召唤物-辣椒投手"
                },
                ["影响关键字"] = "",
                ["属性乘以百分比"] = {
                    ["攻击"] = "5",
                    ["生命"] = "5"
                },
                ["额外属性倍率"] = 1,
                ["额外词条等级"] = 1,
                ["类型"] = "SummonTagHandler",
                ["打印信息"] = false,
                ["m_trigger"] = "召唤时",
                ["优先级"] = 5,
                ["冷却"] = 0,
                ["每级增强"] = 1,
                ["几率"] = 0
            }
        }
    }),
    ["副-钢铁地刺-词条"] = TagType.New({
        ["名字"] = "副-钢铁地刺-词条",
        ["最高等级"] = 100,
        ["详细属性"] = [[伤害：[1.威力增加]%
范围+[1.修改数值.1]% ]],
        ["功能"] = {
            {
                ["影响魔法关键字"] = "",
                ["威力增加"] = 0.05,
                ["威力增加表达式"] = "",
                ["取消"] = false,
                ["修改数值"] = {
                    {
                        ["objectName"] = "钢铁地刺_脉冲",
                        ["paramName"] = "尺寸倍率",
                        ["paramValue"] = {
                            ["倍率"] = 1,
                            ["增加类型"] = "增加",
                            ["乘以基础数值"] = false
                        },
                        ["isAlways"] = false
                    }
                },
                ["修改数值倍率"] = 1,
                ["释放魔法继承威力"] = false,
                ["释放魔法威力增加"] = 0,
                ["类型"] = "SpellTagHandler",
                ["打印信息"] = false,
                ["m_trigger"] = "释放魔法时",
                ["优先级"] = 5,
                ["冷却"] = 0,
                ["每级增强"] = 1,
                ["几率"] = 0,
                ["升级增加数值"] = {
                    {
                        ["paramName"] = "威力增加",
                        ["number"] = 1
                    },
                    {
                        ["paramName"] = "修改数值倍率",
                        ["number"] = 1
                    }
                }
            }
        }
    }),
    ["副-星星果-词条"] = TagType.New({
        ["名字"] = "副-星星果-词条",
        ["最高等级"] = 100,
        ["详细属性"] = "[1.属性乘以百分比]",
        ["功能"] = {
            {
                ["影响怪物"] = {
                    "副-召唤物-星星果"
                },
                ["影响关键字"] = "",
                ["属性乘以百分比"] = {
                    ["生命"] = "8",
                    ["攻击"] = "8"
                },
                ["额外属性倍率"] = 1,
                ["额外词条等级"] = 1,
                ["类型"] = "SummonTagHandler",
                ["打印信息"] = false,
                ["m_trigger"] = "召唤时",
                ["优先级"] = 5,
                ["冷却"] = 0,
                ["每级增强"] = 1,
                ["几率"] = 0,
                ["升级增加数值"] = {
                    {
                        ["paramName"] = "额外属性倍率",
                        ["number"] = 1
                    }
                }
            }
        }
    }),
    ["副-窝瓜-词条"] = TagType.New({
        ["名字"] = "副-窝瓜-词条",
        ["最高等级"] = 1,
        ["详细属性"] = "[1.属性乘以比例]",
        ["功能"] = {
            {
                ["影响怪物"] = {
                    nil
                },
                ["影响关键字"] = "",
                ["额外属性倍率"] = 1,
                ["额外词条等级"] = 1,
                ["类型"] = "SummonTagHandler",
                ["打印信息"] = false,
                ["m_trigger"] = "召唤时",
                ["优先级"] = 5,
                ["冷却"] = 0,
                ["每级增强"] = 1,
                ["几率"] = 0
            }
        }
    }),
    ["副-魅惑菇-词条"] = TagType.New({
        ["名字"] = "副-魅惑菇-词条",
        ["最高等级"] = 1,
        ["详细属性"] = "[1.属性乘以比例]",
        ["功能"] = {
            {
                ["影响怪物"] = {
                    "副-召唤物-魅惑菇"
                },
                ["影响关键字"] = "",
                ["额外属性倍率"] = 1,
                ["额外词条等级"] = 1,
                ["类型"] = "SummonTagHandler",
                ["打印信息"] = false,
                ["m_trigger"] = "召唤时",
                ["优先级"] = 5,
                ["冷却"] = 0,
                ["每级增强"] = 1,
                ["几率"] = 0
            }
        }
    })
}loaded = true
end

---@param tagTypeName string
---@return TagType
function TagTypeConfig.Get(tagTypeName)
    if not loaded then
        LoadConfig()
    end
    return TagTypeConfig.config[tagTypeName]
end

---@return TagType[]
function TagTypeConfig.GetAll()
    if not loaded then
        LoadConfig()
    end
    return TagTypeConfig.config
end
return TagTypeConfig
