local MainStorage = game:GetService('MainStorage')
local gg                = require(MainStorage.code.common.MGlobal)    ---@type gg
local TagType      = require(MainStorage.code.common.config_type.tags.TagType)    ---@type TagType

--- 词条配置文件
---@class TagTypeConfig
local TagTypeConfig = {}
local loaded = false

local function LoadConfig()
    TagTypeConfig.config ={
    ["丰收葵_阳光产量提升_词条"] = TagType.New({
        ["名字"] = "丰收葵_阳光产量提升_词条",
        ["最高等级"] = 10,
        ["描述"] = "白天的阳光产量提升",
        ["详细属性"] = "阳光产量+[1.威力增加]%",
        ["功能"] = {
            {
                ["影响魔法"] = {
                    "丰收葵_阳光获取"
                },
                ["影响魔法关键字"] = "",
                ["威力增加"] = 10,
                ["威力增加表达式"] = "",
                ["取消"] = false,
                ["修改数值倍率"] = 1,
                ["释放魔法继承威力"] = false,
                ["释放魔法威力增加"] = 0,
                ["类型"] = "SpellTagHandler",
                ["打印信息"] = false,
                ["m_trigger"] = "释放魔法时",
                ["优先级"] = 5,
                ["冷却"] = 0,
                ["每级增强"] = 1,
                ["几率"] = 0,
                ["条件"] = {
                    {
                        ["目标"] = "场景对象",
                        ["目标场景名"] = "terrain/昼夜交替/山坡太阳",
                        ["条件类型"] = "AxisPositionCondition",
                        ["条件"] = {
                            ["轴"] = "Y",
                            ["最小值"] = 0,
                            ["最大值"] = 100
                        },
                        ["动作"] = "必须"
                    }
                },
                ["升级增加数值"] = {
                    {
                        ["paramName"] = "威力增加",
                        ["number"] = 1
                    }
                }
            }
        }
    }),
    ["伤害强化_词条"] = TagType.New({
        ["名字"] = "伤害强化_词条",
        ["最高等级"] = 10,
        ["描述"] = "所有植物造成的伤害提升",
        ["详细属性"] = "伤害 +[1.属性增伤.1]",
        ["功能"] = {
            {
                ["影响魔法关键字"] = "豌豆射手",
                ["即将击杀"] = false,
                ["要求元素类型"] = "无",
                ["增伤"] = 0,
                ["增加暴击率"] = 0,
                ["增加暴击伤害"] = 0,
                ["属性增伤"] = {
                    {
                        ["倍率"] = 10,
                        ["增加类型"] = "增加",
                        ["乘以基础数值"] = false
                    }
                },
                ["属性增伤倍率"] = 1,
                ["释放魔法继承威力"] = false,
                ["释放魔法威力增加"] = 0,
                ["类型"] = "DamageTagHandler",
                ["打印信息"] = false,
                ["m_trigger"] = "攻击时",
                ["优先级"] = 5,
                ["冷却"] = 0,
                ["每级增强"] = 1,
                ["几率"] = 0,
                ["升级增加数值"] = {
                    {
                        ["paramName"] = "属性增伤倍率",
                        ["number"] = 1
                    }
                }
            }
        }
    }),
    ["射速增加_词条"] = TagType.New({
        ["名字"] = "射速增加_词条",
        ["最高等级"] = 10,
        ["描述"] = "所有植物的射速增加",
        ["详细属性"] = "射速 +[1.修改数值.1]%",
        ["功能"] = {
            {
                ["影响魔法关键字"] = "",
                ["威力增加"] = 0,
                ["威力增加表达式"] = "",
                ["取消"] = false,
                ["修改数值"] = {
                    {
                        ["objectName"] = "伤害魔法",
                        ["paramName"] = "冷却加速",
                        ["paramValue"] = {
                            ["倍率"] = 3,
                            ["增加类型"] = "增加",
                            ["乘以基础数值"] = false
                        },
                        ["isAlways"] = false
                    }
                },
                ["修改数值倍率"] = 1,
                ["释放魔法继承威力"] = false,
                ["释放魔法威力增加"] = 0,
                ["类型"] = "SpellTagHandler",
                ["打印信息"] = false,
                ["m_trigger"] = "释放魔法时",
                ["优先级"] = 5,
                ["冷却"] = 0,
                ["每级增强"] = 1,
                ["几率"] = 0,
                ["升级增加数值"] = {
                    {
                        ["paramName"] = "修改数值倍率",
                        ["number"] = 1
                    }
                }
            }
        }
    }),
    ["产量增加_额外概率提升_词条"] = TagType.New({
        ["名字"] = "产量增加_额外概率提升_词条",
        ["最高等级"] = 10,
        ["描述"] = [[夜晚击败僵尸后额外获得阳光的几率提升
白天的阳光产量提升]],
        ["详细属性"] = [[击败僵尸后额外获得阳光几率+[1.几率]%
阳光产量+[2.威力增加]%]],
        ["功能"] = {
            {
                ["影响魔法关键字"] = "",
                ["即将击杀"] = true,
                ["要求元素类型"] = "无",
                ["增伤"] = 0,
                ["增加暴击率"] = 0,
                ["增加暴击伤害"] = 0,
                ["属性增伤倍率"] = 1,
                ["释放魔法"] = {
                    {
                        ["魔法"] = "向日葵_阳光获取"
                    }
                },
                ["释放魔法继承威力"] = false,
                ["释放魔法威力增加"] = 0,
                ["类型"] = "DamageTagHandler",
                ["打印信息"] = false,
                ["m_trigger"] = "攻击时",
                ["优先级"] = 5,
                ["冷却"] = 0,
                ["每级增强"] = 1,
                ["几率"] = 5,
                ["条件"] = {
                    {
                        ["目标"] = "场景对象",
                        ["目标场景名"] = "terrain/昼夜交替/山坡月亮",
                        ["条件类型"] = "AxisPositionCondition",
                        ["条件"] = {
                            ["轴"] = "Y",
                            ["最小值"] = 0,
                            ["最大值"] = 100
                        },
                        ["动作"] = "必须"
                    }
                },
                ["升级增加数值"] = {
                    {
                        ["paramName"] = "几率",
                        ["number"] = 0.2
                    }
                }
            },
            {
                ["影响魔法"] = {
                    "向日葵_阳光获取"
                },
                ["影响魔法关键字"] = "",
                ["威力增加"] = 7,
                ["威力增加表达式"] = "",
                ["取消"] = false,
                ["修改数值倍率"] = 1,
                ["释放魔法继承威力"] = false,
                ["释放魔法威力增加"] = 0,
                ["类型"] = "SpellTagHandler",
                ["打印信息"] = false,
                ["m_trigger"] = "释放魔法时",
                ["优先级"] = 5,
                ["冷却"] = 0,
                ["每级增强"] = 1,
                ["几率"] = 0,
                ["条件"] = {
                    {
                        ["目标"] = "场景对象",
                        ["目标场景名"] = "terrain/昼夜交替/山坡太阳",
                        ["条件类型"] = "AxisPositionCondition",
                        ["条件"] = {
                            ["轴"] = "Y",
                            ["最小值"] = 0,
                            ["最大值"] = 100
                        },
                        ["动作"] = "必须"
                    }
                },
                ["升级增加数值"] = {
                    {
                        ["paramName"] = "威力增加",
                        ["number"] = 1
                    }
                }
            }
        }
    }),
    ["伤害提升_产量增加_词条"] = TagType.New({
        ["名字"] = "伤害提升_产量增加_词条",
        ["最高等级"] = 10,
        ["描述"] = [[所有植物造成的伤害提升
白天的阳光产量提升]],
        ["详细属性"] = [[植物伤害+[1.属性增伤.1]
阳光产量+[2.威力增加]%]],
        ["功能"] = {
            {
                ["影响魔法关键字"] = "",
                ["即将击杀"] = false,
                ["要求元素类型"] = "无",
                ["增伤"] = 0,
                ["增加暴击率"] = 0,
                ["增加暴击伤害"] = 0,
                ["属性增伤"] = {
                    {
                        ["倍率"] = 2,
                        ["增加类型"] = "增加",
                        ["乘以基础数值"] = false
                    }
                },
                ["属性增伤倍率"] = 1,
                ["释放魔法继承威力"] = false,
                ["释放魔法威力增加"] = 0,
                ["类型"] = "DamageTagHandler",
                ["打印信息"] = false,
                ["m_trigger"] = "攻击时",
                ["优先级"] = 5,
                ["冷却"] = 0,
                ["每级增强"] = 1,
                ["几率"] = 0,
                ["升级增加数值"] = {
                    {
                        ["paramName"] = "属性增伤倍率",
                        ["number"] = 1
                    }
                }
            },
            {
                ["影响魔法"] = {
                    "向日葵_阳光获取"
                },
                ["影响魔法关键字"] = "",
                ["威力增加"] = 5,
                ["威力增加表达式"] = "",
                ["取消"] = false,
                ["修改数值倍率"] = 1,
                ["释放魔法继承威力"] = false,
                ["释放魔法威力增加"] = 0,
                ["类型"] = "SpellTagHandler",
                ["打印信息"] = false,
                ["m_trigger"] = "释放魔法时",
                ["优先级"] = 5,
                ["冷却"] = 0,
                ["每级增强"] = 1,
                ["几率"] = 0,
                ["条件"] = {
                    {
                        ["目标"] = "场景对象",
                        ["目标场景名"] = "terrain/昼夜交替/山坡太阳",
                        ["条件类型"] = "AxisPositionCondition",
                        ["条件"] = {
                            ["轴"] = "Y",
                            ["最小值"] = 0,
                            ["最大值"] = 100
                        },
                        ["动作"] = "必须"
                    }
                },
                ["升级增加数值"] = {
                    {
                        ["paramName"] = "威力增加",
                        ["number"] = 1
                    }
                }
            }
        }
    }),
    ["向日葵_阳光产量提升2_词条"] = TagType.New({
        ["名字"] = "向日葵_阳光产量提升2_词条",
        ["最高等级"] = 10,
        ["描述"] = "白天的阳光产量提升",
        ["详细属性"] = "阳光产量+[1.威力增加]%",
        ["功能"] = {
            {
                ["影响魔法"] = {
                    "向日葵_阳光获取"
                },
                ["影响魔法关键字"] = "向日葵",
                ["威力增加"] = 10,
                ["威力增加表达式"] = "",
                ["取消"] = false,
                ["修改数值倍率"] = 1,
                ["释放魔法继承威力"] = false,
                ["释放魔法威力增加"] = 0,
                ["类型"] = "SpellTagHandler",
                ["打印信息"] = false,
                ["m_trigger"] = "释放魔法时",
                ["优先级"] = 5,
                ["冷却"] = 0,
                ["每级增强"] = 1,
                ["几率"] = 0,
                ["条件"] = {
                    {
                        ["目标"] = "场景对象",
                        ["目标场景名"] = "terrain/昼夜交替/山坡太阳",
                        ["条件类型"] = "AxisPositionCondition",
                        ["条件"] = {
                            ["轴"] = "Y",
                            ["最小值"] = 0,
                            ["最大值"] = 100
                        },
                        ["动作"] = "必须"
                    }
                },
                ["升级增加数值"] = {
                    {
                        ["paramName"] = "威力增加",
                        ["number"] = 1
                    }
                }
            }
        }
    }),
    ["向日葵_阳光产量提升_词条"] = TagType.New({
        ["名字"] = "向日葵_阳光产量提升_词条",
        ["最高等级"] = 10,
        ["描述"] = "白天的阳光产量提升",
        ["详细属性"] = "阳光产量+[1.威力增加]%",
        ["功能"] = {
            {
                ["影响魔法"] = {
                    "向日葵_阳光获取"
                },
                ["影响魔法关键字"] = "向日葵",
                ["威力增加"] = 5,
                ["威力增加表达式"] = "",
                ["取消"] = false,
                ["修改数值倍率"] = 1,
                ["释放魔法继承威力"] = false,
                ["释放魔法威力增加"] = 0,
                ["类型"] = "SpellTagHandler",
                ["打印信息"] = false,
                ["m_trigger"] = "释放魔法时",
                ["优先级"] = 5,
                ["冷却"] = 0,
                ["每级增强"] = 1,
                ["几率"] = 0,
                ["条件"] = {
                    {
                        ["目标"] = "场景对象",
                        ["目标场景名"] = "terrain/昼夜交替/山坡太阳",
                        ["条件类型"] = "AxisPositionCondition",
                        ["条件"] = {
                            ["轴"] = "Y",
                            ["最小值"] = 0,
                            ["最大值"] = 1000
                        },
                        ["动作"] = "必须"
                    }
                },
                ["升级增加数值"] = {
                    {
                        ["paramName"] = "威力增加",
                        ["number"] = 1
                    }
                }
            }
        }
    }),
    ["向日葵_额外获得阳光_词条"] = TagType.New({
        ["名字"] = "向日葵_额外获得阳光_词条",
        ["最高等级"] = 10,
        ["描述"] = "夜晚击败僵尸后额外获得阳光的几率提升",
        ["详细属性"] = "击败僵尸后额外获得阳光几率+[1.几率]%",
        ["功能"] = {
            {
                ["影响魔法关键字"] = "",
                ["即将击杀"] = true,
                ["要求元素类型"] = "无",
                ["增伤"] = 0,
                ["增加暴击率"] = 0,
                ["增加暴击伤害"] = 0,
                ["属性增伤倍率"] = 1,
                ["释放魔法"] = {
                    {
                        ["魔法"] = "向日葵_阳光获取"
                    }
                },
                ["释放魔法继承威力"] = false,
                ["释放魔法威力增加"] = 0,
                ["类型"] = "DamageTagHandler",
                ["打印信息"] = false,
                ["m_trigger"] = "攻击时",
                ["优先级"] = 5,
                ["冷却"] = 0,
                ["每级增强"] = 1,
                ["几率"] = 5,
                ["条件"] = {
                    {
                        ["目标"] = "场景对象",
                        ["目标场景名"] = "terrain/昼夜交替/山坡月亮",
                        ["条件类型"] = "AxisPositionCondition",
                        ["条件"] = {
                            ["轴"] = "Y",
                            ["最小值"] = 0,
                            ["最大值"] = 100
                        },
                        ["动作"] = "必须"
                    }
                },
                ["升级增加数值"] = {
                    {
                        ["paramName"] = "几率",
                        ["number"] = 0.35
                    }
                }
            }
        }
    }),
    ["持续伤害_词条_大喷菇"] = TagType.New({
        ["名字"] = "持续伤害_词条_大喷菇",
        ["最高等级"] = 20,
        ["描述"] = "持续伤害增加",
        ["详细属性"] = "持续伤害+[1.增伤]%",
        ["功能"] = {
            {
                ["影响魔法"] = {
                    "胆小菇_dot"
                },
                ["影响魔法关键字"] = "",
                ["即将击杀"] = false,
                ["要求元素类型"] = "毒",
                ["增伤"] = 5,
                ["增加暴击率"] = 0,
                ["增加暴击伤害"] = 0,
                ["属性增伤倍率"] = 1,
                ["释放魔法继承威力"] = false,
                ["释放魔法威力增加"] = 0,
                ["类型"] = "DamageTagHandler",
                ["打印信息"] = false,
                ["m_trigger"] = "攻击时",
                ["优先级"] = 5,
                ["冷却"] = 0,
                ["每级增强"] = 1,
                ["几率"] = 0,
                ["升级增加数值"] = {
                    {
                        ["paramName"] = "增伤",
                        ["number"] = 1
                    }
                }
            }
        }
    }),
    ["攻击1_词条_大喷菇"] = TagType.New({
        ["名字"] = "攻击1_词条_大喷菇",
        ["最高等级"] = 20,
        ["描述"] = "伤害增加",
        ["详细属性"] = "伤害 +[1.增伤]%",
        ["功能"] = {
            {
                ["影响魔法关键字"] = "大喷菇",
                ["即将击杀"] = false,
                ["要求元素类型"] = "无",
                ["增伤"] = 10,
                ["增加暴击率"] = 0,
                ["增加暴击伤害"] = 0,
                ["属性增伤倍率"] = 1,
                ["释放魔法继承威力"] = false,
                ["释放魔法威力增加"] = 0,
                ["类型"] = "DamageTagHandler",
                ["打印信息"] = false,
                ["m_trigger"] = "攻击时",
                ["优先级"] = 5,
                ["冷却"] = 0,
                ["每级增强"] = 1,
                ["几率"] = 0,
                ["升级增加数值"] = {
                    {
                        ["paramName"] = "增伤",
                        ["number"] = 1
                    }
                }
            }
        }
    }),
    ["射速1_词条_小喷菇"] = TagType.New({
        ["名字"] = "射速1_词条_小喷菇",
        ["最高等级"] = 10,
        ["描述"] = "射速增加",
        ["详细属性"] = "射速 +[1.修改数值.1]%",
        ["功能"] = {
            {
                ["影响魔法关键字"] = "小喷菇",
                ["威力增加"] = 0,
                ["威力增加表达式"] = "",
                ["取消"] = false,
                ["修改数值"] = {
                    {
                        ["objectName"] = "伤害魔法",
                        ["paramName"] = "冷却加速",
                        ["paramValue"] = {
                            ["倍率"] = 5,
                            ["增加类型"] = "增加",
                            ["乘以基础数值"] = false
                        },
                        ["isAlways"] = false
                    }
                },
                ["修改数值倍率"] = 1,
                ["释放魔法继承威力"] = false,
                ["释放魔法威力增加"] = 0,
                ["类型"] = "SpellTagHandler",
                ["打印信息"] = false,
                ["m_trigger"] = "释放魔法时",
                ["优先级"] = 5,
                ["冷却"] = 0,
                ["每级增强"] = 1,
                ["几率"] = 0,
                ["升级增加数值"] = {
                    {
                        ["paramName"] = "修改数值倍率",
                        ["number"] = 1
                    }
                }
            }
        }
    }),
    ["攻击1_词条_小喷菇"] = TagType.New({
        ["名字"] = "攻击1_词条_小喷菇",
        ["最高等级"] = 10,
        ["描述"] = "伤害增加",
        ["详细属性"] = "伤害 +[1.增伤]%",
        ["功能"] = {
            {
                ["影响魔法关键字"] = "小喷菇",
                ["即将击杀"] = false,
                ["要求元素类型"] = "无",
                ["增伤"] = 5,
                ["增加暴击率"] = 0,
                ["增加暴击伤害"] = 0,
                ["属性增伤倍率"] = 1,
                ["释放魔法继承威力"] = false,
                ["释放魔法威力增加"] = 0,
                ["类型"] = "DamageTagHandler",
                ["打印信息"] = false,
                ["m_trigger"] = "攻击时",
                ["优先级"] = 5,
                ["冷却"] = 0,
                ["每级增强"] = 1,
                ["几率"] = 0,
                ["升级增加数值"] = {
                    {
                        ["paramName"] = "增伤",
                        ["number"] = 1
                    }
                }
            }
        }
    }),
    ["生命1_词条_小喷菇"] = TagType.New({
        ["名字"] = "生命1_词条_小喷菇",
        ["最高等级"] = 10,
        ["描述"] = "生命增加",
        ["详细属性"] = "生命+[1.增加]",
        ["功能"] = {
            {
                ["属性"] = "生命",
                ["增加"] = 10,
                ["百分比"] = false,
                ["类型"] = "AttributeTagHandler",
                ["打印信息"] = false,
                ["m_trigger"] = "生命",
                ["优先级"] = 5,
                ["冷却"] = 0,
                ["每级增强"] = 1,
                ["几率"] = 0,
                ["升级增加数值"] = {
                    {
                        ["paramName"] = "增加",
                        ["number"] = 1
                    }
                }
            }
        }
    }),
    ["持续伤害_词条_胆小菇"] = TagType.New({
        ["名字"] = "持续伤害_词条_胆小菇",
        ["最高等级"] = 10,
        ["描述"] = "持续伤害提升",
        ["详细属性"] = "持续伤害+[1.增伤]%",
        ["功能"] = {
            {
                ["影响魔法"] = {
                    "胆小菇_dot"
                },
                ["影响魔法关键字"] = "",
                ["即将击杀"] = false,
                ["要求元素类型"] = "毒",
                ["增伤"] = 10,
                ["增加暴击率"] = 0,
                ["增加暴击伤害"] = 0,
                ["属性增伤倍率"] = 1,
                ["释放魔法继承威力"] = false,
                ["释放魔法威力增加"] = 0,
                ["类型"] = "DamageTagHandler",
                ["打印信息"] = false,
                ["m_trigger"] = "攻击时",
                ["优先级"] = 5,
                ["冷却"] = 0,
                ["每级增强"] = 1,
                ["几率"] = 0,
                ["升级增加数值"] = {
                    {
                        ["paramName"] = "增伤",
                        ["number"] = 1
                    }
                }
            }
        }
    }),
    ["攻击1_词条_胆小菇"] = TagType.New({
        ["名字"] = "攻击1_词条_胆小菇",
        ["最高等级"] = 10,
        ["描述"] = "伤害增加",
        ["详细属性"] = "伤害 +[1.增伤]%",
        ["功能"] = {
            {
                ["影响魔法关键字"] = "小喷菇",
                ["即将击杀"] = false,
                ["要求元素类型"] = "无",
                ["增伤"] = 5,
                ["增加暴击率"] = 0,
                ["增加暴击伤害"] = 0,
                ["属性增伤倍率"] = 1,
                ["释放魔法继承威力"] = false,
                ["释放魔法威力增加"] = 0,
                ["类型"] = "DamageTagHandler",
                ["打印信息"] = false,
                ["m_trigger"] = "攻击时",
                ["优先级"] = 5,
                ["冷却"] = 0,
                ["每级增强"] = 1,
                ["几率"] = 0,
                ["升级增加数值"] = {
                    {
                        ["paramName"] = "增伤",
                        ["number"] = 1
                    }
                }
            }
        }
    }),
    ["射速1_词条_三头豌豆"] = TagType.New({
        ["名字"] = "射速1_词条_三头豌豆",
        ["最高等级"] = 10,
        ["描述"] = "射速增加",
        ["详细属性"] = "射速 +[1.修改数值.1]%",
        ["功能"] = {
            {
                ["影响魔法关键字"] = "三头豌豆",
                ["威力增加"] = 0,
                ["威力增加表达式"] = "",
                ["取消"] = false,
                ["修改数值"] = {
                    {
                        ["objectName"] = "伤害魔法",
                        ["paramName"] = "冷却加速",
                        ["paramValue"] = {
                            ["倍率"] = 6,
                            ["增加类型"] = "增加",
                            ["乘以基础数值"] = false
                        },
                        ["isAlways"] = false
                    }
                },
                ["修改数值倍率"] = 1,
                ["释放魔法继承威力"] = false,
                ["释放魔法威力增加"] = 0,
                ["类型"] = "SpellTagHandler",
                ["打印信息"] = false,
                ["m_trigger"] = "释放魔法时",
                ["优先级"] = 5,
                ["冷却"] = 0,
                ["每级增强"] = 1,
                ["几率"] = 0,
                ["升级增加数值"] = {
                    {
                        ["paramName"] = "修改数值倍率",
                        ["number"] = 1
                    }
                }
            }
        }
    }),
    ["射速1_词条_高速射手"] = TagType.New({
        ["名字"] = "射速1_词条_高速射手",
        ["最高等级"] = 10,
        ["描述"] = "射速增加",
        ["详细属性"] = "射速 +[1.修改数值.1]%",
        ["功能"] = {
            {
                ["影响魔法关键字"] = "高速射手",
                ["威力增加"] = 0,
                ["威力增加表达式"] = "",
                ["取消"] = false,
                ["修改数值"] = {
                    {
                        ["objectName"] = "伤害魔法",
                        ["paramName"] = "冷却加速",
                        ["paramValue"] = {
                            ["倍率"] = 6,
                            ["增加类型"] = "增加",
                            ["乘以基础数值"] = false
                        },
                        ["isAlways"] = false
                    }
                },
                ["修改数值倍率"] = 1,
                ["释放魔法继承威力"] = false,
                ["释放魔法威力增加"] = 0,
                ["类型"] = "SpellTagHandler",
                ["打印信息"] = false,
                ["m_trigger"] = "释放魔法时",
                ["优先级"] = 5,
                ["冷却"] = 0,
                ["每级增强"] = 1,
                ["几率"] = 0,
                ["升级增加数值"] = {
                    {
                        ["paramName"] = "修改数值倍率",
                        ["number"] = 1
                    }
                }
            }
        }
    }),
    ["减速1_词条_寒冰射手"] = TagType.New({
        ["名字"] = "减速1_词条_寒冰射手",
        ["最高等级"] = 10,
        ["描述"] = "减速持续时间增加",
        ["详细属性"] = "减速时间 +[1.修改数值.1]%",
        ["功能"] = {
            {
                ["影响魔法"] = {
                    "减速BUFF"
                },
                ["影响魔法关键字"] = "",
                ["威力增加"] = 0,
                ["威力增加表达式"] = "",
                ["取消"] = false,
                ["修改数值"] = {
                    {
                        ["objectName"] = "减速BUFF",
                        ["paramName"] = "持续时间",
                        ["paramValue"] = {
                            ["倍率"] = 2,
                            ["增加类型"] = "倍率",
                            ["乘以基础数值"] = false
                        },
                        ["isAlways"] = false
                    }
                },
                ["修改数值倍率"] = 1,
                ["释放魔法继承威力"] = false,
                ["释放魔法威力增加"] = 0,
                ["类型"] = "SpellTagHandler",
                ["打印信息"] = false,
                ["m_trigger"] = "释放魔法时",
                ["优先级"] = 5,
                ["冷却"] = 0,
                ["每级增强"] = 1,
                ["几率"] = 0,
                ["升级增加数值"] = {
                    {
                        ["paramName"] = "修改数值倍率",
                        ["number"] = 1
                    }
                }
            }
        }
    }),
    ["攻击1_词条_寒冰射手"] = TagType.New({
        ["名字"] = "攻击1_词条_寒冰射手",
        ["最高等级"] = 10,
        ["描述"] = "伤害增加",
        ["详细属性"] = "伤害 +[1.增伤]%",
        ["功能"] = {
            {
                ["影响魔法关键字"] = "寒冰射手",
                ["即将击杀"] = false,
                ["要求元素类型"] = "无",
                ["增伤"] = 5,
                ["增加暴击率"] = 0,
                ["增加暴击伤害"] = 0,
                ["属性增伤倍率"] = 1,
                ["释放魔法继承威力"] = false,
                ["释放魔法威力增加"] = 0,
                ["类型"] = "DamageTagHandler",
                ["打印信息"] = false,
                ["m_trigger"] = "攻击时",
                ["优先级"] = 5,
                ["冷却"] = 0,
                ["每级增强"] = 1,
                ["几率"] = 0,
                ["升级增加数值"] = {
                    {
                        ["paramName"] = "增伤",
                        ["number"] = 1
                    }
                }
            }
        }
    }),
    ["生命1_词条_寒冰射手"] = TagType.New({
        ["名字"] = "生命1_词条_寒冰射手",
        ["最高等级"] = 10,
        ["描述"] = "生命增加",
        ["详细属性"] = "生命+[1.增加]",
        ["功能"] = {
            {
                ["属性"] = "生命",
                ["增加"] = 10,
                ["百分比"] = false,
                ["类型"] = "AttributeTagHandler",
                ["打印信息"] = false,
                ["m_trigger"] = "生命",
                ["优先级"] = 5,
                ["冷却"] = 0,
                ["每级增强"] = 1,
                ["几率"] = 0,
                ["升级增加数值"] = {
                    {
                        ["paramName"] = "增加",
                        ["number"] = 1
                    }
                }
            }
        }
    }),
    ["冷冻1_词条_寒冰加特林"] = TagType.New({
        ["名字"] = "冷冻1_词条_寒冰加特林",
        ["最高等级"] = 10,
        ["描述"] = "造成冷冻的概率提升",
        ["详细属性"] = "冷冻概率 +[1.修改数值.1]%",
        ["功能"] = {
            {
                ["影响魔法"] = {
                    "冰冻BUFF"
                },
                ["影响魔法关键字"] = "",
                ["威力增加"] = 0,
                ["威力增加表达式"] = "",
                ["取消"] = false,
                ["修改数值"] = {
                    {
                        ["objectName"] = "冰冻BUFF",
                        ["paramName"] = "几率",
                        ["paramValue"] = {
                            ["倍率"] = 1.5,
                            ["增加类型"] = "倍率",
                            ["乘以基础数值"] = false
                        },
                        ["isAlways"] = false
                    }
                },
                ["修改数值倍率"] = 1,
                ["释放魔法继承威力"] = false,
                ["释放魔法威力增加"] = 0,
                ["类型"] = "SpellTagHandler",
                ["打印信息"] = false,
                ["m_trigger"] = "释放魔法时",
                ["优先级"] = 5,
                ["冷却"] = 0,
                ["每级增强"] = 1,
                ["几率"] = 0,
                ["升级增加数值"] = {
                    {
                        ["paramName"] = "修改数值倍率",
                        ["number"] = 1
                    }
                }
            }
        }
    }),
    ["减速1_词条_寒冰加特林"] = TagType.New({
        ["名字"] = "减速1_词条_寒冰加特林",
        ["最高等级"] = 10,
        ["描述"] = "减速持续时间增加",
        ["详细属性"] = "减速时间+[1.修改数值.1]%",
        ["功能"] = {
            {
                ["影响魔法关键字"] = "",
                ["威力增加"] = 0,
                ["威力增加表达式"] = "",
                ["取消"] = false,
                ["修改数值"] = {
                    {
                        ["objectName"] = "减速BUFF",
                        ["paramName"] = "持续时间",
                        ["paramValue"] = {
                            ["倍率"] = 5,
                            ["增加类型"] = "倍率",
                            ["乘以基础数值"] = false
                        },
                        ["isAlways"] = false
                    }
                },
                ["修改数值倍率"] = 1,
                ["释放魔法继承威力"] = false,
                ["释放魔法威力增加"] = 0,
                ["类型"] = "SpellTagHandler",
                ["打印信息"] = false,
                ["m_trigger"] = "释放魔法时",
                ["优先级"] = 5,
                ["冷却"] = 0,
                ["每级增强"] = 1,
                ["几率"] = 0,
                ["升级增加数值"] = {
                    {
                        ["paramName"] = "修改数值倍率",
                        ["number"] = 1
                    }
                }
            }
        }
    }),
    ["持续伤害_词条_寒冰加特林"] = TagType.New({
        ["名字"] = "持续伤害_词条_寒冰加特林",
        ["最高等级"] = 10,
        ["描述"] = "持续伤害增加",
        ["详细属性"] = "持续伤害+[1.增伤]%",
        ["功能"] = {
            {
                ["影响魔法"] = {
                    "寒冰加特林_dot"
                },
                ["影响魔法关键字"] = "",
                ["即将击杀"] = false,
                ["要求元素类型"] = "无",
                ["增伤"] = 5,
                ["增加暴击率"] = 0,
                ["增加暴击伤害"] = 0,
                ["属性增伤倍率"] = 1,
                ["释放魔法继承威力"] = false,
                ["释放魔法威力增加"] = 0,
                ["类型"] = "DamageTagHandler",
                ["打印信息"] = false,
                ["m_trigger"] = "攻击时",
                ["优先级"] = 5,
                ["冷却"] = 0,
                ["每级增强"] = 1,
                ["几率"] = 0,
                ["升级增加数值"] = {
                    {
                        ["paramName"] = "增伤",
                        ["number"] = 1
                    }
                }
            }
        }
    }),
    ["攻击1_词条_寒冰加特林"] = TagType.New({
        ["名字"] = "攻击1_词条_寒冰加特林",
        ["最高等级"] = 10,
        ["描述"] = "伤害增加",
        ["详细属性"] = "伤害 +[1.增伤]%",
        ["功能"] = {
            {
                ["影响魔法关键字"] = "寒冰加特林",
                ["即将击杀"] = false,
                ["要求元素类型"] = "无",
                ["增伤"] = 8,
                ["增加暴击率"] = 0,
                ["增加暴击伤害"] = 0,
                ["属性增伤倍率"] = 1,
                ["释放魔法继承威力"] = false,
                ["释放魔法威力增加"] = 0,
                ["类型"] = "DamageTagHandler",
                ["打印信息"] = false,
                ["m_trigger"] = "攻击时",
                ["优先级"] = 5,
                ["冷却"] = 0,
                ["每级增强"] = 1,
                ["几率"] = 0,
                ["升级增加数值"] = {
                    {
                        ["paramName"] = "增伤",
                        ["number"] = 1
                    }
                }
            }
        }
    }),
    ["射速1_词条_高速加特林"] = TagType.New({
        ["名字"] = "射速1_词条_高速加特林",
        ["最高等级"] = 10,
        ["描述"] = "射速增加",
        ["详细属性"] = "射速 +[1.修改数值.1]%",
        ["功能"] = {
            {
                ["影响魔法关键字"] = "高速加特林",
                ["威力增加"] = 0,
                ["威力增加表达式"] = "",
                ["取消"] = false,
                ["修改数值"] = {
                    {
                        ["objectName"] = "伤害魔法",
                        ["paramName"] = "冷却加速",
                        ["paramValue"] = {
                            ["倍率"] = 8,
                            ["增加类型"] = "增加",
                            ["乘以基础数值"] = false
                        },
                        ["isAlways"] = false
                    }
                },
                ["修改数值倍率"] = 1,
                ["释放魔法继承威力"] = false,
                ["释放魔法威力增加"] = 0,
                ["类型"] = "SpellTagHandler",
                ["打印信息"] = false,
                ["m_trigger"] = "释放魔法时",
                ["优先级"] = 5,
                ["冷却"] = 0,
                ["每级增强"] = 1,
                ["几率"] = 0,
                ["升级增加数值"] = {
                    {
                        ["paramName"] = "修改数值倍率",
                        ["number"] = 1
                    }
                }
            }
        }
    }),
    ["攻击1_词条_火焰豌豆"] = TagType.New({
        ["名字"] = "攻击1_词条_火焰豌豆",
        ["最高等级"] = 10,
        ["描述"] = "伤害增加",
        ["详细属性"] = "伤害 +[1.增伤]%",
        ["功能"] = {
            {
                ["影响魔法关键字"] = "火焰豌豆",
                ["即将击杀"] = false,
                ["要求元素类型"] = "无",
                ["增伤"] = 10,
                ["增加暴击率"] = 0,
                ["增加暴击伤害"] = 0,
                ["属性增伤倍率"] = 1,
                ["释放魔法继承威力"] = false,
                ["释放魔法威力增加"] = 0,
                ["类型"] = "DamageTagHandler",
                ["打印信息"] = false,
                ["m_trigger"] = "攻击时",
                ["优先级"] = 5,
                ["冷却"] = 0,
                ["每级增强"] = 1,
                ["几率"] = 0,
                ["升级增加数值"] = {
                    {
                        ["paramName"] = "增伤",
                        ["number"] = 1
                    }
                }
            }
        }
    }),
    ["射速1_词条_双头豌豆"] = TagType.New({
        ["名字"] = "射速1_词条_双头豌豆",
        ["最高等级"] = 10,
        ["描述"] = "射速增加",
        ["详细属性"] = "射速 +[1.修改数值.1]%",
        ["功能"] = {
            {
                ["影响魔法关键字"] = "双发豌豆",
                ["威力增加"] = 0,
                ["威力增加表达式"] = "",
                ["取消"] = false,
                ["修改数值"] = {
                    {
                        ["objectName"] = "伤害魔法",
                        ["paramName"] = "冷却加速",
                        ["paramValue"] = {
                            ["倍率"] = 5,
                            ["增加类型"] = "增加",
                            ["乘以基础数值"] = false
                        },
                        ["isAlways"] = false
                    }
                },
                ["修改数值倍率"] = 1,
                ["释放魔法继承威力"] = false,
                ["释放魔法威力增加"] = 0,
                ["类型"] = "SpellTagHandler",
                ["打印信息"] = false,
                ["m_trigger"] = "释放魔法时",
                ["优先级"] = 5,
                ["冷却"] = 0,
                ["每级增强"] = 1,
                ["几率"] = 0,
                ["升级增加数值"] = {
                    {
                        ["paramName"] = "修改数值倍率",
                        ["number"] = 1
                    }
                }
            }
        }
    }),
    ["攻击1_词条_双头豌豆"] = TagType.New({
        ["名字"] = "攻击1_词条_双头豌豆",
        ["最高等级"] = 10,
        ["描述"] = "伤害增加",
        ["详细属性"] = "伤害 +[1.增伤]%",
        ["功能"] = {
            {
                ["影响魔法关键字"] = "双发豌豆",
                ["即将击杀"] = false,
                ["要求元素类型"] = "无",
                ["增伤"] = 5,
                ["增加暴击率"] = 0,
                ["增加暴击伤害"] = 0,
                ["属性增伤倍率"] = 1,
                ["释放魔法继承威力"] = false,
                ["释放魔法威力增加"] = 0,
                ["类型"] = "DamageTagHandler",
                ["打印信息"] = false,
                ["m_trigger"] = "攻击时",
                ["优先级"] = 5,
                ["冷却"] = 0,
                ["每级增强"] = 1,
                ["几率"] = 0,
                ["升级增加数值"] = {
                    {
                        ["paramName"] = "增伤",
                        ["number"] = 1
                    }
                }
            }
        }
    }),
    ["射速1_词条_豌豆射手"] = TagType.New({
        ["名字"] = "射速1_词条_豌豆射手",
        ["最高等级"] = 10,
        ["描述"] = "射速增加",
        ["详细属性"] = "射速 +[1.修改数值.1]%",
        ["功能"] = {
            {
                ["影响魔法关键字"] = "豌豆射手",
                ["威力增加"] = 0,
                ["威力增加表达式"] = "",
                ["取消"] = false,
                ["修改数值"] = {
                    {
                        ["objectName"] = "伤害魔法",
                        ["paramName"] = "冷却加速",
                        ["paramValue"] = {
                            ["倍率"] = 2,
                            ["增加类型"] = "增加",
                            ["乘以基础数值"] = false
                        },
                        ["isAlways"] = false
                    }
                },
                ["修改数值倍率"] = 1,
                ["释放魔法继承威力"] = false,
                ["释放魔法威力增加"] = 0,
                ["类型"] = "SpellTagHandler",
                ["打印信息"] = false,
                ["m_trigger"] = "释放魔法时",
                ["优先级"] = 5,
                ["冷却"] = 0,
                ["每级增强"] = 1,
                ["几率"] = 0,
                ["升级增加数值"] = {
                    {
                        ["paramName"] = "修改数值倍率",
                        ["number"] = 1
                    }
                }
            }
        }
    }),
    ["攻击1_词条_豌豆射手"] = TagType.New({
        ["名字"] = "攻击1_词条_豌豆射手",
        ["最高等级"] = 10,
        ["描述"] = "伤害增加",
        ["详细属性"] = "伤害 +[1.属性增伤.1]",
        ["功能"] = {
            {
                ["影响魔法关键字"] = "豌豆射手",
                ["即将击杀"] = false,
                ["要求元素类型"] = "无",
                ["增伤"] = 20,
                ["增加暴击率"] = 0,
                ["增加暴击伤害"] = 0,
                ["属性增伤"] = {
                    {
                        ["倍率"] = 5,
                        ["增加类型"] = "增加",
                        ["乘以基础数值"] = false
                    }
                },
                ["属性增伤倍率"] = 1,
                ["释放魔法继承威力"] = false,
                ["释放魔法威力增加"] = 0,
                ["类型"] = "DamageTagHandler",
                ["打印信息"] = false,
                ["m_trigger"] = "攻击时",
                ["优先级"] = 5,
                ["冷却"] = 0,
                ["每级增强"] = 1,
                ["几率"] = 0,
                ["升级增加数值"] = {
                    {
                        ["paramName"] = "属性增伤倍率",
                        ["number"] = 1
                    }
                }
            }
        }
    }),
    ["生命1_词条_豌豆射手"] = TagType.New({
        ["名字"] = "生命1_词条_豌豆射手",
        ["最高等级"] = 10,
        ["描述"] = "生命增加",
        ["详细属性"] = "生命+[1.增加]",
        ["功能"] = {
            {
                ["属性"] = "生命",
                ["增加"] = 10,
                ["百分比"] = false,
                ["类型"] = "AttributeTagHandler",
                ["打印信息"] = false,
                ["m_trigger"] = "生命",
                ["优先级"] = 5,
                ["冷却"] = 0,
                ["每级增强"] = 1,
                ["几率"] = 0,
                ["升级增加数值"] = {
                    {
                        ["paramName"] = "增加",
                        ["number"] = 1
                    }
                }
            }
        }
    }),
    ["副-仙人掌-词条"] = TagType.New({
        ["名字"] = "副-仙人掌-词条",
        ["最高等级"] = 100,
        ["详细属性"] = "[1.属性乘以百分比]",
        ["功能"] = {
            {
                ["影响怪物"] = {
                    "副-召唤物-仙人掌"
                },
                ["影响关键字"] = "",
                ["属性乘以百分比"] = {
                    ["攻击"] = "5",
                    ["生命"] = "5"
                },
                ["额外属性倍率"] = 1,
                ["额外词条等级"] = 1,
                ["类型"] = "SummonTagHandler",
                ["打印信息"] = false,
                ["m_trigger"] = "召唤时",
                ["优先级"] = 5,
                ["冷却"] = 0,
                ["每级增强"] = 1,
                ["几率"] = 0,
                ["升级增加数值"] = {
                    {
                        ["paramName"] = "额外属性倍率",
                        ["number"] = 1
                    }
                }
            }
        }
    }),
    ["副-地刺-词条"] = TagType.New({
        ["名字"] = "副-地刺-词条",
        ["最高等级"] = 1,
        ["描述"] = "[90:1]",
        ["详细属性"] = "[90:1]",
        ["功能"] = {
            {
                ["影响关键字"] = "",
                ["额外属性倍率"] = 1,
                ["额外词条等级"] = 1,
                ["类型"] = "SummonTagHandler",
                ["打印信息"] = false,
                ["m_trigger"] = "召唤时",
                ["优先级"] = 5,
                ["冷却"] = 0,
                ["每级增强"] = 1,
                ["几率"] = 0
            }
        }
    }),
    ["副-坚果-词条"] = TagType.New({
        ["名字"] = "副-坚果-词条",
        ["最高等级"] = 100,
        ["详细属性"] = "[1.属性乘以百分比]",
        ["功能"] = {
            {
                ["影响怪物"] = {
                    "副-召唤物-坚果"
                },
                ["影响关键字"] = "",
                ["属性乘以百分比"] = {
                    ["生命"] = "3"
                },
                ["额外属性倍率"] = 1,
                ["额外词条等级"] = 1,
                ["类型"] = "SummonTagHandler",
                ["打印信息"] = false,
                ["m_trigger"] = "召唤时",
                ["优先级"] = 5,
                ["冷却"] = 0,
                ["每级增强"] = 1,
                ["几率"] = 0,
                ["升级增加数值"] = {
                    {
                        ["paramName"] = "额外属性倍率",
                        ["number"] = 1
                    }
                }
            }
        }
    }),
    ["副-星星果-词条"] = TagType.New({
        ["名字"] = "副-星星果-词条",
        ["最高等级"] = 100,
        ["详细属性"] = "[1.属性乘以百分比]",
        ["功能"] = {
            {
                ["影响怪物"] = {
                    "副-召唤物-星星果"
                },
                ["影响关键字"] = "",
                ["属性乘以百分比"] = {
                    ["生命"] = "8",
                    ["攻击"] = "8"
                },
                ["额外属性倍率"] = 1,
                ["额外词条等级"] = 1,
                ["类型"] = "SummonTagHandler",
                ["打印信息"] = false,
                ["m_trigger"] = "召唤时",
                ["优先级"] = 5,
                ["冷却"] = 0,
                ["每级增强"] = 1,
                ["几率"] = 0,
                ["升级增加数值"] = {
                    {
                        ["paramName"] = "额外属性倍率",
                        ["number"] = 1
                    }
                }
            }
        }
    }),
    ["副-椰子炮-词条"] = TagType.New({
        ["名字"] = "副-椰子炮-词条",
        ["最高等级"] = 100,
        ["详细属性"] = "[1.属性乘以百分比]",
        ["功能"] = {
            {
                ["影响怪物"] = {
                    "副-召唤物-椰子炮"
                },
                ["影响关键字"] = "",
                ["属性乘以百分比"] = {
                    ["生命"] = "3",
                    ["攻击"] = "3"
                },
                ["额外属性倍率"] = 1,
                ["额外词条等级"] = 1,
                ["类型"] = "SummonTagHandler",
                ["打印信息"] = false,
                ["m_trigger"] = "召唤时",
                ["优先级"] = 5,
                ["冷却"] = 0,
                ["每级增强"] = 1,
                ["几率"] = 0,
                ["升级增加数值"] = {
                    {
                        ["paramName"] = "额外属性倍率",
                        ["number"] = 1
                    }
                }
            }
        }
    }),
    ["副-樱桃炸弹-词条"] = TagType.New({
        ["名字"] = "副-樱桃炸弹-词条",
        ["最高等级"] = 100,
        ["描述"] = "[120:1]",
        ["详细属性"] = "[120:1]",
        ["功能"] = {
            {
                ["影响怪物"] = {
                    nil
                },
                ["影响关键字"] = "",
                ["额外属性倍率"] = 1,
                ["额外词条等级"] = 1,
                ["类型"] = "SummonTagHandler",
                ["打印信息"] = false,
                ["m_trigger"] = "召唤时",
                ["优先级"] = 5,
                ["冷却"] = 0,
                ["每级增强"] = 1,
                ["几率"] = 0
            }
        }
    }),
    ["副-火爆辣椒-词条"] = TagType.New({
        ["名字"] = "副-火爆辣椒-词条",
        ["最高等级"] = 100,
        ["描述"] = "[220:1.2]",
        ["详细属性"] = "[220:1.2]",
        ["功能"] = {
            {
                ["影响怪物"] = {
                    nil
                },
                ["影响关键字"] = "",
                ["额外属性倍率"] = 1,
                ["额外词条等级"] = 1,
                ["类型"] = "SummonTagHandler",
                ["打印信息"] = false,
                ["m_trigger"] = "召唤时",
                ["优先级"] = 5,
                ["冷却"] = 0,
                ["每级增强"] = 1,
                ["几率"] = 0
            }
        }
    }),
    ["副-窝瓜-词条"] = TagType.New({
        ["名字"] = "副-窝瓜-词条",
        ["最高等级"] = 1,
        ["详细属性"] = "[1.属性乘以比例]",
        ["功能"] = {
            {
                ["影响怪物"] = {
                    nil
                },
                ["影响关键字"] = "",
                ["额外属性倍率"] = 1,
                ["额外词条等级"] = 1,
                ["类型"] = "SummonTagHandler",
                ["打印信息"] = false,
                ["m_trigger"] = "召唤时",
                ["优先级"] = 5,
                ["冷却"] = 0,
                ["每级增强"] = 1,
                ["几率"] = 0
            }
        }
    }),
    ["副-菜问-词条"] = TagType.New({
        ["名字"] = "副-菜问-词条",
        ["最高等级"] = 100,
        ["详细属性"] = "[1.属性乘以百分比]",
        ["功能"] = {
            {
                ["影响怪物"] = {
                    "副-召唤物-菜问"
                },
                ["影响关键字"] = "",
                ["属性乘以百分比"] = {
                    ["生命"] = "8",
                    ["攻击"] = "8"
                },
                ["额外属性倍率"] = 1,
                ["额外词条等级"] = 1,
                ["类型"] = "SummonTagHandler",
                ["打印信息"] = false,
                ["m_trigger"] = "召唤时",
                ["优先级"] = 5,
                ["冷却"] = 0,
                ["每级增强"] = 1,
                ["几率"] = 0,
                ["升级增加数值"] = {
                    {
                        ["paramName"] = "额外属性倍率",
                        ["number"] = 1
                    }
                }
            }
        }
    }),
    ["副-豌豆射手-词条"] = TagType.New({
        ["名字"] = "副-豌豆射手-词条",
        ["最高等级"] = 1,
        ["详细属性"] = "[1.属性乘以比例]",
        ["功能"] = {
            {
                ["影响怪物"] = {
                    "副-召唤物-豌豆射手"
                },
                ["影响关键字"] = "",
                ["额外属性倍率"] = 1,
                ["额外词条等级"] = 1,
                ["类型"] = "SummonTagHandler",
                ["打印信息"] = false,
                ["m_trigger"] = "召唤时",
                ["优先级"] = 5,
                ["冷却"] = 0,
                ["每级增强"] = 1,
                ["几率"] = 0
            }
        }
    }),
    ["副-辣椒投手-词条"] = TagType.New({
        ["名字"] = "副-辣椒投手-词条",
        ["最高等级"] = 1,
        ["详细属性"] = "[1.属性乘以比例]",
        ["功能"] = {
            {
                ["影响怪物"] = {
                    "副-召唤物-辣椒投手"
                },
                ["影响关键字"] = "",
                ["额外属性倍率"] = 1,
                ["额外词条等级"] = 1,
                ["类型"] = "SummonTagHandler",
                ["打印信息"] = false,
                ["m_trigger"] = "召唤时",
                ["优先级"] = 5,
                ["冷却"] = 0,
                ["每级增强"] = 1,
                ["几率"] = 0
            }
        }
    }),
    ["副-钢铁地刺-词条"] = TagType.New({
        ["名字"] = "副-钢铁地刺-词条",
        ["最高等级"] = 1,
        ["详细属性"] = "[1.属性乘以比例]",
        ["功能"] = {
            {
                ["影响怪物"] = {
                    nil
                },
                ["影响关键字"] = "",
                ["额外属性倍率"] = 1,
                ["额外词条等级"] = 1,
                ["类型"] = "SummonTagHandler",
                ["打印信息"] = false,
                ["m_trigger"] = "召唤时",
                ["优先级"] = 5,
                ["冷却"] = 0,
                ["每级增强"] = 1,
                ["几率"] = 0
            }
        }
    }),
    ["副-魅惑菇-词条"] = TagType.New({
        ["名字"] = "副-魅惑菇-词条",
        ["最高等级"] = 1,
        ["详细属性"] = "[1.属性乘以比例]",
        ["功能"] = {
            {
                ["影响怪物"] = {
                    "副-召唤物-魅惑菇"
                },
                ["影响关键字"] = "",
                ["额外属性倍率"] = 1,
                ["额外词条等级"] = 1,
                ["类型"] = "SummonTagHandler",
                ["打印信息"] = false,
                ["m_trigger"] = "召唤时",
                ["优先级"] = 5,
                ["冷却"] = 0,
                ["每级增强"] = 1,
                ["几率"] = 0
            }
        }
    })
}loaded = true
end

---@param tagTypeName string
---@return TagType
function TagTypeConfig.Get(tagTypeName)
    if not loaded then
        LoadConfig()
    end
    return TagTypeConfig.config[tagTypeName]
end

---@return TagType[]
function TagTypeConfig.GetAll()
    if not loaded then
        LoadConfig()
    end
    return TagTypeConfig.config
end
return TagTypeConfig
