
local MainStorage = game:GetService('MainStorage')
local gg                = require(MainStorage.code.common.MGlobal)    ---@type gg
local Modifiers = require(MainStorage.code.common.config_type.modifier.Modifiers) ---@type Modifiers

--- 挂机点配置文件
---@class AfkSpotConfig
local AfkSpotConfig = {}
local loaded = false

local function LoadConfig()
    AfkSpotConfig.config ={
    ["中级挂机点"] = {
        ["名字"] = "中级挂机点",
        ["显示名"] = " ",
        ["场景"] = "g0",
        ["节点名"] = {
            "中级挂机点/挂机区域"
        },
        ["互动条件"] = Modifiers.New({
            {
                ["目标"] = "自己",
                ["条件类型"] = "VariableCondition",
                ["条件"] = {
                    ["名字"] = "level",
                    ["最小值"] = 0,
                    ["最大值"] = 100,
                    ["最小"] = "10",
                    ["最大"] = "9999999"
                },
                ["动作"] = "必须",
                ["拒绝时提示"] = "等级不足，需要达到10级\n提升卡片等级再来吧！"
            }
        }),
        ["模式"] = "无",
        ["定时指令"] = {
            [[cast {"复杂魔法":{"魔法":"挂机获得阳光","复写参数":[{"objectName":"挂机获得阳光","paramName":"基础数量","value":15}]}} ]]
        },
        ["间隔时间"] = 1,
        ["进入指令"] = {
            "afk {}"
        },
        ["离开指令"] = {
            [[afk {"操作":"离开挂机"} ]]
        },
        ["额外互动距离"] = {
            280,
            280,
            280
        },
        ["成长速度"] = 0
    },
    ["初级挂机点"] = {
        ["名字"] = "初级挂机点",
        ["显示名"] = " ",
        ["场景"] = "g0",
        ["节点名"] = {
            "初级挂机点/挂机区域"
        },
        ["模式"] = "无",
        ["定时指令"] = {
            [[cast {"复杂魔法":{"魔法":"挂机获得阳光","复写参数":[{"objectName":"挂机获得阳光","paramName":"基础数量","value":10}]}} ]]
        },
        ["间隔时间"] = 1,
        ["进入指令"] = {
            "afk {}",
            [[cast {"魔法名":"提示退出按钮","复杂魔法":{}} ]]
        },
        ["离开指令"] = {
            [[afk {"操作":"离开挂机"} ]]
        },
        ["额外互动距离"] = {
            280,
            280,
            280
        },
        ["成长速度"] = 0
    },
    ["超级挂机点"] = {
        ["名字"] = "超级挂机点",
        ["显示名"] = " ",
        ["场景"] = "g0",
        ["节点名"] = {
            "超级挂机点/挂机区域"
        },
        ["互动条件"] = Modifiers.New({
            {
                ["目标"] = "自己",
                ["条件类型"] = "VariableCondition",
                ["条件"] = {
                    ["名字"] = "level",
                    ["最小值"] = 0,
                    ["最大值"] = 100,
                    ["最小"] = "120",
                    ["最大"] = "9999999"
                },
                ["动作"] = "必须",
                ["拒绝时提示"] = "等级不足，需要达到120级\n提升卡片等级再来吧！"
            }
        }),
        ["模式"] = "无",
        ["定时指令"] = {
            [[cast {"复杂魔法":{"魔法":"挂机获得阳光","复写参数":[{"objectName":"挂机获得阳光","paramName":"基础数量","value":25}]}} ]]
        },
        ["间隔时间"] = 1,
        ["进入指令"] = {
            "afk {}"
        },
        ["离开指令"] = {
            [[afk {"操作":"离开挂机"} ]]
        },
        ["额外互动距离"] = {
            280,
            280,
            280
        },
        ["成长速度"] = 0
    },
    ["超级挂机点3"] = {
        ["名字"] = "超级挂机点3",
        ["显示名"] = " ",
        ["场景"] = "g0",
        ["节点名"] = {
            "超级挂机点3/挂机区域"
        },
        ["互动条件"] = Modifiers.New({
            {
                ["目标"] = "自己",
                ["条件类型"] = "VariableCondition",
                ["条件"] = {
                    ["名字"] = "level",
                    ["最小值"] = 0,
                    ["最大值"] = 100,
                    ["最小"] = "120",
                    ["最大"] = "9999999"
                },
                ["动作"] = "必须",
                ["拒绝时提示"] = "等级不足，需要达到120级\n提升卡片等级再来吧！"
            }
        }),
        ["模式"] = "无",
        ["定时指令"] = {
            [[cast {"复杂魔法":{"魔法":"挂机获得阳光","复写参数":[{"objectName":"挂机获得阳光","paramName":"基础数量","value":25}]}} ]]
        },
        ["间隔时间"] = 1,
        ["进入指令"] = {
            "afk {}"
        },
        ["离开指令"] = {
            [[afk {"操作":"离开挂机"} ]]
        },
        ["额外互动距离"] = {
            280,
            280,
            280
        },
        ["成长速度"] = 0
    },
    ["超级挂机点4"] = {
        ["名字"] = "超级挂机点4",
        ["显示名"] = " ",
        ["场景"] = "g0",
        ["节点名"] = {
            "超级挂机点4/挂机区域"
        },
        ["互动条件"] = Modifiers.New({
            {
                ["目标"] = "自己",
                ["条件类型"] = "VariableCondition",
                ["条件"] = {
                    ["名字"] = "level",
                    ["最小值"] = 0,
                    ["最大值"] = 100,
                    ["最小"] = "120",
                    ["最大"] = "9999999"
                },
                ["动作"] = "必须",
                ["拒绝时提示"] = "等级不足，需要达到120级\n提升卡片等级再来吧！"
            }
        }),
        ["模式"] = "无",
        ["定时指令"] = {
            [[cast {"复杂魔法":{"魔法":"挂机获得阳光","复写参数":[{"objectName":"挂机获得阳光","paramName":"基础数量","value":25}]}} ]]
        },
        ["间隔时间"] = 1,
        ["进入指令"] = {
            "afk {}"
        },
        ["离开指令"] = {
            [[afk {"操作":"离开挂机"} ]]
        },
        ["额外互动距离"] = {
            280,
            280,
            280
        },
        ["成长速度"] = 0
    },
    ["高级挂机点"] = {
        ["名字"] = "高级挂机点",
        ["显示名"] = " ",
        ["场景"] = "g0",
        ["节点名"] = {
            "高级挂机点/挂机区域"
        },
        ["互动条件"] = Modifiers.New({
            {
                ["目标"] = "自己",
                ["条件类型"] = "VariableCondition",
                ["条件"] = {
                    ["名字"] = "level",
                    ["最小值"] = 0,
                    ["最大值"] = 100,
                    ["最小"] = "35",
                    ["最大"] = "9999999"
                },
                ["动作"] = "必须",
                ["拒绝时提示"] = "等级不足，需要达到35级\n提升卡片等级再来吧！"
            }
        }),
        ["模式"] = "无",
        ["定时指令"] = {
            [[cast {"复杂魔法":{"魔法":"挂机获得阳光","复写参数":[{"objectName":"挂机获得阳光","paramName":"基础数量","value":20}]}} ]]
        },
        ["间隔时间"] = 1,
        ["进入指令"] = {
            "afk {}"
        },
        ["离开指令"] = {
            [[afk {"操作":"离开挂机"} ]]
        },
        ["额外互动距离"] = {
            280,
            280,
            280
        },
        ["成长速度"] = 0
    },
    ["主城1花园"] = {
        ["名字"] = "主城1花园",
        ["场景"] = "g0",
        ["节点名"] = {
            "副卡挂机区域/副卡挂机",
            "副卡挂机区域/副卡挂机_copy_2",
            "副卡挂机区域/副卡挂机_copy_3",
            "副卡挂机区域/副卡挂机_copy_4",
            "副卡挂机区域/副卡挂机_copy_5",
            "副卡挂机区域/副卡挂机_copy_6",
            "副卡挂机区域/副卡挂机_copy_7",
            "副卡挂机区域/副卡挂机_copy_8",
            "副卡挂机区域/副卡挂机_copy_9",
            "副卡挂机区域/副卡挂机_copy_10",
            "副卡挂机区域/副卡挂机_copy_11",
            "副卡挂机区域/副卡挂机_copy_12",
            "副卡挂机区域/副卡挂机_copy_13",
            "副卡挂机区域/副卡挂机_copy_14",
            "副卡挂机区域/副卡挂机_copy_15",
            "副卡挂机区域/副卡挂机_copy_16",
            "副卡挂机区域/副卡挂机_copy_17",
            "副卡挂机区域/副卡挂机_copy_18",
            "副卡挂机区域/副卡挂机_copy_19",
            "副卡挂机区域/副卡挂机_copy"
        },
        ["模式"] = "副卡",
        ["间隔时间"] = 1,
        ["进入指令"] = {
            [[quest {"动作":"事件","事件名":"副卡种植"} ]]
        },
        ["额外互动距离"] = {
            0,
            0,
            0
        },
        ["成长速度"] = 10
    },
    ["主城1花园2"] = {
        ["名字"] = "主城1花园2",
        ["场景"] = "g0",
        ["节点名"] = {
            "副卡挂机区域2/副卡挂机",
            "副卡挂机区域2/副卡挂机_copy_2",
            "副卡挂机区域2/副卡挂机_copy_3",
            "副卡挂机区域2/副卡挂机_copy_4",
            "副卡挂机区域2/副卡挂机_copy_5",
            "副卡挂机区域2/副卡挂机_copy_6",
            "副卡挂机区域2/副卡挂机_copy_7",
            "副卡挂机区域2/副卡挂机_copy_8",
            "副卡挂机区域2/副卡挂机_copy_9",
            "副卡挂机区域2/副卡挂机_copy_10",
            "副卡挂机区域2/副卡挂机_copy_11",
            "副卡挂机区域2/副卡挂机_copy_12",
            "副卡挂机区域2/副卡挂机_copy_13",
            "副卡挂机区域2/副卡挂机_copy_14",
            "副卡挂机区域2/副卡挂机_copy_15",
            "副卡挂机区域2/副卡挂机_copy_16",
            "副卡挂机区域2/副卡挂机_copy_17",
            "副卡挂机区域2/副卡挂机_copy_18",
            "副卡挂机区域2/副卡挂机_copy_19",
            "副卡挂机区域2/副卡挂机_copy"
        },
        ["模式"] = "副卡",
        ["间隔时间"] = 1,
        ["进入指令"] = {
            [[quest {"动作":"事件","事件名":"副卡种植"} ]]
        },
        ["额外互动距离"] = {
            0,
            0,
            0
        },
        ["成长速度"] = 15
    },
    ["主城1花园3"] = {
        ["名字"] = "主城1花园3",
        ["场景"] = "g0",
        ["节点名"] = {
            "副卡挂机区域3/副卡挂机",
            "副卡挂机区域3/副卡挂机_copy_2",
            "副卡挂机区域3/副卡挂机_copy_3",
            "副卡挂机区域3/副卡挂机_copy_4",
            "副卡挂机区域3/副卡挂机_copy_5",
            "副卡挂机区域3/副卡挂机_copy_6",
            "副卡挂机区域3/副卡挂机_copy_7",
            "副卡挂机区域3/副卡挂机_copy_8",
            "副卡挂机区域3/副卡挂机_copy_9",
            "副卡挂机区域3/副卡挂机_copy_10",
            "副卡挂机区域3/副卡挂机_copy_11",
            "副卡挂机区域3/副卡挂机_copy_12",
            "副卡挂机区域3/副卡挂机_copy_13",
            "副卡挂机区域3/副卡挂机_copy_14",
            "副卡挂机区域3/副卡挂机_copy_15",
            "副卡挂机区域3/副卡挂机_copy_16",
            "副卡挂机区域3/副卡挂机_copy_17",
            "副卡挂机区域3/副卡挂机_copy_18",
            "副卡挂机区域3/副卡挂机_copy_19",
            "副卡挂机区域3/副卡挂机_copy"
        },
        ["模式"] = "副卡",
        ["间隔时间"] = 1,
        ["进入指令"] = {
            [[quest {"动作":"事件","事件名":"副卡种植"} ]]
        },
        ["额外互动距离"] = {
            0,
            0,
            0
        },
        ["成长速度"] = 25
    },
    ["主城1花园4"] = {
        ["名字"] = "主城1花园4",
        ["场景"] = "g0",
        ["节点名"] = {
            "副卡挂机区域4/副卡挂机",
            "副卡挂机区域4/副卡挂机_copy_2",
            "副卡挂机区域4/副卡挂机_copy_3",
            "副卡挂机区域4/副卡挂机_copy_4",
            "副卡挂机区域4/副卡挂机_copy_5",
            "副卡挂机区域4/副卡挂机_copy_6",
            "副卡挂机区域4/副卡挂机_copy_7",
            "副卡挂机区域4/副卡挂机_copy_8",
            "副卡挂机区域4/副卡挂机_copy_9",
            "副卡挂机区域4/副卡挂机_copy_10",
            "副卡挂机区域4/副卡挂机_copy_11",
            "副卡挂机区域4/副卡挂机_copy_12",
            "副卡挂机区域4/副卡挂机_copy_13",
            "副卡挂机区域4/副卡挂机_copy_14",
            "副卡挂机区域4/副卡挂机_copy_15",
            "副卡挂机区域4/副卡挂机_copy_16",
            "副卡挂机区域4/副卡挂机_copy_17",
            "副卡挂机区域4/副卡挂机_copy_18",
            "副卡挂机区域4/副卡挂机_copy_19",
            "副卡挂机区域4/副卡挂机_copy"
        },
        ["模式"] = "副卡",
        ["间隔时间"] = 1,
        ["进入指令"] = {
            [[quest {"动作":"事件","事件名":"副卡种植"} ]]
        },
        ["额外互动距离"] = {
            0,
            0,
            0
        },
        ["成长速度"] = 50
    },
    ["主城1花圃"] = {
        ["名字"] = "主城1花圃",
        ["场景"] = "g0",
        ["节点名"] = {
            "副卡挂机区域/副卡挂机_copy_20",
            "副卡挂机区域/副卡挂机_copy_21",
            "副卡挂机区域/副卡挂机_copy_22"
        },
        ["互动条件"] = Modifiers.New({
            {
                ["目标"] = "自己",
                ["条件类型"] = "VariableCondition",
                ["条件"] = {
                    ["名字"] = "解锁花圃挂机",
                    ["最小值"] = 0,
                    ["最大值"] = 100,
                    ["最小"] = "1",
                    ["最大"] = "100"
                },
                ["动作"] = "必须",
                ["拒绝时提示"] = "高级花圃，特权卡用户专享……"
            }
        }),
        ["模式"] = "副卡",
        ["间隔时间"] = 1,
        ["进入指令"] = {
            [[quest {"动作":"事件","事件名":"副卡种植"} ]]
        },
        ["额外互动距离"] = {
            0,
            0,
            0
        },
        ["成长速度"] = 30
    },
    ["主城1花圃2"] = {
        ["名字"] = "主城1花圃2",
        ["场景"] = "g0",
        ["节点名"] = {
            "副卡挂机区域2/副卡挂机_copy_20",
            "副卡挂机区域2/副卡挂机_copy_21",
            "副卡挂机区域2/副卡挂机_copy_22"
        },
        ["互动条件"] = Modifiers.New({
            {
                ["目标"] = "自己",
                ["条件类型"] = "VariableCondition",
                ["条件"] = {
                    ["名字"] = "解锁花圃挂机",
                    ["最小值"] = 0,
                    ["最大值"] = 100,
                    ["最小"] = "1",
                    ["最大"] = "100"
                },
                ["动作"] = "必须",
                ["拒绝时提示"] = "高级花圃，特权卡用户专享……"
            }
        }),
        ["模式"] = "副卡",
        ["间隔时间"] = 1,
        ["进入指令"] = {
            [[quest {"动作":"事件","事件名":"副卡种植"} ]]
        },
        ["额外互动距离"] = {
            0,
            0,
            0
        },
        ["成长速度"] = 40
    },
    ["主城1花圃3"] = {
        ["名字"] = "主城1花圃3",
        ["场景"] = "g0",
        ["节点名"] = {
            "副卡挂机区域3/副卡挂机_copy_20",
            "副卡挂机区域3/副卡挂机_copy_21",
            "副卡挂机区域3/副卡挂机_copy_22"
        },
        ["互动条件"] = Modifiers.New({
            {
                ["目标"] = "自己",
                ["条件类型"] = "VariableCondition",
                ["条件"] = {
                    ["名字"] = "解锁花圃挂机",
                    ["最小值"] = 0,
                    ["最大值"] = 100,
                    ["最小"] = "1",
                    ["最大"] = "100"
                },
                ["动作"] = "必须",
                ["拒绝时提示"] = "高级花圃，特权卡用户专享……"
            }
        }),
        ["模式"] = "副卡",
        ["间隔时间"] = 1,
        ["进入指令"] = {
            [[quest {"动作":"事件","事件名":"副卡种植"} ]]
        },
        ["额外互动距离"] = {
            0,
            0,
            0
        },
        ["成长速度"] = 60
    },
    ["主城1花圃4"] = {
        ["名字"] = "主城1花圃4",
        ["场景"] = "g0",
        ["节点名"] = {
            "副卡挂机区域4/副卡挂机_copy_20",
            "副卡挂机区域4/副卡挂机_copy_21",
            "副卡挂机区域4/副卡挂机_copy_22"
        },
        ["互动条件"] = Modifiers.New({
            {
                ["目标"] = "自己",
                ["条件类型"] = "VariableCondition",
                ["条件"] = {
                    ["名字"] = "解锁花圃挂机",
                    ["最小值"] = 0,
                    ["最大值"] = 100,
                    ["最小"] = "1",
                    ["最大"] = "100"
                },
                ["动作"] = "必须",
                ["拒绝时提示"] = "高级花圃，特权卡用户专享……"
            }
        }),
        ["模式"] = "副卡",
        ["间隔时间"] = 1,
        ["进入指令"] = {
            [[quest {"动作":"事件","事件名":"副卡种植"} ]]
        },
        ["额外互动距离"] = {
            0,
            0,
            0
        },
        ["成长速度"] = 100
    }
}loaded = true
end

function AfkSpotConfig.Get(AfkSpotName)
    if not loaded then
        LoadConfig()
    end
    return AfkSpotConfig.config[AfkSpotName]
end

function AfkSpotConfig.GetAll()
    if not loaded then
        LoadConfig()
    end
    return AfkSpotConfig.config
end
return AfkSpotConfig