local MainStorage = game:GetService('MainStorage')
local gg                = require(MainStorage.code.common.MGlobal)    ---@type gg
local Modifiers = require(MainStorage.code.common.config_type.modifier.Modifiers) ---@type Modifiers
    
---@class LevelConfig
local LevelConfig = {}
local loaded = false

local function LoadConfig()
    local LevelType = require(MainStorage.code.common.config_type.LevelType) ---@type LevelType
    LevelConfig.config ={
    ["新手关"] = LevelType.New({
        ["关卡ID"] = "新手关",
        ["前置关卡"] = nil,
        ["关卡波次"] = {
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = "呆滞僵尸",
                                ["比重"] = 50
                            }
                        },
                        ["持续时间"] = 1,
                        ["数量"] = 1,
                        ["最大数量"] = 1,
                        ["开始时间"] = 0
                    }
                },
                ["属性倍率"] = 1,
                ["开始时执行指令"] = {
                    [[focusOn {"聚焦UI":{"聚焦UI":[{"UI名":"BattleHud","控件路径":"UIImage","提示文本":"不好！僵尸入侵了你的房子","可点击任意位置":true},{"UI名":"BattleHud","控件路径":"开火","提示文本":"点击这里，向僵尸开炮！","可点击任意位置":true,"若是PC端则改为":{"UI名":"BattleHud","控件路径":"UIImage","提示文本":"点击鼠标左键，向僵尸开炮！","可点击任意位置":true}}],"完成时执行指令":[]}} ]]
                },
                ["怪物等级"] = {
                    0,
                    0
                },
                ["转波次文字"] = "",
                ["转波次音效"] = ""
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = "呆滞僵尸",
                                ["比重"] = 50
                            }
                        },
                        ["持续时间"] = 1,
                        ["数量"] = 3,
                        ["最大数量"] = 3,
                        ["开始时间"] = 0
                    }
                },
                ["属性倍率"] = 1,
                ["开始时执行指令"] = {
                    [[focusOn {"聚焦UI":{"聚焦UI":[{"UI名":"BattleHud","控件路径":"开火","提示文本":"按住拖动，可以扫射开火！","可点击任意位置":false,"若是PC端则改为":{"UI名":"BattleHud","控件路径":"UIImage","提示文本":"移动鼠标，可以瞄准僵尸","可点击任意位置":true}}],"完成时执行指令":[]}} ]]
                },
                ["怪物等级"] = {
                    0,
                    0
                },
                ["转波次文字"] = "",
                ["转波次音效"] = ""
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = "呆滞僵尸",
                                ["比重"] = 50
                            }
                        },
                        ["持续时间"] = 1,
                        ["数量"] = 6,
                        ["最大数量"] = 6,
                        ["开始时间"] = 0
                    }
                },
                ["属性倍率"] = 1,
                ["开始时执行指令"] = {
                    [[focusOn {"聚焦UI":{"聚焦UI":[{"UI名":"HudCards","控件路径":"副卡列表/卡片_1","提示文本":"丢出樱桃炸弹\\n炸飞一大波僵尸！","可点击任意位置":true,"若是PC端则改为":{"UI名":"HudCards","控件路径":"副卡列表/卡片_1","提示文本":"按下数字[1】键\\n丢出樱桃炸弹\\n炸飞一大波僵尸！","可点击任意位置":true}}],"完成时执行指令":[]}} ]]
                },
                ["怪物等级"] = {
                    0,
                    0
                },
                ["转波次文字"] = "",
                ["转波次音效"] = ""
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = "僵尸",
                                ["比重"] = 50
                            }
                        },
                        ["持续时间"] = 30,
                        ["数量"] = 100,
                        ["最大数量"] = 100,
                        ["开始时间"] = 0
                    }
                },
                ["属性倍率"] = 1,
                ["开始时执行指令"] = {
                    [[focusOn {"聚焦UI":{"聚焦UI":[{"UI名":"BattleHud","控件路径":"UIImage","提示文本":"很好！现在击败剩下的僵尸吧","可点击任意位置":true}],"完成时执行指令":[]}} ]]
                },
                ["怪物等级"] = {
                    0,
                    0
                },
                ["转波次文字"] = "",
                ["转波次音效"] = ""
            }
        },
        ["场景"] = "新手关",
        ["开始玩家"] = 1,
        ["增加额外玩家时间"] = 1,
        ["最大玩家数"] = 1,
        ["每个玩家增加数量倍率"] = 0,
        ["完成指令"] = nil,
        ["临时装备技能"] = {
            {
                ["技能类型"] = "火焰豌豆",
                ["等级"] = 1,
                ["装备槽位"] = 1
            },
            {
                ["技能类型"] = "副-樱桃炸弹",
                ["等级"] = 1,
                ["装备槽位"] = 2
            },
            {
                ["技能类型"] = "副-星星果",
                ["等级"] = 1,
                ["装备槽位"] = 3
            },
            {
                ["技能类型"] = "副-椰子炮",
                ["等级"] = 1,
                ["装备槽位"] = 4
            }
        },
        ["关闭结算界面"] = true
    }),
    ["1-1（新手点我）"] = LevelType.New({
        ["关卡ID"] = "1-1（新手点我）",
        ["描述"] = "新玩家可进入",
        ["前置关卡"] = nil,
        ["关卡波次"] = {
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = "僵尸",
                                ["比重"] = 50
                            }
                        },
                        ["持续时间"] = 30,
                        ["数量"] = 10,
                        ["最大数量"] = 20,
                        ["开始时间"] = 0
                    }
                },
                ["属性倍率"] = 1,
                ["怪物等级"] = {
                    1,
                    7
                },
                ["掉落物"] = {
                    {
                        ["物品"] = "阳光",
                        ["数量"] = "60",
                        ["几率"] = 30
                    }
                },
                ["转波次文字"] = "AssetId://391536769349332993",
                ["转波次音效"] = "sandboxId://soundeffect/awooga_僵尸来袭.ogg"
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = "僵尸",
                                ["比重"] = 50
                            }
                        },
                        ["持续时间"] = 40,
                        ["数量"] = 20,
                        ["最大数量"] = 40,
                        ["开始时间"] = 0
                    }
                },
                ["属性倍率"] = 1,
                ["怪物等级"] = {
                    7,
                    15
                },
                ["掉落物"] = {
                    {
                        ["物品"] = "阳光",
                        ["数量"] = "60",
                        ["几率"] = 50
                    },
                    {
                        ["物品"] = "金币",
                        ["数量"] = "2",
                        ["几率"] = 30
                    }
                },
                ["转波次文字"] = "AssetId://391536769349332993",
                ["转波次音效"] = "sandboxId://soundeffect/finalwave_终波.ogg"
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = "士兵僵尸",
                                ["比重"] = 80
                            }
                        },
                        ["持续时间"] = 30,
                        ["数量"] = 5,
                        ["最大数量"] = 10,
                        ["开始时间"] = 0
                    }
                },
                ["属性倍率"] = 1,
                ["怪物等级"] = {
                    15,
                    30
                },
                ["掉落物"] = {
                    {
                        ["物品"] = "阳光",
                        ["数量"] = "70",
                        ["几率"] = 50
                    },
                    {
                        ["物品"] = "金币",
                        ["数量"] = "3",
                        ["几率"] = 30
                    }
                },
                ["转波次文字"] = "AssetId://391536769349332993",
                ["转波次音效"] = "sandboxId://soundeffect/finalwave_终波.ogg"
            }
        },
        ["场景"] = "副本1",
        ["开始玩家"] = 1,
        ["增加额外玩家时间"] = 1,
        ["最大玩家数"] = 6,
        ["每个玩家增加数量倍率"] = 0,
        ["掉落物数量修改"] = {
            {
                ["目标"] = "自己",
                ["条件类型"] = "VariableCondition",
                ["条件"] = {
                    ["名字"] = "online_time",
                    ["最小值"] = 14400,
                    ["最大值"] = 86400
                },
                ["动作"] = "威力乘以",
                ["数量"] = "0.5"
            },
            {
                ["目标"] = "自己",
                ["条件类型"] = "VariableCondition",
                ["条件"] = {
                    ["名字"] = "online_time",
                    ["最小值"] = 43200,
                    ["最大值"] = 86400
                },
                ["动作"] = "威力乘以",
                ["数量"] = "0.5"
            },
            {
                ["目标"] = "自己",
                ["条件类型"] = "VariableCondition",
                ["条件"] = {
                    ["名字"] = "online_time",
                    ["最小值"] = 64800,
                    ["最大值"] = 86400
                },
                ["动作"] = "威力乘以",
                ["数量"] = "0.5"
            },
            {
                ["目标"] = "自己",
                ["条件类型"] = "VariableCondition",
                ["条件"] = {
                    ["名字"] = "online_time",
                    ["最小值"] = 28800,
                    ["最大值"] = 86400
                },
                ["动作"] = "威力乘以",
                ["数量"] = "0.5"
            },
            {
                ["目标"] = "自己",
                ["条件类型"] = "VariableCondition",
                ["条件"] = {
                    ["名字"] = "online_time",
                    ["最小值"] = 57600,
                    ["最大值"] = 86400
                },
                ["动作"] = "威力乘以",
                ["数量"] = "0.5"
            }
        },
        ["排名掉落物"] = {
            {
                ["名次"] = {
                    1,
                    1
                },
                ["物品"] = {
                    ["阳光"] = 900,
                    ["金币"] = 5
                }
            },
            {
                ["名次"] = {
                    2,
                    2
                },
                ["物品"] = {
                    ["阳光"] = 750,
                    ["金币"] = 4
                }
            },
            {
                ["名次"] = {
                    3,
                    3
                },
                ["物品"] = {
                    ["阳光"] = 600,
                    ["金币"] = 3
                }
            },
            {
                ["名次"] = {
                    4,
                    5
                },
                ["物品"] = {
                    ["阳光"] = 450
                }
            },
            {
                ["名次"] = {
                    6,
                    8
                },
                ["物品"] = {
                    ["阳光"] = 300
                }
            },
            {
                ["名次"] = {
                    9,
                    9
                },
                ["物品"] = {
                    ["阳光"] = 150
                }
            },
            {
                ["名次"] = {
                    9,
                    9
                },
                ["物品"] = {
                    ["阳光"] = 100
                }
            }
        },
        ["关闭结算界面"] = false,
        ["胜利音效"] = "sandboxId://soundeffect/winmusic胜利音效.ogg",
        ["失败音效"] = "sandboxId://soundeffect/brain_eaten.ogg"
    }),
    ["1-2（100级+）"] = LevelType.New({
        ["关卡ID"] = "1-2（100级+）",
        ["描述"] = "需求等级: [level]/500级",
        ["前置关卡"] = nil,
        ["关卡波次"] = {
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = "僵尸",
                                ["比重"] = 50
                            }
                        },
                        ["持续时间"] = 20,
                        ["数量"] = 5,
                        ["最大数量"] = 10,
                        ["开始时间"] = 0
                    }
                },
                ["属性倍率"] = 1,
                ["怪物等级"] = {
                    60,
                    70
                },
                ["掉落物"] = {
                    {
                        ["物品"] = "阳光",
                        ["数量"] = "80",
                        ["几率"] = 50
                    },
                    {
                        ["物品"] = "金币",
                        ["数量"] = "2",
                        ["几率"] = 40
                    }
                },
                ["转波次文字"] = "",
                ["转波次音效"] = ""
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = "僵尸",
                                ["比重"] = 50
                            },
                            {
                                ["怪物类型"] = "士兵僵尸",
                                ["比重"] = 10
                            }
                        },
                        ["持续时间"] = 20,
                        ["数量"] = 5,
                        ["最大数量"] = 12,
                        ["开始时间"] = 0
                    }
                },
                ["属性倍率"] = 1,
                ["怪物等级"] = {
                    70,
                    120
                },
                ["掉落物"] = {
                    {
                        ["物品"] = "阳光",
                        ["数量"] = "80",
                        ["几率"] = 60
                    },
                    {
                        ["物品"] = "金币",
                        ["数量"] = "2",
                        ["几率"] = 40
                    }
                },
                ["转波次文字"] = "",
                ["转波次音效"] = ""
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = "士兵僵尸",
                                ["比重"] = 100
                            }
                        },
                        ["持续时间"] = 20,
                        ["数量"] = 10,
                        ["最大数量"] = 15,
                        ["开始时间"] = 0
                    }
                },
                ["属性倍率"] = 1,
                ["怪物等级"] = {
                    130,
                    200
                },
                ["掉落物"] = {
                    {
                        ["物品"] = "阳光",
                        ["数量"] = "90",
                        ["几率"] = 50
                    },
                    {
                        ["物品"] = "金币",
                        ["数量"] = "2",
                        ["几率"] = 40
                    }
                },
                ["转波次文字"] = "",
                ["转波次音效"] = ""
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = "僵尸",
                                ["比重"] = 100
                            },
                            {
                                ["怪物类型"] = "寒冰僵尸",
                                ["比重"] = 20
                            }
                        },
                        ["持续时间"] = 20,
                        ["数量"] = 10,
                        ["最大数量"] = 15,
                        ["开始时间"] = 0
                    }
                },
                ["属性倍率"] = 1,
                ["怪物等级"] = {
                    210,
                    300
                },
                ["掉落物"] = {
                    {
                        ["物品"] = "阳光",
                        ["数量"] = "90",
                        ["几率"] = 50
                    },
                    {
                        ["物品"] = "金币",
                        ["数量"] = "2",
                        ["几率"] = 40
                    }
                },
                ["转波次文字"] = "",
                ["转波次音效"] = ""
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = "士兵僵尸",
                                ["比重"] = 100
                            },
                            {
                                ["怪物类型"] = "寒冰僵尸",
                                ["比重"] = 20
                            }
                        },
                        ["持续时间"] = 20,
                        ["数量"] = 10,
                        ["最大数量"] = 15,
                        ["开始时间"] = 0
                    }
                },
                ["属性倍率"] = 1,
                ["怪物等级"] = {
                    350,
                    500
                },
                ["掉落物"] = {
                    {
                        ["物品"] = "阳光",
                        ["数量"] = "90",
                        ["几率"] = 50
                    },
                    {
                        ["物品"] = "金币",
                        ["数量"] = "2",
                        ["几率"] = 40
                    }
                },
                ["转波次文字"] = "",
                ["转波次音效"] = ""
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = "僵尸",
                                ["比重"] = 100
                            },
                            {
                                ["怪物类型"] = "摇滚僵尸",
                                ["比重"] = 40
                            }
                        },
                        ["持续时间"] = 20,
                        ["数量"] = 12,
                        ["最大数量"] = 17,
                        ["开始时间"] = 0
                    }
                },
                ["属性倍率"] = 1,
                ["怪物等级"] = {
                    500,
                    700
                },
                ["掉落物"] = {
                    {
                        ["物品"] = "阳光",
                        ["数量"] = "90",
                        ["几率"] = 50
                    },
                    {
                        ["物品"] = "金币",
                        ["数量"] = "2",
                        ["几率"] = 40
                    }
                },
                ["转波次文字"] = "",
                ["转波次音效"] = ""
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = "寒冰僵尸",
                                ["比重"] = 100
                            },
                            {
                                ["怪物类型"] = "士兵僵尸",
                                ["比重"] = 100
                            }
                        },
                        ["持续时间"] = 20,
                        ["数量"] = 12,
                        ["最大数量"] = 17,
                        ["开始时间"] = 0
                    }
                },
                ["属性倍率"] = 1,
                ["怪物等级"] = {
                    700,
                    1000
                },
                ["掉落物"] = {
                    {
                        ["物品"] = "阳光",
                        ["数量"] = "100",
                        ["几率"] = 50
                    },
                    {
                        ["物品"] = "金币",
                        ["数量"] = "8",
                        ["几率"] = 40
                    }
                },
                ["转波次文字"] = "",
                ["转波次音效"] = ""
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = "士兵僵尸",
                                ["比重"] = 100
                            },
                            {
                                ["怪物类型"] = "摇滚僵尸",
                                ["比重"] = 100
                            },
                            {
                                ["怪物类型"] = "僵尸",
                                ["比重"] = 100
                            }
                        },
                        ["持续时间"] = 20,
                        ["数量"] = 10,
                        ["最大数量"] = 20,
                        ["开始时间"] = 0
                    }
                },
                ["属性倍率"] = 1,
                ["怪物等级"] = {
                    1000,
                    1300
                },
                ["掉落物"] = {
                    {
                        ["物品"] = "阳光",
                        ["数量"] = "100",
                        ["几率"] = 50
                    },
                    {
                        ["物品"] = "金币",
                        ["数量"] = "2",
                        ["几率"] = 40
                    }
                },
                ["转波次文字"] = "",
                ["转波次音效"] = ""
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = "寒冰僵尸",
                                ["比重"] = 100
                            },
                            {
                                ["怪物类型"] = "士兵僵尸",
                                ["比重"] = 100
                            },
                            {
                                ["怪物类型"] = "摇滚僵尸",
                                ["比重"] = 100
                            }
                        },
                        ["持续时间"] = 20,
                        ["数量"] = 15,
                        ["最大数量"] = 20,
                        ["开始时间"] = 0
                    }
                },
                ["属性倍率"] = 1,
                ["怪物等级"] = {
                    1300,
                    1500
                },
                ["掉落物"] = {
                    {
                        ["物品"] = "阳光",
                        ["数量"] = "100",
                        ["几率"] = 50
                    },
                    {
                        ["物品"] = "金币",
                        ["数量"] = "5",
                        ["几率"] = 40
                    }
                },
                ["转波次文字"] = "",
                ["转波次音效"] = ""
            }
        },
        ["场景"] = "副本2",
        ["开始玩家"] = 1,
        ["增加额外玩家时间"] = 5,
        ["最大玩家数"] = 6,
        ["每个玩家增加数量倍率"] = 0,
        ["进入条件"] = Modifiers.New({
            {
                ["目标"] = "自己",
                ["条件类型"] = "VariableCondition",
                ["条件"] = {
                    ["名字"] = "level",
                    ["最小值"] = 500,
                    ["最大值"] = 1000000
                },
                ["动作"] = "必须"
            }
        }),
        ["掉落物数量修改"] = {
            {
                ["目标"] = "自己",
                ["条件类型"] = "StatCondition",
                ["条件"] = {
                    ["名字"] = "online_time",
                    ["最小值"] = 14400,
                    ["最大值"] = 86400
                },
                ["动作"] = "威力乘以",
                ["数量"] = "0.5"
            },
            {
                ["目标"] = "自己",
                ["条件类型"] = "VariableCondition",
                ["条件"] = {
                    ["名字"] = "online_time",
                    ["最小值"] = 28800,
                    ["最大值"] = 86400
                },
                ["动作"] = "威力乘以",
                ["数量"] = "0.5"
            },
            {
                ["目标"] = "自己",
                ["条件类型"] = "VariableCondition",
                ["条件"] = {
                    ["名字"] = "online_time",
                    ["最小值"] = 43200,
                    ["最大值"] = 86400
                },
                ["动作"] = "威力乘以",
                ["数量"] = "0.5"
            },
            {
                ["目标"] = "自己",
                ["条件类型"] = "VariableCondition",
                ["条件"] = {
                    ["名字"] = "online_time",
                    ["最小值"] = 57600,
                    ["最大值"] = 86400
                },
                ["动作"] = "威力乘以",
                ["数量"] = "0.5"
            },
            {
                ["目标"] = "自己",
                ["条件类型"] = "VariableCondition",
                ["条件"] = {
                    ["名字"] = "online_time",
                    ["最小值"] = 72000,
                    ["最大值"] = 86400
                },
                ["动作"] = "威力乘以",
                ["数量"] = "0.5"
            }
        },
        ["排名掉落物"] = {
            {
                ["名次"] = {
                    1,
                    1
                },
                ["物品"] = {
                    ["阳光"] = 1800,
                    ["金币"] = 25
                }
            },
            {
                ["名次"] = {
                    2,
                    2
                },
                ["物品"] = {
                    ["阳光"] = 1500,
                    ["金币"] = 20
                }
            },
            {
                ["名次"] = {
                    3,
                    3
                },
                ["物品"] = {
                    ["阳光"] = 1350,
                    ["金币"] = 15
                }
            },
            {
                ["名次"] = {
                    4,
                    5
                },
                ["物品"] = {
                    ["阳光"] = 1100,
                    ["金币"] = 10
                }
            },
            {
                ["名次"] = {
                    6,
                    8
                },
                ["物品"] = {
                    ["阳光"] = 900,
                    ["金币"] = 7
                }
            },
            {
                ["名次"] = {
                    9,
                    9
                },
                ["物品"] = {
                    ["阳光"] = 750,
                    ["金币"] = 5
                }
            }
        },
        ["关闭结算界面"] = false
    }),
    ["1-3（2000级+）"] = LevelType.New({
        ["关卡ID"] = "1-3（2000级+）",
        ["描述"] = "需求等级: [level]/5000级",
        ["前置关卡"] = nil,
        ["关卡波次"] = {
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = "僵尸",
                                ["比重"] = 100
                            }
                        },
                        ["持续时间"] = 20,
                        ["数量"] = 20,
                        ["最大数量"] = 30,
                        ["开始时间"] = 0
                    }
                },
                ["属性倍率"] = 1,
                ["怪物等级"] = {
                    2000,
                    2100
                },
                ["掉落物"] = {
                    {
                        ["物品"] = "阳光",
                        ["数量"] = "100",
                        ["几率"] = 60
                    },
                    {
                        ["物品"] = "金币",
                        ["数量"] = "20",
                        ["几率"] = 40
                    }
                },
                ["转波次文字"] = "",
                ["转波次音效"] = ""
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = "士兵僵尸",
                                ["比重"] = 100
                            }
                        },
                        ["持续时间"] = 20,
                        ["数量"] = 10,
                        ["最大数量"] = 30,
                        ["开始时间"] = 0
                    }
                },
                ["属性倍率"] = 1,
                ["怪物等级"] = {
                    2100,
                    2300
                },
                ["掉落物"] = {
                    {
                        ["物品"] = "阳光",
                        ["数量"] = "120",
                        ["几率"] = 50
                    },
                    {
                        ["物品"] = "金币",
                        ["数量"] = "20",
                        ["几率"] = 50
                    }
                },
                ["转波次文字"] = "",
                ["转波次音效"] = ""
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = "寒冰僵尸",
                                ["比重"] = 100
                            }
                        },
                        ["持续时间"] = 20,
                        ["数量"] = 10,
                        ["最大数量"] = 20,
                        ["开始时间"] = 0
                    }
                },
                ["属性倍率"] = 1,
                ["怪物等级"] = {
                    2300,
                    2500
                },
                ["掉落物"] = {
                    {
                        ["物品"] = "阳光",
                        ["数量"] = "130",
                        ["几率"] = 50
                    },
                    {
                        ["物品"] = "金币",
                        ["数量"] = "20",
                        ["几率"] = 50
                    }
                },
                ["转波次文字"] = "",
                ["转波次音效"] = ""
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = "士兵僵尸",
                                ["比重"] = 100
                            },
                            {
                                ["怪物类型"] = "寒冰僵尸",
                                ["比重"] = 100
                            }
                        },
                        ["持续时间"] = 20,
                        ["数量"] = 20,
                        ["最大数量"] = 30,
                        ["开始时间"] = 0
                    }
                },
                ["属性倍率"] = 1,
                ["怪物等级"] = {
                    2500,
                    3000
                },
                ["掉落物"] = {
                    {
                        ["物品"] = "阳光",
                        ["数量"] = "130",
                        ["几率"] = 50
                    },
                    {
                        ["物品"] = "金币",
                        ["数量"] = "3",
                        ["几率"] = 50
                    }
                },
                ["转波次文字"] = "",
                ["转波次音效"] = ""
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = "士兵僵尸",
                                ["比重"] = 100
                            },
                            {
                                ["怪物类型"] = "寒冰僵尸",
                                ["比重"] = 100
                            },
                            {
                                ["怪物类型"] = "僵尸",
                                ["比重"] = 100
                            }
                        },
                        ["持续时间"] = 20,
                        ["数量"] = 20,
                        ["最大数量"] = 35,
                        ["开始时间"] = 0
                    }
                },
                ["属性倍率"] = 1,
                ["怪物等级"] = {
                    3000,
                    3500
                },
                ["掉落物"] = {
                    {
                        ["物品"] = "阳光",
                        ["数量"] = "130",
                        ["几率"] = 50
                    },
                    {
                        ["物品"] = "金币",
                        ["数量"] = "10",
                        ["几率"] = 50
                    }
                },
                ["转波次文字"] = "",
                ["转波次音效"] = ""
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = "摇滚僵尸",
                                ["比重"] = 100
                            }
                        },
                        ["持续时间"] = 20,
                        ["数量"] = 15,
                        ["最大数量"] = 25,
                        ["开始时间"] = 0
                    }
                },
                ["属性倍率"] = 1,
                ["怪物等级"] = {
                    3500,
                    4500
                },
                ["掉落物"] = {
                    {
                        ["物品"] = "阳光",
                        ["数量"] = "130",
                        ["几率"] = 50
                    },
                    {
                        ["物品"] = "金币",
                        ["数量"] = "20",
                        ["几率"] = 50
                    }
                },
                ["转波次文字"] = "",
                ["转波次音效"] = ""
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = "摇滚僵尸",
                                ["比重"] = 100
                            },
                            {
                                ["怪物类型"] = "寒冰僵尸",
                                ["比重"] = 100
                            }
                        },
                        ["持续时间"] = 20,
                        ["数量"] = 20,
                        ["最大数量"] = 30,
                        ["开始时间"] = 0
                    }
                },
                ["属性倍率"] = 1,
                ["怪物等级"] = {
                    4500,
                    5500
                },
                ["掉落物"] = {
                    {
                        ["物品"] = "阳光",
                        ["数量"] = "130",
                        ["几率"] = 50
                    },
                    {
                        ["物品"] = "金币",
                        ["数量"] = "20",
                        ["几率"] = 50
                    }
                },
                ["转波次文字"] = "",
                ["转波次音效"] = ""
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = "摇滚僵尸",
                                ["比重"] = 100
                            },
                            {
                                ["怪物类型"] = "寒冰僵尸",
                                ["比重"] = 100
                            }
                        },
                        ["持续时间"] = 20,
                        ["数量"] = 20,
                        ["最大数量"] = 30,
                        ["开始时间"] = 0
                    }
                },
                ["属性倍率"] = 1,
                ["怪物等级"] = {
                    5500,
                    7500
                },
                ["掉落物"] = {
                    {
                        ["物品"] = "阳光",
                        ["数量"] = "130",
                        ["几率"] = 50
                    },
                    {
                        ["物品"] = "金币",
                        ["数量"] = "20",
                        ["几率"] = 50
                    }
                },
                ["转波次文字"] = "",
                ["转波次音效"] = ""
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = "摇滚僵尸",
                                ["比重"] = 100
                            },
                            {
                                ["怪物类型"] = "寒冰僵尸",
                                ["比重"] = 100
                            }
                        },
                        ["持续时间"] = 20,
                        ["数量"] = 20,
                        ["最大数量"] = 30,
                        ["开始时间"] = 0
                    }
                },
                ["属性倍率"] = 1,
                ["怪物等级"] = {
                    7500,
                    10000
                },
                ["掉落物"] = {
                    {
                        ["物品"] = "阳光",
                        ["数量"] = "140",
                        ["几率"] = 50
                    },
                    {
                        ["物品"] = "金币",
                        ["数量"] = "20",
                        ["几率"] = 50
                    }
                },
                ["转波次文字"] = "",
                ["转波次音效"] = ""
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = "摇滚僵尸",
                                ["比重"] = 100
                            },
                            {
                                ["怪物类型"] = "寒冰僵尸",
                                ["比重"] = 100
                            }
                        },
                        ["持续时间"] = 20,
                        ["数量"] = 20,
                        ["最大数量"] = 30,
                        ["开始时间"] = 0
                    }
                },
                ["属性倍率"] = 1,
                ["怪物等级"] = {
                    10000,
                    11000
                },
                ["掉落物"] = {
                    {
                        ["物品"] = "阳光",
                        ["数量"] = "150",
                        ["几率"] = 50
                    },
                    {
                        ["物品"] = "金币",
                        ["数量"] = "20",
                        ["几率"] = 50
                    }
                },
                ["转波次文字"] = "",
                ["转波次音效"] = ""
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = "摇滚僵尸",
                                ["比重"] = 100
                            },
                            {
                                ["怪物类型"] = "寒冰僵尸",
                                ["比重"] = 100
                            }
                        },
                        ["持续时间"] = 20,
                        ["数量"] = 20,
                        ["最大数量"] = 30,
                        ["开始时间"] = 0
                    }
                },
                ["属性倍率"] = 1,
                ["怪物等级"] = {
                    11000,
                    13000
                },
                ["掉落物"] = {
                    {
                        ["物品"] = "阳光",
                        ["数量"] = "150",
                        ["几率"] = 50
                    },
                    {
                        ["物品"] = "金币",
                        ["数量"] = "20",
                        ["几率"] = 50
                    }
                },
                ["转波次文字"] = "",
                ["转波次音效"] = ""
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = "摇滚僵尸",
                                ["比重"] = 100
                            },
                            {
                                ["怪物类型"] = "寒冰僵尸",
                                ["比重"] = 100
                            }
                        },
                        ["持续时间"] = 20,
                        ["数量"] = 20,
                        ["最大数量"] = 30,
                        ["开始时间"] = 0
                    }
                },
                ["属性倍率"] = 1,
                ["怪物等级"] = {
                    13000,
                    15000
                },
                ["掉落物"] = {
                    {
                        ["物品"] = "阳光",
                        ["数量"] = "80",
                        ["几率"] = 50
                    },
                    {
                        ["物品"] = "金币",
                        ["数量"] = "20",
                        ["几率"] = 50
                    }
                },
                ["转波次文字"] = "",
                ["转波次音效"] = ""
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = "摇滚僵尸",
                                ["比重"] = 150
                            },
                            {
                                ["怪物类型"] = "寒冰僵尸",
                                ["比重"] = 100
                            }
                        },
                        ["持续时间"] = 20,
                        ["数量"] = 20,
                        ["最大数量"] = 30,
                        ["开始时间"] = 0
                    }
                },
                ["属性倍率"] = 1,
                ["怪物等级"] = {
                    15000,
                    17000
                },
                ["掉落物"] = {
                    {
                        ["物品"] = "阳光",
                        ["数量"] = "150",
                        ["几率"] = 50
                    },
                    {
                        ["物品"] = "金币",
                        ["数量"] = "20",
                        ["几率"] = 50
                    }
                },
                ["转波次文字"] = "",
                ["转波次音效"] = ""
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = "摇滚僵尸",
                                ["比重"] = 100
                            },
                            {
                                ["怪物类型"] = "寒冰僵尸",
                                ["比重"] = 100
                            }
                        },
                        ["持续时间"] = 20,
                        ["数量"] = 20,
                        ["最大数量"] = 30,
                        ["开始时间"] = 0
                    }
                },
                ["属性倍率"] = 1,
                ["怪物等级"] = {
                    17000,
                    19000
                },
                ["掉落物"] = {
                    {
                        ["物品"] = "阳光",
                        ["数量"] = "160",
                        ["几率"] = 50
                    },
                    {
                        ["物品"] = "金币",
                        ["数量"] = "20",
                        ["几率"] = 50
                    }
                },
                ["转波次文字"] = "",
                ["转波次音效"] = ""
            }
        },
        ["场景"] = "副本3",
        ["开始玩家"] = 1,
        ["增加额外玩家时间"] = 3,
        ["最大玩家数"] = 6,
        ["每个玩家增加数量倍率"] = 0,
        ["进入条件"] = Modifiers.New({
            {
                ["目标"] = "自己",
                ["条件类型"] = "VariableCondition",
                ["条件"] = {
                    ["名字"] = "level",
                    ["最小值"] = 5000,
                    ["最大值"] = 100000
                },
                ["动作"] = "必须"
            }
        }),
        ["掉落物数量修改"] = {
            {
                ["目标"] = "自己",
                ["条件类型"] = "VariableCondition",
                ["条件"] = {
                    ["名字"] = "online_time",
                    ["最小值"] = 14400,
                    ["最大值"] = 86400
                },
                ["动作"] = "威力乘以",
                ["数量"] = "0.5"
            },
            {
                ["目标"] = "自己",
                ["条件类型"] = "VariableCondition",
                ["条件"] = {
                    ["名字"] = "online_time",
                    ["最小值"] = 28800,
                    ["最大值"] = 86400
                },
                ["动作"] = "威力乘以",
                ["数量"] = "0.5"
            },
            {
                ["目标"] = "自己",
                ["条件类型"] = "VariableCondition",
                ["条件"] = {
                    ["名字"] = "online_time",
                    ["最小值"] = 43200,
                    ["最大值"] = 86400
                },
                ["动作"] = "威力乘以",
                ["数量"] = "0.5"
            },
            {
                ["目标"] = "自己",
                ["条件类型"] = "VariableCondition",
                ["条件"] = {
                    ["名字"] = "online_time",
                    ["最小值"] = 57600,
                    ["最大值"] = 86400
                },
                ["动作"] = "威力乘以",
                ["数量"] = "0.5"
            }
        },
        ["排名掉落物"] = {
            {
                ["名次"] = {
                    1,
                    1
                },
                ["物品"] = {
                    ["阳光"] = 2600,
                    ["金币"] = 50
                }
            },
            {
                ["名次"] = {
                    2,
                    2
                },
                ["物品"] = {
                    ["阳光"] = 3340,
                    ["金币"] = 40
                }
            },
            {
                ["名次"] = {
                    3,
                    3
                },
                ["物品"] = {
                    ["阳光"] = 2080,
                    ["金币"] = 30
                }
            },
            {
                ["名次"] = {
                    4,
                    5
                },
                ["物品"] = {
                    ["阳光"] = 1605,
                    ["金币"] = 20
                }
            },
            {
                ["名次"] = {
                    6,
                    8
                },
                ["物品"] = {
                    ["阳光"] = 1300,
                    ["金币"] = 10
                }
            },
            {
                ["名次"] = {
                    9,
                    9
                },
                ["物品"] = {
                    ["阳光"] = 1170,
                    ["金币"] = 5
                }
            }
        },
        ["关闭结算界面"] = false
    }),
    ["1-4（20000级+）"] = LevelType.New({
        ["关卡ID"] = "1-4（20000级+）",
        ["描述"] = "需求等级: [level]/20000级",
        ["前置关卡"] = nil,
        ["关卡波次"] = {
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = "士兵僵尸",
                                ["比重"] = 100
                            }
                        },
                        ["持续时间"] = 20,
                        ["数量"] = 20,
                        ["最大数量"] = 30,
                        ["开始时间"] = 0
                    }
                },
                ["属性倍率"] = 1,
                ["怪物等级"] = {
                    20000,
                    21000
                },
                ["掉落物"] = {
                    {
                        ["物品"] = "阳光",
                        ["数量"] = "80",
                        ["几率"] = 50
                    },
                    {
                        ["物品"] = "金币",
                        ["数量"] = "30",
                        ["几率"] = 40
                    }
                },
                ["转波次文字"] = "",
                ["转波次音效"] = ""
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = "寒冰僵尸",
                                ["比重"] = 100
                            },
                            {
                                ["怪物类型"] = "士兵僵尸",
                                ["比重"] = 100
                            }
                        },
                        ["持续时间"] = 20,
                        ["数量"] = 20,
                        ["最大数量"] = 40,
                        ["开始时间"] = 10
                    }
                },
                ["属性倍率"] = 1,
                ["怪物等级"] = {
                    21000,
                    22000
                },
                ["掉落物"] = {
                    {
                        ["物品"] = "阳光",
                        ["数量"] = "70",
                        ["几率"] = 60
                    },
                    {
                        ["物品"] = "金币",
                        ["数量"] = "20",
                        ["几率"] = 50
                    }
                },
                ["转波次文字"] = "",
                ["转波次音效"] = ""
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = "寒冰僵尸",
                                ["比重"] = 100
                            },
                            {
                                ["怪物类型"] = "摇滚僵尸",
                                ["比重"] = 100
                            }
                        },
                        ["持续时间"] = 20,
                        ["数量"] = 20,
                        ["最大数量"] = 30,
                        ["开始时间"] = 0
                    }
                },
                ["属性倍率"] = 1,
                ["怪物等级"] = {
                    22000,
                    23000
                },
                ["掉落物"] = {
                    {
                        ["物品"] = "阳光",
                        ["数量"] = "60",
                        ["几率"] = 55
                    },
                    {
                        ["物品"] = "金币",
                        ["数量"] = "15",
                        ["几率"] = 60
                    },
                    {
                        ["物品"] = "能量豆",
                        ["数量"] = "1",
                        ["几率"] = 0.02
                    }
                },
                ["转波次文字"] = "",
                ["转波次音效"] = ""
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = "寒冰僵尸",
                                ["比重"] = 100
                            },
                            {
                                ["怪物类型"] = "士兵僵尸",
                                ["比重"] = 100
                            },
                            {
                                ["怪物类型"] = "摇滚僵尸",
                                ["比重"] = 100
                            }
                        },
                        ["持续时间"] = 20,
                        ["数量"] = 20,
                        ["最大数量"] = 40,
                        ["开始时间"] = 0
                    }
                },
                ["属性倍率"] = 1,
                ["怪物等级"] = {
                    23000,
                    24000
                },
                ["掉落物"] = {
                    {
                        ["物品"] = "阳光",
                        ["数量"] = "70",
                        ["几率"] = 55
                    },
                    {
                        ["物品"] = "金币",
                        ["数量"] = "10",
                        ["几率"] = 60
                    },
                    {
                        ["物品"] = "能量豆",
                        ["数量"] = "1",
                        ["几率"] = 0.03
                    }
                },
                ["转波次文字"] = "",
                ["转波次音效"] = ""
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = "寒冰僵尸",
                                ["比重"] = 100
                            },
                            {
                                ["怪物类型"] = "绅士僵尸",
                                ["比重"] = 50
                            }
                        },
                        ["持续时间"] = 20,
                        ["数量"] = 10,
                        ["最大数量"] = 30,
                        ["开始时间"] = 0
                    }
                },
                ["属性倍率"] = 1,
                ["怪物等级"] = {
                    24000,
                    26000
                },
                ["掉落物"] = {
                    {
                        ["物品"] = "阳光",
                        ["数量"] = "70",
                        ["几率"] = 55
                    },
                    {
                        ["物品"] = "金币",
                        ["数量"] = "15",
                        ["几率"] = 60
                    },
                    {
                        ["物品"] = "能量豆",
                        ["数量"] = "15",
                        ["几率"] = 0.04
                    }
                },
                ["转波次文字"] = "",
                ["转波次音效"] = ""
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = "绅士僵尸",
                                ["比重"] = 100
                            },
                            {
                                ["怪物类型"] = "寒冰僵尸",
                                ["比重"] = 100
                            },
                            {
                                ["怪物类型"] = "摇滚僵尸",
                                ["比重"] = 100
                            }
                        },
                        ["持续时间"] = 20,
                        ["数量"] = 20,
                        ["最大数量"] = 30,
                        ["开始时间"] = 0
                    }
                },
                ["属性倍率"] = 1,
                ["怪物等级"] = {
                    26000,
                    28000
                },
                ["掉落物"] = {
                    {
                        ["物品"] = "阳光",
                        ["数量"] = "60",
                        ["几率"] = 55
                    },
                    {
                        ["物品"] = "金币",
                        ["数量"] = "30",
                        ["几率"] = 60
                    },
                    {
                        ["物品"] = "能量豆",
                        ["数量"] = "1",
                        ["几率"] = 0.05
                    }
                },
                ["转波次文字"] = "",
                ["转波次音效"] = ""
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = "绅士僵尸",
                                ["比重"] = 100
                            }
                        },
                        ["持续时间"] = 20,
                        ["数量"] = 20,
                        ["最大数量"] = 30,
                        ["开始时间"] = 0
                    }
                },
                ["属性倍率"] = 1,
                ["怪物等级"] = {
                    28000,
                    29000
                },
                ["掉落物"] = {
                    {
                        ["物品"] = "阳光",
                        ["数量"] = "60",
                        ["几率"] = 55
                    },
                    {
                        ["物品"] = "金币",
                        ["数量"] = "15",
                        ["几率"] = 60
                    },
                    {
                        ["物品"] = "能量豆",
                        ["数量"] = "5",
                        ["几率"] = 0.06
                    }
                },
                ["转波次文字"] = "",
                ["转波次音效"] = ""
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = "绅士僵尸",
                                ["比重"] = 100
                            }
                        },
                        ["持续时间"] = 20,
                        ["数量"] = 10,
                        ["最大数量"] = 60,
                        ["开始时间"] = 0
                    }
                },
                ["属性倍率"] = 1,
                ["怪物等级"] = {
                    29000,
                    30000
                },
                ["掉落物"] = {
                    {
                        ["物品"] = "阳光",
                        ["数量"] = "80",
                        ["几率"] = 55
                    },
                    {
                        ["物品"] = "金币",
                        ["数量"] = "30",
                        ["几率"] = 60
                    }
                },
                ["转波次文字"] = "",
                ["转波次音效"] = ""
            }
        },
        ["场景"] = "副本4",
        ["开始玩家"] = 1,
        ["增加额外玩家时间"] = 4,
        ["最大玩家数"] = 6,
        ["每个玩家增加数量倍率"] = 0,
        ["进入条件"] = Modifiers.New({
            {
                ["目标"] = "自己",
                ["条件类型"] = "VariableCondition",
                ["条件"] = {
                    ["名字"] = "level",
                    ["最小值"] = 20000,
                    ["最大值"] = 1000000
                },
                ["动作"] = "必须"
            }
        }),
        ["掉落物数量修改"] = {
            {
                ["目标"] = "自己",
                ["条件类型"] = "VariableCondition",
                ["条件"] = {
                    ["名字"] = "online_time",
                    ["最小值"] = 14400,
                    ["最大值"] = 86400
                },
                ["动作"] = "威力乘以",
                ["数量"] = "0.5"
            },
            {
                ["目标"] = "自己",
                ["条件类型"] = "VariableCondition",
                ["条件"] = {
                    ["名字"] = "online_time",
                    ["最小值"] = 28800,
                    ["最大值"] = 86400
                },
                ["动作"] = "威力乘以",
                ["数量"] = "0.5"
            },
            {
                ["目标"] = "自己",
                ["条件类型"] = "VariableCondition",
                ["条件"] = {
                    ["名字"] = "online_time",
                    ["最小值"] = 43200,
                    ["最大值"] = 86400
                },
                ["动作"] = "威力乘以",
                ["数量"] = "0.5"
            },
            {
                ["目标"] = "自己",
                ["条件类型"] = "VariableCondition",
                ["条件"] = {
                    ["名字"] = "online_time",
                    ["最小值"] = 57600,
                    ["最大值"] = 86400
                },
                ["动作"] = "威力乘以",
                ["数量"] = "0.5"
            }
        },
        ["排名掉落物"] = {
            {
                ["名次"] = {
                    1,
                    1
                },
                ["物品"] = {
                    ["阳光"] = 4032,
                    ["金币"] = 192
                }
            },
            {
                ["名次"] = {
                    2,
                    2
                },
                ["物品"] = {
                    ["阳光"] = 3676,
                    ["金币"] = 168
                }
            },
            {
                ["名次"] = {
                    3,
                    3
                },
                ["物品"] = {
                    ["阳光"] = 3192,
                    ["金币"] = 144
                }
            },
            {
                ["名次"] = {
                    4,
                    5
                },
                ["物品"] = {
                    ["阳光"] = 2688,
                    ["金币"] = 120
                }
            },
            {
                ["名次"] = {
                    6,
                    7
                },
                ["物品"] = {
                    ["阳光"] = 2184,
                    ["金币"] = 96
                }
            }
        },
        ["关闭结算界面"] = false
    }),
    ["测试关卡"] = LevelType.New({
        ["关卡ID"] = "测试关卡",
        ["前置关卡"] = nil,
        ["关卡波次"] = {
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = nil,
                                ["比重"] = 50
                            }
                        },
                        ["持续时间"] = 20,
                        ["数量"] = 10,
                        ["最大数量"] = 20,
                        ["开始时间"] = 10
                    }
                },
                ["属性倍率"] = 1,
                ["怪物等级"] = {
                    0,
                    0
                }
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = nil,
                                ["比重"] = 50
                            }
                        },
                        ["持续时间"] = 20,
                        ["数量"] = 10,
                        ["最大数量"] = 20,
                        ["开始时间"] = 10
                    }
                },
                ["属性倍率"] = 1,
                ["怪物等级"] = {
                    0,
                    0
                }
            }
        },
        ["场景"] = "副本1",
        ["开始玩家"] = 1,
        ["增加额外玩家时间"] = 10,
        ["最大玩家数"] = 6,
        ["每个玩家增加数量倍率"] = 0.5,
        ["每个玩家增加属性倍率"] = {
            ["生命"] = 0.5,
            ["攻击"] = 0.1
        },
        ["进入条件"] = Modifiers.New({
            {
                ["目标"] = "自己",
                ["条件类型"] = "HealthCondition",
                ["条件"] = {
                    ["百分比"] = true,
                    ["最小值"] = 0,
                    ["最大值"] = 100
                },
                ["动作"] = "必须"
            }
        }),
        ["关闭结算界面"] = false
    })
}loaded = true
end

---@param level string
---@return LevelType
function LevelConfig.Get(level)
    if not loaded then
        LoadConfig()
    end
    return LevelConfig.config[level]
end

---@return table<string, LevelType>
function LevelConfig.GetAll()
    if not loaded then
        LoadConfig()
    end
    return LevelConfig.config
end
return LevelConfig