local MainStorage = game:GetService('MainStorage')
local gg                = require(MainStorage.code.common.MGlobal)    ---@type gg
local MobType      = require(MainStorage.code.common.config_type.MobType)    ---@type MobType

--- 怪物配置文件
---@class MobTypeConfig
local MobTypeConfig = {}
local loaded = false

local function LoadConfig()
    MobTypeConfig.config ={
    ["副-召唤物-坚果"] = MobType.New({
        ["怪物ID"] = "副-召唤物-坚果",
        ["显示名"] = "坚果",
        ["尺寸"] = {
            0,
            0
        },
        ["模型"] = "植物/坚果",
        ["状态机"] = "卡片",
        ["是首领"] = false,
        ["基础等级"] = 1,
        ["属性公式"] = {
            ["速度"] = "0"
        },
        ["技能"] = {
            {
                ["时机"] = "周期",
                ["默认目标"] = "自己",
                ["魔法"] = {
                    ["魔法"] = "副_坚果_范围"
                },
                ["距离"] = 0
            }
        },
        ["图鉴击杀数"] = 0,
        ["图鉴完成奖励"] = nil,
        ["图鉴完成奖励数量"] = 0,
        ["显示血条"] = true,
        ["额外攻击距离"] = 100,
        ["攻击时点"] = 0.5,
        ["行为"] = {
            {
                ["脱战距离"] = 0,
                ["主动索敌"] = 2000,
                ["攻击时静止"] = true,
                ["类型"] = "近战攻击"
            },
            {
                ["类型"] = "静止"
            }
        },
        ["offset"] = nil
    }),
    ["副-召唤物-菜问"] = MobType.New({
        ["怪物ID"] = "副-召唤物-菜问",
        ["显示名"] = "菜问",
        ["尺寸"] = {
            0,
            0
        },
        ["模型"] = "植物/白菜",
        ["状态机"] = "卡片",
        ["是首领"] = false,
        ["基础等级"] = 1,
        ["属性公式"] = {
            ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.13*20)^1.1",
            ["生命"] = "(2^(LVL/10))*(10*LVL*1*1.13*20)^1.1",
            ["速度"] = "0"
        },
        ["图鉴击杀数"] = 0,
        ["图鉴完成奖励"] = nil,
        ["图鉴完成奖励数量"] = 0,
        ["显示血条"] = true,
        ["额外攻击距离"] = 100,
        ["攻击时点"] = 0.5,
        ["行为"] = {
            {
                ["脱战距离"] = 600,
                ["主动索敌"] = 500,
                ["攻击时静止"] = true,
                ["类型"] = "近战攻击"
            },
            {
                ["类型"] = "静止"
            }
        },
        ["offset"] = nil
    }),
    ["副-召唤物-豌豆射手"] = MobType.New({
        ["怪物ID"] = "副-召唤物-豌豆射手",
        ["显示名"] = "豌豆射手",
        ["尺寸"] = {
            0,
            0
        },
        ["模型"] = "植物/豌豆射手",
        ["状态机"] = "卡片",
        ["是首领"] = false,
        ["基础等级"] = 1,
        ["属性公式"] = {
            ["速度"] = "0"
        },
        ["技能"] = {
            {
                ["时机"] = "周期",
                ["默认目标"] = "目标",
                ["魔法"] = {
                    ["魔法"] = "副_豌豆射手_入口"
                },
                ["距离"] = 0
            }
        },
        ["图鉴击杀数"] = 0,
        ["图鉴完成奖励"] = nil,
        ["图鉴完成奖励数量"] = 0,
        ["显示血条"] = true,
        ["额外攻击距离"] = 100,
        ["攻击时点"] = 0.5,
        ["行为"] = {
            {
                ["脱战距离"] = 0,
                ["主动索敌"] = 2000,
                ["攻击时静止"] = true,
                ["类型"] = "近战攻击"
            },
            {
                ["类型"] = "静止"
            }
        },
        ["offset"] = nil
    }),
    ["副-召唤物-仙人掌"] = MobType.New({
        ["怪物ID"] = "副-召唤物-仙人掌",
        ["显示名"] = "仙人掌",
        ["尺寸"] = {
            0,
            0
        },
        ["模型"] = "植物/仙人掌",
        ["状态机"] = "卡片",
        ["是首领"] = false,
        ["基础等级"] = 1,
        ["属性公式"] = {
            ["攻击"] = "50",
            ["生命"] = "100",
            ["速度"] = "0"
        },
        ["技能"] = {
            {
                ["时机"] = "周期",
                ["默认目标"] = "目标",
                ["魔法"] = {
                    ["魔法"] = "副_仙人掌_入口"
                },
                ["距离"] = 0
            }
        },
        ["图鉴击杀数"] = 0,
        ["图鉴完成奖励"] = nil,
        ["图鉴完成奖励数量"] = 0,
        ["显示血条"] = true,
        ["额外攻击距离"] = 100,
        ["攻击时点"] = 0.5,
        ["行为"] = {
            {
                ["脱战距离"] = 0,
                ["主动索敌"] = 20000,
                ["攻击时静止"] = true,
                ["类型"] = "近战攻击"
            },
            {
                ["类型"] = "静止"
            }
        },
        ["offset"] = nil
    }),
    ["副-召唤物-辣椒投手"] = MobType.New({
        ["怪物ID"] = "副-召唤物-辣椒投手",
        ["显示名"] = "辣椒投手",
        ["尺寸"] = {
            0,
            0
        },
        ["模型"] = "植物/辣椒投手",
        ["状态机"] = "卡片",
        ["是首领"] = false,
        ["基础等级"] = 1,
        ["属性公式"] = {
            ["攻击"] = "(2^(LVL/10))*(10*LVL*1*1.13*20)^1.1",
            ["生命"] = "(2^(LVL/10))*(10*LVL*1*1.13*20)^1.1",
            ["速度"] = "0"
        },
        ["技能"] = {
            {
                ["时机"] = "周期",
                ["默认目标"] = "目标",
                ["魔法"] = {
                    ["魔法"] = "副_辣椒投手_入口"
                },
                ["距离"] = 0
            }
        },
        ["图鉴击杀数"] = 0,
        ["图鉴完成奖励"] = nil,
        ["图鉴完成奖励数量"] = 0,
        ["显示血条"] = true,
        ["额外攻击距离"] = 100,
        ["攻击时点"] = 0.5,
        ["行为"] = {
            {
                ["脱战距离"] = 0,
                ["主动索敌"] = 2000,
                ["攻击时静止"] = true,
                ["类型"] = "近战攻击"
            },
            {
                ["类型"] = "静止"
            }
        },
        ["offset"] = nil,
        ["闲置音效"] = nil,
        ["攻击音效"] = nil,
        ["受击音效"] = nil,
        ["死亡音效"] = nil
    }),
    ["副-召唤物-星星果"] = MobType.New({
        ["怪物ID"] = "副-召唤物-星星果",
        ["显示名"] = "星星果",
        ["尺寸"] = {
            0,
            0
        },
        ["模型"] = "植物/星星果",
        ["状态机"] = "卡片",
        ["是首领"] = false,
        ["基础等级"] = 1,
        ["属性公式"] = {
            ["攻击"] = "200",
            ["生命"] = "350",
            ["速度"] = "0"
        },
        ["技能"] = {
            {
                ["时机"] = "周期",
                ["默认目标"] = "目标",
                ["魔法"] = {
                    ["魔法"] = "副_星星果_入口"
                },
                ["距离"] = 0
            }
        },
        ["图鉴击杀数"] = 0,
        ["图鉴完成奖励"] = nil,
        ["图鉴完成奖励数量"] = 0,
        ["显示血条"] = true,
        ["额外攻击距离"] = 100,
        ["攻击时点"] = 0.5,
        ["行为"] = {
            {
                ["脱战距离"] = 0,
                ["主动索敌"] = 2000,
                ["攻击时静止"] = true,
                ["类型"] = "近战攻击"
            },
            {
                ["类型"] = "静止"
            }
        },
        ["offset"] = nil
    }),
    ["副-召唤物-椰子炮"] = MobType.New({
        ["怪物ID"] = "副-召唤物-椰子炮",
        ["显示名"] = "椰子炮",
        ["尺寸"] = {
            0,
            0
        },
        ["模型"] = "植物/椰子炮",
        ["状态机"] = "卡片",
        ["是首领"] = false,
        ["基础等级"] = 1,
        ["属性公式"] = {
            ["攻击"] = "35",
            ["生命"] = "120",
            ["速度"] = "0"
        },
        ["技能"] = {
            {
                ["时机"] = "周期",
                ["默认目标"] = "目标",
                ["魔法"] = {
                    ["魔法"] = "椰子炮_入口"
                },
                ["距离"] = 0
            }
        },
        ["图鉴击杀数"] = 0,
        ["图鉴完成奖励"] = nil,
        ["图鉴完成奖励数量"] = 0,
        ["显示血条"] = true,
        ["额外攻击距离"] = 100,
        ["攻击时点"] = 0.5,
        ["行为"] = {
            {
                ["脱战距离"] = 0,
                ["主动索敌"] = 2000,
                ["攻击时静止"] = true,
                ["类型"] = "近战攻击"
            },
            {
                ["类型"] = "静止"
            }
        },
        ["offset"] = nil
    }),
    ["副-召唤物-魅惑菇"] = MobType.New({
        ["怪物ID"] = "副-召唤物-魅惑菇",
        ["显示名"] = "魅惑菇",
        ["尺寸"] = {
            0,
            0
        },
        ["模型"] = "植物/魅惑菇",
        ["状态机"] = "卡片",
        ["是首领"] = false,
        ["基础等级"] = 1,
        ["属性公式"] = {
            ["攻击"] = "0",
            ["生命"] = "0",
            ["速度"] = "100"
        },
        ["技能"] = {
            {
                ["时机"] = "周期",
                ["默认目标"] = "目标",
                ["魔法"] = {
                    ["魔法"] = "副_窝瓜_范围魔法"
                },
                ["距离"] = 0
            }
        },
        ["图鉴击杀数"] = 0,
        ["图鉴完成奖励"] = nil,
        ["图鉴完成奖励数量"] = 0,
        ["显示血条"] = true,
        ["额外攻击距离"] = 100,
        ["攻击时点"] = 0.5,
        ["offset"] = nil
    }),
    ["test"] = MobType.New({
        ["怪物ID"] = "test",
        ["显示名"] = "岩浆徘行者",
        ["描述"] = "地心魔物，步履熔岩，所过皆烬",
        ["尺寸"] = {
            0,
            0
        },
        ["模型"] = "僵尸/僵尸",
        ["状态机"] = "僵尸",
        ["是首领"] = true,
        ["基础等级"] = 26,
        ["属性公式"] = {
            ["攻击"] = "clamp(LVL-49,0,21)",
            ["生命"] = "180+120*LVL+max(0,LVL-10)*240+max(0,LVL-15)*80",
            ["速度"] = "0"
        },
        ["图鉴图标"] = "11141555",
        ["图鉴击杀数"] = 146,
        ["图鉴完成奖励"] = nil,
        ["图鉴完成奖励数量"] = 50,
        ["显示血条"] = true,
        ["额外攻击距离"] = 100,
        ["攻击时点"] = 0.5,
        ["行为"] = {
            {
                ["脱战距离"] = 2000,
                ["主动索敌"] = 1000,
                ["攻击时静止"] = true,
                ["类型"] = "近战攻击"
            },
            {
                ["距离"] = 500,
                ["保持在出生点附近"] = true,
                ["几率"] = 50,
                ["类型"] = "随机移动"
            },
            {
                ["类型"] = "静止"
            }
        },
        ["offset"] = nil,
        ["闲置音效"] = "sandboxId://soundeffect/groan5_僵尸呻吟.ogg",
        ["攻击音效"] = "sandboxId://soundeffect/chomp[1~3]_僵尸吃.ogg",
        ["受击音效"] = "sandboxId://soundeffect/groan[1~6]_僵尸呻吟.ogg",
        ["死亡音效"] = "sandboxId://soundeffect/groan2_僵尸呻吟.ogg"
    }),
    ["僵尸"] = MobType.New({
        ["怪物ID"] = "僵尸",
        ["显示名"] = "僵尸",
        ["描述"] = "渴望战斗，攻击欲极强的僵尸。",
        ["尺寸"] = {
            0,
            0
        },
        ["模型"] = "僵尸/普通僵尸",
        ["状态机"] = "僵尸",
        ["是首领"] = true,
        ["基础等级"] = 26,
        ["属性公式"] = {
            ["生命"] = "(100+1.25^(LVL/650)+LVL*35+max(0,(LVL-1000)*50)+max(0,(LVL-3000)*150)+max(0,(LVL-6000)*450)+max(0,(LVL-10000)*1300)+max(0,(LVL-14000)*3900)+max(0,(LVL-11000)*8000)+max(0,(LVL-26000)*33000)+max(0,(LVL-32000)*99000)+max(0,(LVL-36000)*300000)+max(0,(LVL-40000)*900000)+max(0,(LVL-45000)*2500000)+max(0,(LVL-50000)*6500000))*3/5",
            ["攻击"] = "(100+1.25^(LVL/650)+LVL*35+max(0,(LVL-1000)*50)+max(0,(LVL-3000)*150)+max(0,(LVL-6000)*450)+max(0,(LVL-10000)*1300)+max(0,(LVL-14000)*3900)+max(0,(LVL-11000)*8000)+max(0,(LVL-26000)*33000)+max(0,(LVL-32000)*99000)+max(0,(LVL-36000)*300000)+max(0,(LVL-40000)*900000)+max(0,(LVL-45000)*2500000)+max(0,(LVL-50000)*6500000))/5",
            ["速度"] = "50"
        },
        ["图鉴击杀数"] = 0,
        ["图鉴完成奖励"] = nil,
        ["图鉴完成奖励数量"] = 0,
        ["显示血条"] = true,
        ["额外攻击距离"] = 100,
        ["攻击时点"] = 0.5,
        ["行为"] = {
            {
                ["脱战距离"] = 0,
                ["主动索敌"] = 1000,
                ["攻击时静止"] = true,
                ["类型"] = "近战攻击"
            },
            {
                ["距离"] = 500,
                ["保持在出生点附近"] = true,
                ["几率"] = 50,
                ["类型"] = "随机移动"
            },
            {
                ["类型"] = "静止"
            }
        },
        ["offset"] = nil,
        ["掉落倍率"] = {
            ["阳光"] = 0
        },
        ["闲置音效"] = "sandboxId://soundeffect/groan[1~6]_僵尸呻吟.ogg",
        ["攻击音效"] = "sandboxId://soundeffect/chomp[1~3]_僵尸吃.ogg",
        ["受击音效"] = "sandboxId://soundeffect/splat[1~3].ogg"
    }),
    ["呆滞僵尸"] = MobType.New({
        ["怪物ID"] = "呆滞僵尸",
        ["显示名"] = "僵尸",
        ["描述"] = "渴望战斗，攻击欲极强的僵尸。",
        ["尺寸"] = {
            0,
            0
        },
        ["模型"] = "僵尸/普通僵尸",
        ["状态机"] = "僵尸",
        ["是首领"] = true,
        ["基础等级"] = 1,
        ["属性公式"] = {
            ["攻击"] = "7 + LVL*3",
            ["生命"] = "LVL*30",
            ["速度"] = "0"
        },
        ["图鉴击杀数"] = 0,
        ["图鉴完成奖励"] = nil,
        ["图鉴完成奖励数量"] = 0,
        ["显示血条"] = true,
        ["额外攻击距离"] = 100,
        ["攻击时点"] = 0.5,
        ["offset"] = nil,
        ["闲置音效"] = "sandboxId://soundeffect/groan[1~6]_僵尸呻吟.ogg",
        ["攻击音效"] = "sandboxId://soundeffect/chomp[1~3]_僵尸吃.ogg",
        ["受击音效"] = "sandboxId://soundeffect/splat[1~3].ogg"
    }),
    ["士兵僵尸"] = MobType.New({
        ["怪物ID"] = "士兵僵尸",
        ["显示名"] = "士兵僵尸",
        ["描述"] = "渴望战斗，攻击欲极强的僵尸。",
        ["尺寸"] = {
            0,
            0
        },
        ["模型"] = "僵尸/士兵僵尸",
        ["状态机"] = "僵尸",
        ["是首领"] = true,
        ["基础等级"] = 26,
        ["属性公式"] = {
            ["攻击"] = "(100+1.25^(LVL/650)+LVL*35+max(0,(LVL-1000)*50)+max(0,(LVL-3000)*150)+max(0,(LVL-6000)*450)+max(0,(LVL-10000)*1300)+max(0,(LVL-14000)*3900)+max(0,(LVL-11000)*8000)+max(0,(LVL-26000)*33000)+max(0,(LVL-32000)*99000)+max(0,(LVL-36000)*300000)+max(0,(LVL-40000)*900000)+max(0,(LVL-45000)*2500000)+max(0,(LVL-50000)*6500000))/3.5",
            ["生命"] = "(100+1.25^(LVL/650)+LVL*35+max(0,(LVL-1000)*50)+max(0,(LVL-3000)*150)+max(0,(LVL-6000)*450)+max(0,(LVL-10000)*1300)+max(0,(LVL-14000)*3900)+max(0,(LVL-11000)*8000)+max(0,(LVL-26000)*33000)+max(0,(LVL-32000)*99000)+max(0,(LVL-36000)*300000)+max(0,(LVL-40000)*900000)+max(0,(LVL-45000)*2500000)+max(0,(LVL-50000)*6500000))/4.5",
            ["速度"] = "200"
        },
        ["图鉴击杀数"] = 0,
        ["图鉴完成奖励"] = nil,
        ["图鉴完成奖励数量"] = 0,
        ["显示血条"] = true,
        ["额外攻击距离"] = 100,
        ["攻击时点"] = 0.5,
        ["行为"] = {
            {
                ["脱战距离"] = 0,
                ["主动索敌"] = 10000,
                ["攻击时静止"] = true,
                ["类型"] = "近战攻击"
            },
            {
                ["距离"] = 500,
                ["保持在出生点附近"] = true,
                ["几率"] = 50,
                ["类型"] = "随机移动"
            },
            {
                ["类型"] = "静止"
            }
        },
        ["offset"] = nil,
        ["闲置音效"] = "sandboxId://soundeffect/groan[1~6]_僵尸呻吟.ogg",
        ["攻击音效"] = "sandboxId://soundeffect/chomp[1~3]_僵尸吃.ogg",
        ["受击音效"] = "sandboxId://soundeffect/splat[1~3].ogg"
    }),
    ["寒冰僵尸"] = MobType.New({
        ["怪物ID"] = "寒冰僵尸",
        ["显示名"] = "寒冰僵尸",
        ["描述"] = "生于寒冷地带，害怕火焰的僵尸。",
        ["尺寸"] = {
            0,
            0
        },
        ["模型"] = "僵尸/寒冰僵尸",
        ["状态机"] = "僵尸",
        ["是首领"] = true,
        ["基础等级"] = 26,
        ["属性公式"] = {
            ["生命"] = "(100+1.25^(LVL/650)+LVL*35+max(0,(LVL-1000)*50)+max(0,(LVL-3000)*150)+max(0,(LVL-6000)*450)+max(0,(LVL-10000)*1300)+max(0,(LVL-14000)*3900)+max(0,(LVL-11000)*8000)+max(0,(LVL-26000)*33000)+max(0,(LVL-32000)*99000)+max(0,(LVL-36000)*300000)+max(0,(LVL-40000)*900000)+max(0,(LVL-45000)*2500000)+max(0,(LVL-50000)*6500000))*2",
            ["攻击"] = "(100+1.25^(LVL/650)+LVL*35+max(0,(LVL-1000)*50)+max(0,(LVL-3000)*150)+max(0,(LVL-6000)*450)+max(0,(LVL-10000)*1300)+max(0,(LVL-14000)*3900)+max(0,(LVL-11000)*8000)+max(0,(LVL-26000)*33000)+max(0,(LVL-32000)*99000)+max(0,(LVL-36000)*300000)+max(0,(LVL-40000)*900000)+max(0,(LVL-45000)*2500000)+max(0,(LVL-50000)*6500000))/8",
            ["速度"] = "300"
        },
        ["图鉴击杀数"] = 0,
        ["图鉴完成奖励"] = nil,
        ["图鉴完成奖励数量"] = 0,
        ["显示血条"] = true,
        ["额外攻击距离"] = 100,
        ["攻击时点"] = 0.5,
        ["行为"] = {
            {
                ["脱战距离"] = 0,
                ["主动索敌"] = 10000,
                ["攻击时静止"] = true,
                ["类型"] = "近战攻击"
            },
            {
                ["距离"] = 500,
                ["保持在出生点附近"] = true,
                ["几率"] = 50,
                ["类型"] = "随机移动"
            },
            {
                ["类型"] = "静止"
            }
        },
        ["offset"] = nil,
        ["闲置音效"] = "sandboxId://soundeffect/groan[1~6]_僵尸呻吟.ogg",
        ["攻击音效"] = "sandboxId://soundeffect/chomp[1~3]_僵尸吃.ogg",
        ["受击音效"] = "sandboxId://soundeffect/splat[1~3].ogg"
    }),
    ["摇滚僵尸"] = MobType.New({
        ["怪物ID"] = "摇滚僵尸",
        ["显示名"] = "摇滚僵尸",
        ["描述"] = "喜欢重金属、十分有活力的僵尸。",
        ["尺寸"] = {
            0,
            0
        },
        ["模型"] = "僵尸/摇滚僵尸",
        ["状态机"] = "僵尸",
        ["是首领"] = true,
        ["基础等级"] = 26,
        ["属性公式"] = {
            ["生命"] = "(100+1.25^(LVL/650)+LVL*35+max(0,(LVL-1000)*50)+max(0,(LVL-3000)*150)+max(0,(LVL-6000)*450)+max(0,(LVL-10000)*1300)+max(0,(LVL-14000)*3900)+max(0,(LVL-11000)*8000)+max(0,(LVL-26000)*33000)+max(0,(LVL-32000)*99000)+max(0,(LVL-36000)*300000)+max(0,(LVL-40000)*900000)+max(0,(LVL-45000)*2500000)+max(0,(LVL-50000)*6500000))",
            ["攻击"] = "(100+1.25^(LVL/650)+LVL*35+max(0,(LVL-1000)*50)+max(0,(LVL-3000)*150)+max(0,(LVL-6000)*450)+max(0,(LVL-10000)*1300)+max(0,(LVL-14000)*3900)+max(0,(LVL-11000)*8000)+max(0,(LVL-26000)*33000)+max(0,(LVL-32000)*99000)+max(0,(LVL-36000)*300000)+max(0,(LVL-40000)*900000)+max(0,(LVL-45000)*2500000)+max(0,(LVL-50000)*6500000))/3",
            ["速度"] = "350"
        },
        ["图鉴击杀数"] = 0,
        ["图鉴完成奖励"] = nil,
        ["图鉴完成奖励数量"] = 0,
        ["显示血条"] = true,
        ["额外攻击距离"] = 100,
        ["攻击时点"] = 0.5,
        ["行为"] = {
            {
                ["脱战距离"] = 0,
                ["主动索敌"] = 10000,
                ["攻击时静止"] = true,
                ["类型"] = "近战攻击"
            },
            {
                ["距离"] = 500,
                ["保持在出生点附近"] = true,
                ["几率"] = 50,
                ["类型"] = "随机移动"
            },
            {
                ["类型"] = "静止"
            }
        },
        ["offset"] = nil,
        ["闲置音效"] = "sandboxId://soundeffect/groan[1~6]_僵尸呻吟.ogg",
        ["攻击音效"] = "sandboxId://soundeffect/chomp[1~3]_僵尸吃.ogg",
        ["受击音效"] = "sandboxId://soundeffect/splat[1~3].ogg"
    }),
    ["绅士僵尸"] = MobType.New({
        ["怪物ID"] = "绅士僵尸",
        ["显示名"] = "绅士僵尸",
        ["描述"] = "看起来彬彬有礼，实际上十分凶恶。",
        ["尺寸"] = {
            0,
            0
        },
        ["模型"] = "僵尸/绅士僵尸",
        ["状态机"] = "僵尸",
        ["是首领"] = true,
        ["基础等级"] = 26,
        ["属性公式"] = {
            ["生命"] = "(100+1.25^(LVL/650)+LVL*35+max(0,(LVL-1000)*50)+max(0,(LVL-3000)*150)+max(0,(LVL-6000)*450)+max(0,(LVL-10000)*1300)+max(0,(LVL-14000)*3900)+max(0,(LVL-11000)*8000)+max(0,(LVL-26000)*33000)+max(0,(LVL-32000)*99000)+max(0,(LVL-36000)*300000)+max(0,(LVL-40000)*900000)+max(0,(LVL-45000)*2500000)+max(0,(LVL-50000)*6500000))*2.5",
            ["攻击"] = "(100+1.25^(LVL/650)+LVL*35+max(0,(LVL-1000)*50)+max(0,(LVL-3000)*150)+max(0,(LVL-6000)*450)+max(0,(LVL-10000)*1300)+max(0,(LVL-14000)*3900)+max(0,(LVL-11000)*8000)+max(0,(LVL-26000)*33000)+max(0,(LVL-32000)*99000)+max(0,(LVL-36000)*300000)+max(0,(LVL-40000)*900000)+max(0,(LVL-45000)*2500000)+max(0,(LVL-50000)*6500000))/5.5",
            ["速度"] = "450"
        },
        ["图鉴击杀数"] = 0,
        ["图鉴完成奖励"] = nil,
        ["图鉴完成奖励数量"] = 0,
        ["显示血条"] = true,
        ["额外攻击距离"] = 100,
        ["攻击时点"] = 0.5,
        ["行为"] = {
            {
                ["脱战距离"] = 0,
                ["主动索敌"] = 10000,
                ["攻击时静止"] = true,
                ["类型"] = "近战攻击"
            },
            {
                ["距离"] = 500,
                ["保持在出生点附近"] = true,
                ["几率"] = 50,
                ["类型"] = "随机移动"
            },
            {
                ["类型"] = "静止"
            }
        },
        ["offset"] = nil,
        ["闲置音效"] = "sandboxId://soundeffect/groan[1~6]_僵尸呻吟.ogg",
        ["攻击音效"] = "sandboxId://soundeffect/chomp[1~3]_僵尸吃.ogg",
        ["受击音效"] = "sandboxId://soundeffect/splat[1~3].ogg"
    })
}loaded = true
end

---@param mobType string
---@return MobType
function MobTypeConfig.Get(mobType)
    if not loaded then
        LoadConfig()
    end
    return MobTypeConfig.config[mobType]
end

---@return MobType[]
function MobTypeConfig.GetAll()
    if not loaded then
        LoadConfig()
    end
    return MobTypeConfig.config
end
return MobTypeConfig
