local MainStorage = game:GetService('MainStorage')
local gg                = require(MainStorage.code.common.MGlobal)    ---@type gg
local Modifiers = require(MainStorage.code.common.config_type.modifier.Modifiers) ---@type Modifiers


---@class NpcData
---@field 名字 string
---@field 场景 string
---@field 节点 string
---@field 互动条件 table
---@field 互动指令 string[]

--- NPC配置文件
---@class NpcConfig
local NpcConfig = {}
local loaded = false

local function LoadConfig()
    NpcConfig.config ={
    ["戴夫商店"] = {
        ["名字"] = "戴夫商店",
        ["显示名"] = " ",
        ["场景"] = "g0",
        ["节点名"] = "戴夫商店",
        ["互动指令"] = {
            [[viewUI {"界面ID":"道具"} ]],
            [[graphic {"特效":[{"_type":"SoundGraphic","声音资源":"sandboxId://soundeffect/crazydaveshort1_人物音效_外币巴布.ogg","绑定实体":false,"响度":1.0,"音调":1.0,"距离":[600,6000],"仅播放给相关者":true,"目标":"自己","目标场景名":"","延迟":0.0,"持续时间":1.0,"重复次数":1,"重复延迟":0.0}]} ]]
        },
        ["额外互动距离"] = {
            100,
            0,
            200
        },
        ["看向附近玩家"] = false,
        ["名字尺寸"] = 1
    },
    ["戴夫商店2"] = {
        ["名字"] = "戴夫商店2",
        ["显示名"] = " ",
        ["场景"] = "g0",
        ["节点名"] = "戴夫商店2",
        ["实体节点变量修改"] = {
            ["Visible"] = {
                ["变量名"] = "Visible",
                ["变量类型"] = "真假",
                ["值的条件"] = Modifiers.New({
                    {
                        ["目标"] = "自己",
                        ["条件类型"] = "VariableCondition",
                        ["条件"] = {
                            ["名字"] = "level",
                            ["最小值"] = 0,
                            ["最大值"] = 100,
                            ["最小"] = "100",
                            ["最大"] = "X"
                        },
                        ["动作"] = "必须"
                    }
                })
            }
        },
        ["互动指令"] = {
            [[viewUI {"界面ID":"道具"} ]],
            [[graphic {"特效":[{"_type":"SoundGraphic","声音资源":"sandboxId://soundeffect/crazydaveshort1_人物音效_外币巴布.ogg","绑定实体":false,"响度":1.0,"音调":1.0,"距离":[600,6000],"仅播放给相关者":true,"目标":"自己","目标场景名":"","延迟":0.0,"持续时间":1.0,"重复次数":1,"重复延迟":0.0}]} ]]
        },
        ["额外互动距离"] = {
            100,
            0,
            200
        },
        ["看向附近玩家"] = false,
        ["名字尺寸"] = 1
    },
    ["戴夫商店3"] = {
        ["名字"] = "戴夫商店3",
        ["显示名"] = " ",
        ["场景"] = "g0",
        ["节点名"] = "戴夫商店3",
        ["实体节点变量修改"] = {
            ["Visible"] = {
                ["变量名"] = "Visible",
                ["变量类型"] = "真假",
                ["值的条件"] = Modifiers.New({
                    {
                        ["目标"] = "自己",
                        ["条件类型"] = "VariableCondition",
                        ["条件"] = {
                            ["名字"] = "level",
                            ["最小值"] = 0,
                            ["最大值"] = 100,
                            ["最小"] = "100",
                            ["最大"] = "X"
                        },
                        ["动作"] = "必须"
                    }
                })
            }
        },
        ["互动指令"] = {
            [[viewUI {"界面ID":"道具"} ]],
            [[graphic {"特效":[{"_type":"SoundGraphic","声音资源":"sandboxId://soundeffect/crazydaveshort1_人物音效_外币巴布.ogg","绑定实体":false,"响度":1.0,"音调":1.0,"距离":[600,6000],"仅播放给相关者":true,"目标":"自己","目标场景名":"","延迟":0.0,"持续时间":1.0,"重复次数":1,"重复延迟":0.0}]} ]]
        },
        ["额外互动距离"] = {
            100,
            0,
            200
        },
        ["看向附近玩家"] = false,
        ["名字尺寸"] = 1
    },
    ["戴夫商店4"] = {
        ["名字"] = "戴夫商店4",
        ["显示名"] = " ",
        ["场景"] = "g0",
        ["节点名"] = "戴夫商店4",
        ["实体节点变量修改"] = {
            ["Visible"] = {
                ["变量名"] = "Visible",
                ["变量类型"] = "真假",
                ["值的条件"] = Modifiers.New({
                    {
                        ["目标"] = "自己",
                        ["条件类型"] = "VariableCondition",
                        ["条件"] = {
                            ["名字"] = "level",
                            ["最小值"] = 0,
                            ["最大值"] = 100,
                            ["最小"] = "100",
                            ["最大"] = "X"
                        },
                        ["动作"] = "必须"
                    }
                })
            }
        },
        ["互动指令"] = {
            [[viewUI {"界面ID":"道具"} ]],
            [[graphic {"特效":[{"_type":"SoundGraphic","声音资源":"sandboxId://soundeffect/crazydaveshort1_人物音效_外币巴布.ogg","绑定实体":false,"响度":1.0,"音调":1.0,"距离":[600,6000],"仅播放给相关者":true,"目标":"自己","目标场景名":"","延迟":0.0,"持续时间":1.0,"重复次数":1,"重复延迟":0.0}]} ]]
        },
        ["额外互动距离"] = {
            100,
            0,
            200
        },
        ["看向附近玩家"] = false,
        ["名字尺寸"] = 1
    },
    ["防御僵尸"] = {
        ["名字"] = "防御僵尸",
        ["显示名"] = " ",
        ["场景"] = "g0",
        ["节点名"] = "抵御僵尸",
        ["互动指令"] = {
            [[level {"操作":"进入","关卡":"1-1（新手点我）"} ]]
        },
        ["额外互动距离"] = {
            0,
            0,
            0
        },
        ["看向附近玩家"] = false,
        ["名字尺寸"] = 2
    },
    ["防御僵尸2"] = {
        ["名字"] = "防御僵尸2",
        ["显示名"] = " ",
        ["场景"] = "g0",
        ["节点名"] = "抵御僵尸2",
        ["互动指令"] = {
            [[level {"操作":"进入","关卡":"1-2（50级）"} ]]
        },
        ["额外互动距离"] = {
            0,
            0,
            0
        },
        ["看向附近玩家"] = false,
        ["名字尺寸"] = 2
    },
    ["防御僵尸3"] = {
        ["名字"] = "防御僵尸3",
        ["显示名"] = " ",
        ["场景"] = "g0",
        ["节点名"] = "抵御僵尸3",
        ["互动指令"] = {
            [[level {"操作":"进入","关卡":"1-3（2000级）"} ]]
        },
        ["额外互动距离"] = {
            0,
            0,
            0
        },
        ["看向附近玩家"] = false,
        ["名字尺寸"] = 2
    },
    ["防御僵尸4"] = {
        ["名字"] = "防御僵尸4",
        ["显示名"] = " ",
        ["场景"] = "g0",
        ["节点名"] = "抵御僵尸4",
        ["互动指令"] = {
            [[level {"操作":"进入","关卡":"1-4（20000级）"} ]]
        },
        ["额外互动距离"] = {
            0,
            0,
            0
        },
        ["看向附近玩家"] = false,
        ["名字尺寸"] = 2
    },
    ["抽卡机"] = {
        ["名字"] = "抽卡机",
        ["显示名"] = " ",
        ["场景"] = "g0",
        ["节点名"] = "抽卡机",
        ["实体节点变量修改"] = nil,
        ["互动指令"] = {
            [[viewUI {"界面ID":"抽卡页面"} ]]
        },
        ["额外互动距离"] = {
            100,
            0,
            200
        },
        ["看向附近玩家"] = false,
        ["名字尺寸"] = 1
    },
    ["抽卡机2"] = {
        ["名字"] = "抽卡机2",
        ["显示名"] = " ",
        ["场景"] = "g0",
        ["节点名"] = "抽卡机2",
        ["互动指令"] = {
            [[viewUI {"界面ID":"抽卡页面"} ]]
        },
        ["额外互动距离"] = {
            100,
            0,
            200
        },
        ["看向附近玩家"] = false,
        ["名字尺寸"] = 1
    },
    ["抽卡机3"] = {
        ["名字"] = "抽卡机3",
        ["显示名"] = " ",
        ["场景"] = "g0",
        ["节点名"] = "抽卡机3",
        ["互动指令"] = {
            [[viewUI {"界面ID":"抽卡页面"} ]]
        },
        ["额外互动距离"] = {
            100,
            0,
            200
        },
        ["看向附近玩家"] = false,
        ["名字尺寸"] = 1
    },
    ["抽卡机4"] = {
        ["名字"] = "抽卡机4",
        ["显示名"] = " ",
        ["场景"] = "g0",
        ["节点名"] = "抽卡机4",
        ["互动指令"] = {
            [[viewUI {"界面ID":"抽卡页面"} ]]
        },
        ["额外互动距离"] = {
            100,
            0,
            200
        },
        ["看向附近玩家"] = false,
        ["名字尺寸"] = 1
    },
    ["等级2万墙"] = {
        ["名字"] = "等级2万墙",
        ["显示名"] = " ",
        ["场景"] = "g0",
        ["节点名"] = "等级2万墙",
        ["实体节点变量修改"] = {
            ["Visible"] = {
                ["变量名"] = "Visible",
                ["变量类型"] = "真假",
                ["值的条件"] = Modifiers.New({
                    {
                        ["目标"] = "自己",
                        ["条件类型"] = "VariableCondition",
                        ["条件"] = {
                            ["名字"] = "level",
                            ["最小值"] = 0,
                            ["最大值"] = 100,
                            ["最小"] = "20000",
                            ["最大"] = "X"
                        },
                        ["动作"] = "拒绝"
                    }
                })
            },
            ["EnablePhysics"] = {
                ["变量名"] = "EnablePhysics",
                ["变量类型"] = "真假",
                ["值的条件"] = Modifiers.New({
                    {
                        ["目标"] = "自己",
                        ["条件类型"] = "VariableCondition",
                        ["条件"] = {
                            ["名字"] = "level",
                            ["最小值"] = 0,
                            ["最大值"] = 100,
                            ["最小"] = "20000",
                            ["最大"] = "X"
                        },
                        ["动作"] = "拒绝"
                    }
                })
            }
        },
        ["额外互动距离"] = {
            100,
            0,
            200
        },
        ["看向附近玩家"] = false,
        ["名字尺寸"] = 1
    },
    ["等级50墙"] = {
        ["名字"] = "等级50墙",
        ["显示名"] = " ",
        ["场景"] = "g0",
        ["节点名"] = "等级50墙",
        ["实体节点变量修改"] = {
            ["Visible"] = {
                ["变量名"] = "Visible",
                ["变量类型"] = "真假",
                ["值的条件"] = Modifiers.New({
                    {
                        ["目标"] = "自己",
                        ["条件类型"] = "VariableCondition",
                        ["条件"] = {
                            ["名字"] = "level",
                            ["最小值"] = 0,
                            ["最大值"] = 100,
                            ["最小"] = "50",
                            ["最大"] = "X"
                        },
                        ["动作"] = "拒绝"
                    }
                })
            },
            ["EnablePhysics"] = {
                ["变量名"] = "EnablePhysics",
                ["变量类型"] = "真假",
                ["值的条件"] = Modifiers.New({
                    {
                        ["目标"] = "自己",
                        ["条件类型"] = "VariableCondition",
                        ["条件"] = {
                            ["名字"] = "level",
                            ["最小值"] = 0,
                            ["最大值"] = 100,
                            ["最小"] = "50",
                            ["最大"] = "X"
                        },
                        ["动作"] = "拒绝"
                    }
                })
            }
        },
        ["额外互动距离"] = {
            100,
            0,
            200
        },
        ["看向附近玩家"] = false,
        ["名字尺寸"] = 1
    },
    ["等级2000墙"] = {
        ["名字"] = "等级2000墙",
        ["显示名"] = " ",
        ["场景"] = "g0",
        ["节点名"] = "等级2000墙",
        ["实体节点变量修改"] = {
            ["Visible"] = {
                ["变量名"] = "Visible",
                ["变量类型"] = "真假",
                ["值的条件"] = Modifiers.New({
                    {
                        ["目标"] = "自己",
                        ["条件类型"] = "VariableCondition",
                        ["条件"] = {
                            ["名字"] = "level",
                            ["最小值"] = 0,
                            ["最大值"] = 100,
                            ["最小"] = "2000",
                            ["最大"] = "X"
                        },
                        ["动作"] = "拒绝"
                    }
                })
            },
            ["EnablePhysics"] = {
                ["变量名"] = "EnablePhysics",
                ["变量类型"] = "真假",
                ["值的条件"] = Modifiers.New({
                    {
                        ["目标"] = "自己",
                        ["条件类型"] = "VariableCondition",
                        ["条件"] = {
                            ["名字"] = "level",
                            ["最小值"] = 0,
                            ["最大值"] = 100,
                            ["最小"] = "2000",
                            ["最大"] = "X"
                        },
                        ["动作"] = "拒绝"
                    }
                })
            }
        },
        ["额外互动距离"] = {
            100,
            0,
            200
        },
        ["看向附近玩家"] = false,
        ["名字尺寸"] = 1
    }
}loaded = true
end

---@param npcName string
---@return Npc
function NpcConfig.Get(npcName)
    if not loaded then
        LoadConfig()
    end
    return NpcConfig.config[npcName]
end

---@return Npc[]
function NpcConfig.GetAll()
    if not loaded then
        LoadConfig()
    end
    return NpcConfig.config
end
return NpcConfig
