local MainStorage = game:GetService('MainStorage')
local gg                = require(MainStorage.code.common.MGlobal)    ---@type gg
local ShopGood      = require(MainStorage.code.common.config_type.ShopGood)    ---@type ShopGood
local Modifiers = require(MainStorage.code.common.config_type.modifier.Modifiers) ---@type Modifiers

--- ShopGood配置文件
---@class ShopGoodConfig
local ShopGoodConfig = {}
local loaded = false

local function LoadConfig()
    ShopGoodConfig.config ={
    ["寒冰射手礼包"] = ShopGood.New({
        ["商品名"] = "寒冰射手礼包",
        ["商品描述"] = "购买立即获取寒冰射手主卡，400000阳光、8800金币、8能量豆。",
        ["价格"] = {
            ["varKey"] = "shop_寒冰射手礼包",
            ["广告模式"] = "不可看广告",
            ["广告次数"] = 0,
            ["价格类型"] = "水晶",
            ["价格数量"] = 980
        },
        ["迷你商品ID"] = 0,
        ["购买条件"] = Modifiers.New({
            {
                ["目标"] = "自己",
                ["条件类型"] = "VariableCondition",
                ["条件"] = {
                    ["名字"] = "寒冰射手礼包",
                    ["最小值"] = 0,
                    ["最大值"] = 0
                },
                ["动作"] = "必须"
            }
        }),
        ["每日重置免费次数"] = false,
        ["限购次数"] = 0,
        ["限时"] = false,
        ["获得物品"] = {
            ["寒冰射手"] = 1,
            ["阳光"] = 400000,
            ["金币"] = 8800,
            ["能量豆"] = 8
        },
        ["奖池"] = nil,
        ["图标复写"] = "sandboxId://textures/items/shop/寒冰射手礼包.png",
        ["图标数量复写"] = 1,
        ["热卖"] = false,
        ["限定"] = false
    }),
    ["小喷菇礼包"] = ShopGood.New({
        ["商品名"] = "小喷菇礼包",
        ["商品描述"] = "购买立即获取小喷菇主卡，400000阳光，8800金币，8能量豆。",
        ["价格"] = {
            ["varKey"] = "shop_小喷菇礼包",
            ["广告模式"] = "不可看广告",
            ["广告次数"] = 0,
            ["价格类型"] = "水晶",
            ["价格数量"] = 980
        },
        ["迷你商品ID"] = 0,
        ["购买条件"] = Modifiers.New({
            {
                ["目标"] = "自己",
                ["条件类型"] = "VariableCondition",
                ["条件"] = {
                    ["名字"] = "新手礼包",
                    ["最小值"] = 0,
                    ["最大值"] = 0
                },
                ["动作"] = "必须"
            }
        }),
        ["每日重置免费次数"] = false,
        ["限购次数"] = 0,
        ["限时"] = false,
        ["获得物品"] = {
            ["小喷菇"] = 1,
            ["阳光"] = 400000,
            ["金币"] = 8800,
            ["能量豆"] = 8
        },
        ["奖池"] = nil,
        ["图标复写"] = "sandboxId://textures/items/shop/小喷菇礼包.png",
        ["图标数量复写"] = 1,
        ["热卖"] = false,
        ["限定"] = false
    }),
    ["新手大礼包"] = ShopGood.New({
        ["商品名"] = "新手大礼包",
        ["商品描述"] = "首次充值专属福利，购买后立即获取实用SR副卡“菜问”，更包含30000阳光、1000金币与1能量豆。",
        ["价格"] = {
            ["varKey"] = "shop_新手大礼包",
            ["广告模式"] = "不可看广告",
            ["广告次数"] = 0,
            ["价格类型"] = "水晶",
            ["价格数量"] = 60
        },
        ["迷你商品ID"] = 0,
        ["购买条件"] = Modifiers.New({
            {
                ["目标"] = "自己",
                ["条件类型"] = "VariableCondition",
                ["条件"] = {
                    ["名字"] = "新手礼包",
                    ["最小值"] = 0,
                    ["最大值"] = 0
                },
                ["动作"] = "必须"
            }
        }),
        ["每日重置免费次数"] = false,
        ["限购次数"] = 0,
        ["限时"] = false,
        ["获得物品"] = {
            ["菜问"] = 1,
            ["阳光"] = 30000,
            ["金币"] = 1000,
            ["能量豆"] = 1
        },
        ["奖池"] = nil,
        ["图标复写"] = "sandboxId://textures/items/shop/首充礼包.png",
        ["图标数量复写"] = 0,
        ["热卖"] = true,
        ["限定"] = false
    }),
    ["新手进阶礼包"] = ShopGood.New({
        ["商品名"] = "新手进阶礼包",
        ["商品描述"] = "额外花费迷你币即可升级新手大礼包！购买即可获得菜问（用于升星），并获得180000阳光、4400金币、4颗能量豆。",
        ["价格"] = {
            ["varKey"] = "shop_新手进阶礼包",
            ["广告模式"] = "不可看广告",
            ["广告次数"] = 0,
            ["价格类型"] = "水晶",
            ["价格数量"] = 680
        },
        ["迷你商品ID"] = 0,
        ["购买条件"] = Modifiers.New({
            {
                ["目标"] = "自己",
                ["条件类型"] = "VariableCondition",
                ["条件"] = {
                    ["名字"] = "新手进阶礼包",
                    ["最小值"] = 0,
                    ["最大值"] = 0
                },
                ["动作"] = "必须"
            }
        }),
        ["每日重置免费次数"] = false,
        ["限购次数"] = 0,
        ["限时"] = false,
        ["获得物品"] = {
            ["菜问"] = 1,
            ["阳光"] = 180000,
            ["金币"] = 4400,
            ["能量豆"] = 4
        },
        ["奖池"] = nil,
        ["图标复写"] = "sandboxId://textures/items/shop/新手进阶礼包.png",
        ["图标数量复写"] = 1,
        ["热卖"] = true,
        ["限定"] = false
    }),
    ["水晶x60"] = ShopGood.New({
        ["商品名"] = "水晶x60",
        ["商品描述"] = "神奇的水晶，用于购买商城内的各种道具，以及抽取植物卡片",
        ["价格"] = {
            ["varKey"] = "shop_水晶x60",
            ["广告模式"] = "不可看广告",
            ["广告次数"] = 0,
            ["价格类型"] = "迷你币",
            ["价格数量"] = 60
        },
        ["迷你商品ID"] = 1,
        ["每日重置免费次数"] = false,
        ["限购次数"] = 0,
        ["限时"] = false,
        ["获得物品"] = {
            ["水晶"] = 60
        },
        ["奖池"] = nil,
        ["图标数量复写"] = 0,
        ["热卖"] = false,
        ["限定"] = false
    }),
    ["水晶x600"] = ShopGood.New({
        ["商品名"] = "水晶x600",
        ["商品描述"] = "神奇的水晶，用于购买商城内的各种道具，以及抽取植物卡片",
        ["价格"] = {
            ["varKey"] = "shop_水晶x600",
            ["广告模式"] = "不可看广告",
            ["广告次数"] = 0,
            ["价格类型"] = "迷你币",
            ["价格数量"] = 600
        },
        ["迷你商品ID"] = 2,
        ["每日重置免费次数"] = false,
        ["限购次数"] = 0,
        ["限时"] = false,
        ["获得物品"] = {
            ["水晶"] = 600
        },
        ["奖池"] = nil,
        ["图标数量复写"] = 0,
        ["热卖"] = false,
        ["限定"] = false
    }),
    ["副卡抽奖券"] = ShopGood.New({
        ["商品名"] = "副卡抽奖券",
        ["商品描述"] = "获得10张副卡抽奖券，参与抽奖，抽取心仪植物",
        ["价格"] = {
            ["varKey"] = "shop_副卡抽奖券",
            ["广告模式"] = "不可看广告",
            ["广告次数"] = 0,
            ["价格类型"] = "水晶",
            ["价格数量"] = 600
        },
        ["迷你商品ID"] = 0,
        ["每日重置免费次数"] = false,
        ["限购次数"] = 0,
        ["限时"] = false,
        ["获得物品"] = {
            ["副卡抽奖券"] = 10
        },
        ["奖池"] = nil,
        ["图标复写"] = "sandboxId://textures/items/shop/普通抽奖券.png",
        ["图标数量复写"] = 10,
        ["热卖"] = false,
        ["限定"] = false
    }),
    ["每周副卡抽奖券"] = ShopGood.New({
        ["商品名"] = "每周副卡抽奖券",
        ["商品描述"] = "获得副卡抽奖券10张，每周限购3次",
        ["价格"] = {
            ["varKey"] = "shop_每周副卡抽奖券",
            ["广告模式"] = "不可看广告",
            ["广告次数"] = 0,
            ["价格类型"] = "水晶",
            ["价格数量"] = 488
        },
        ["迷你商品ID"] = 0,
        ["购买条件"] = Modifiers.New({
            {
                ["目标"] = "自己",
                ["条件类型"] = "VariableCondition",
                ["条件"] = {
                    ["名字"] = "副卡抽奖券礼包周限",
                    ["最小值"] = 0,
                    ["最大值"] = 2
                },
                ["动作"] = "必须"
            }
        }),
        ["每日重置免费次数"] = false,
        ["限购次数"] = 0,
        ["限时"] = false,
        ["获得物品"] = {
            ["副卡抽奖券"] = 10
        },
        ["奖池"] = nil,
        ["图标复写"] = "sandboxId://textures/items/shop/普通抽奖券.png",
        ["图标数量复写"] = 10,
        ["热卖"] = false,
        ["限定"] = true
    }),
    ["每周限定抽奖券"] = ShopGood.New({
        ["商品名"] = "每周限定抽奖券",
        ["商品描述"] = "获得副卡抽奖券10张，每周限购3次",
        ["价格"] = {
            ["varKey"] = "shop_每周限定抽奖券",
            ["广告模式"] = "不可看广告",
            ["广告次数"] = 0,
            ["价格类型"] = "水晶",
            ["价格数量"] = 488
        },
        ["迷你商品ID"] = 0,
        ["购买条件"] = Modifiers.New({
            {
                ["目标"] = "自己",
                ["条件类型"] = "VariableCondition",
                ["条件"] = {
                    ["名字"] = "限定抽奖券礼包周限",
                    ["最小值"] = 0,
                    ["最大值"] = 2
                },
                ["动作"] = "必须"
            }
        }),
        ["每日重置免费次数"] = false,
        ["限购次数"] = 0,
        ["限时"] = false,
        ["获得物品"] = {
            ["限定抽奖券"] = 10
        },
        ["奖池"] = nil,
        ["图标复写"] = "sandboxId://textures/items/shop/限定抽奖券.png",
        ["图标数量复写"] = 10,
        ["热卖"] = false,
        ["限定"] = true
    }),
    ["每日副卡抽奖券"] = ShopGood.New({
        ["商品名"] = "每日副卡抽奖券",
        ["商品描述"] = "参与副卡抽奖，每日限购1次，观看广告即可获得",
        ["价格"] = {
            ["varKey"] = "daily_shop_每日副卡抽奖券",
            ["广告模式"] = "必须看广告",
            ["广告次数"] = 0,
            ["价格数量"] = 0
        },
        ["迷你商品ID"] = 0,
        ["每日重置免费次数"] = true,
        ["限购次数"] = 0,
        ["限时"] = false,
        ["获得物品"] = {
            ["副卡抽奖券"] = 1
        },
        ["奖池"] = nil,
        ["图标复写"] = "sandboxId://textures/items/抽奖券.png",
        ["图标数量复写"] = 1,
        ["热卖"] = false,
        ["限定"] = false
    }),
    ["每月副卡抽奖券"] = ShopGood.New({
        ["商品名"] = "每月副卡抽奖券",
        ["商品描述"] = "获得副卡抽奖券10张，每月限购3次",
        ["价格"] = {
            ["varKey"] = "shop_每月副卡抽奖券",
            ["广告模式"] = "不可看广告",
            ["广告次数"] = 0,
            ["价格类型"] = "水晶",
            ["价格数量"] = 428
        },
        ["迷你商品ID"] = 0,
        ["购买条件"] = Modifiers.New({
            {
                ["目标"] = "自己",
                ["条件类型"] = "VariableCondition",
                ["条件"] = {
                    ["名字"] = "副卡抽奖券礼包月限",
                    ["最小值"] = 0,
                    ["最大值"] = 2
                },
                ["动作"] = "必须"
            }
        }),
        ["每日重置免费次数"] = false,
        ["限购次数"] = 0,
        ["限时"] = false,
        ["获得物品"] = {
            ["副卡抽奖券"] = 10
        },
        ["奖池"] = nil,
        ["图标复写"] = "sandboxId://textures/items/shop/普通抽奖券.png",
        ["图标数量复写"] = 10,
        ["热卖"] = false,
        ["限定"] = true
    }),
    ["每月限定抽奖券"] = ShopGood.New({
        ["商品名"] = "每月限定抽奖券",
        ["商品描述"] = "获得副卡抽奖券10张，每月限购3次",
        ["价格"] = {
            ["varKey"] = "shop_每月限定抽奖券",
            ["广告模式"] = "不可看广告",
            ["广告次数"] = 0,
            ["价格类型"] = "水晶",
            ["价格数量"] = 428
        },
        ["迷你商品ID"] = 0,
        ["购买条件"] = Modifiers.New({
            {
                ["目标"] = "自己",
                ["条件类型"] = "VariableCondition",
                ["条件"] = {
                    ["名字"] = "限定抽奖券礼包月限",
                    ["最小值"] = 0,
                    ["最大值"] = 2
                },
                ["动作"] = "必须"
            }
        }),
        ["每日重置免费次数"] = false,
        ["限购次数"] = 0,
        ["限时"] = false,
        ["获得物品"] = {
            ["限定抽奖券"] = 10
        },
        ["奖池"] = nil,
        ["图标复写"] = "sandboxId://textures/items/shop/限定抽奖券.png",
        ["图标数量复写"] = 10,
        ["热卖"] = false,
        ["限定"] = true
    }),
    ["能量豆补给包"] = ShopGood.New({
        ["商品名"] = "能量豆补给包",
        ["商品描述"] = "补充10颗能量豆，每周限购2次",
        ["价格"] = {
            ["varKey"] = "shop_能量豆补给包",
            ["广告模式"] = "不可看广告",
            ["广告次数"] = 0,
            ["价格类型"] = "水晶",
            ["价格数量"] = 300
        },
        ["迷你商品ID"] = 0,
        ["购买条件"] = Modifiers.New({
            {
                ["目标"] = "自己",
                ["条件类型"] = "VariableCondition",
                ["条件"] = {
                    ["名字"] = "能量豆补给包",
                    ["最小值"] = 0,
                    ["最大值"] = 1
                },
                ["动作"] = "必须"
            }
        }),
        ["每日重置免费次数"] = false,
        ["限购次数"] = 0,
        ["限时"] = false,
        ["获得物品"] = {
            ["能量豆"] = 10
        },
        ["奖池"] = nil,
        ["图标复写"] = "sandboxId://textures/items/shop/能量豆.png",
        ["图标数量复写"] = 10,
        ["热卖"] = false,
        ["限定"] = true
    }),
    ["阳光加速包"] = ShopGood.New({
        ["商品名"] = "阳光加速包",
        ["商品描述"] = "获得8小时阳光",
        ["价格"] = {
            ["varKey"] = "shop_阳光加速包",
            ["广告模式"] = "不可看广告",
            ["广告次数"] = 0,
            ["价格类型"] = "水晶",
            ["价格数量"] = 100
        },
        ["迷你商品ID"] = 0,
        ["购买条件"] = Modifiers.New({
            {
                ["目标"] = "自己",
                ["条件类型"] = "VariableCondition",
                ["条件"] = {
                    ["名字"] = "阳光加速包",
                    ["最小值"] = 0,
                    ["最大值"] = 2
                },
                ["动作"] = "必须"
            }
        }),
        ["每日重置免费次数"] = false,
        ["限购次数"] = 0,
        ["限时"] = false,
        ["奖池"] = nil,
        ["图标复写"] = "sandboxId://textures/items/shop/阳光.png",
        ["图标数量复写"] = 1,
        ["热卖"] = false,
        ["限定"] = true
    }),
    ["限定抽奖券"] = ShopGood.New({
        ["商品名"] = "限定抽奖券",
        ["商品描述"] = "获得10张限定抽奖券，参与抽奖，抽取心仪植物",
        ["价格"] = {
            ["varKey"] = "shop_限定抽奖券",
            ["广告模式"] = "不可看广告",
            ["广告次数"] = 0,
            ["价格类型"] = "水晶",
            ["价格数量"] = 600
        },
        ["迷你商品ID"] = 0,
        ["每日重置免费次数"] = false,
        ["限购次数"] = 0,
        ["限时"] = false,
        ["获得物品"] = {
            ["限定抽奖券"] = 10
        },
        ["奖池"] = nil,
        ["图标复写"] = "sandboxId://textures/items/shop/限定抽奖券.png",
        ["图标数量复写"] = 10,
        ["热卖"] = false,
        ["限定"] = false
    }),
    ["基金卡"] = ShopGood.New({
        ["商品名"] = "基金卡",
        ["商品描述"] = [[◆立即领取 10万阳光+800金币
◆立即领取 10颗能量豆
◆立即领取 阳光加速包
◆每日领取 5万阳光+540金币+3张SR碎片 ]],
        ["价格"] = {
            ["varKey"] = "shop_基金卡",
            ["广告模式"] = "不可看广告",
            ["广告次数"] = 0,
            ["价格类型"] = "水晶",
            ["价格数量"] = 3000
        },
        ["迷你商品ID"] = 0,
        ["每日重置免费次数"] = false,
        ["限购次数"] = 0,
        ["限时"] = false,
        ["获得物品"] = {
            ["阳光"] = 100000,
            ["金币"] = 800,
            ["能量豆"] = 10
        },
        ["执行指令"] = {
            [[var {"变量名":"基金卡","值":"30"} ]],
            [[title {"信息":"已成功购买了30天基金卡！"} ]]
        },
        ["奖池"] = nil,
        ["图标数量复写"] = 0,
        ["热卖"] = false,
        ["限定"] = false
    }),
    ["特权卡"] = ShopGood.New({
        ["商品名"] = "特权卡",
        ["商品描述"] = [[◆立即领取 20万阳光+3千金币
◆每日领取 2颗能量豆
◆解锁特权 植物伤害增加20％
◆解锁特权 城墙生命增加20％
◆解锁特权 阳光获取增加150％
◆解锁特权 金币产出增加150％ ]],
        ["价格"] = {
            ["varKey"] = "shop_特权卡",
            ["广告模式"] = "不可看广告",
            ["广告次数"] = 0,
            ["价格类型"] = "水晶",
            ["价格数量"] = 3000
        },
        ["迷你商品ID"] = 0,
        ["每日重置免费次数"] = false,
        ["限购次数"] = 0,
        ["限时"] = false,
        ["获得物品"] = {
            ["阳光"] = 200000,
            ["金币"] = 3000
        },
        ["执行指令"] = {
            [[var {"变量名":"特权卡","值":"30"} ]],
            [[title {"信息":"已成功购买了30天特权卡！"} ]]
        },
        ["奖池"] = nil,
        ["图标数量复写"] = 0,
        ["热卖"] = false,
        ["限定"] = false
    })
}loaded = true
end

---@param ShopGoodName string
---@return ShopGood
function ShopGoodConfig.Get(ShopGoodName)
    if not loaded then
        LoadConfig()
    end
    return ShopGoodConfig.config[ShopGoodName]
end

---@return ShopGood[]
function ShopGoodConfig.GetAll()
    if not loaded then
        LoadConfig()
    end
    return ShopGoodConfig.config
end
return ShopGoodConfig
