local MainStorage = game:GetService('MainStorage')
local gg                = require(MainStorage.code.common.MGlobal)    ---@type gg
local Spell = require(MainStorage.code.server.spells.Spell) ---@type Spell
local Modifiers = require(MainStorage.code.common.config_type.modifier.Modifiers) ---@type Modifiers

--- 魔法配置文件
---@class SpellConfig
local SpellConfig = {}
local loaded = false

local function LoadConfig()
    SpellConfig.config ={
    ["丰收葵_阳光获取"] = Spell.Load({
        ["类型"] = "ItemSpell",
        ["物品类型"] = "阳光",
        ["基础数量"] = 15,
        ["基础倍率"] = 1,
        ["向附近广播获得物品"] = false,
        ["魔法名"] = "丰收葵_阳光获取",
        ["打印信息"] = false,
        ["显示在指令选单中"] = true,
        ["几率"] = 0,
        ["冷却"] = 0,
        ["各目标冷却"] = 0,
        ["基础威力"] = 1,
        ["释放给自己"] = false,
        ["延迟"] = 0,
        ["释放条件"] = Modifiers.New({
            {
                ["目标"] = "自己",
                ["条件类型"] = "ChanceCondition",
                ["条件"] = {
                    ["最小值"] = 100
                },
                ["动作"] = "威力乘以",
                ["数量"] = "1+[每秒收益_挂机]"
            }
        }),
        ["宽度倍率"] = 1,
        ["高度倍率"] = 1,
        ["尺寸倍率"] = 1,
        ["必须要目标"] = true
    }),
    ["向日葵_阳光获取"] = Spell.Load({
        ["类型"] = "ItemSpell",
        ["物品类型"] = "阳光",
        ["基础数量"] = 10,
        ["基础倍率"] = 1,
        ["向附近广播获得物品"] = false,
        ["魔法名"] = "向日葵_阳光获取",
        ["打印信息"] = false,
        ["显示在指令选单中"] = true,
        ["几率"] = 0,
        ["冷却"] = 0,
        ["各目标冷却"] = 0,
        ["基础威力"] = 1,
        ["释放给自己"] = false,
        ["延迟"] = 0,
        ["释放条件"] = Modifiers.New({
            {
                ["目标"] = "自己",
                ["条件类型"] = "ChanceCondition",
                ["条件"] = {
                    ["最小值"] = 100
                },
                ["动作"] = "威力乘以",
                ["数量"] = "1+[每秒收益_挂机]"
            }
        }),
        ["宽度倍率"] = 1,
        ["高度倍率"] = 1,
        ["尺寸倍率"] = 1,
        ["必须要目标"] = true
    }),
    ["大喷菇_dot"] = Spell.Load({
        ["类型"] = "DOTBuffSpell",
        ["基础伤害"] = 0,
        ["基础倍率"] = 1,
        ["属性增伤"] = {
            {
                ["属性类型"] = "攻击",
                ["倍率"] = 1,
                ["增加类型"] = "增加",
                ["乘以基础数值"] = false
            }
        },
        ["脉冲时间"] = 0,
        ["持续时间"] = 3,
        ["持续时间独立计算"] = false,
        ["重复释放刷新时间"] = true,
        ["生效次数"] = 0,
        ["最大层数"] = 0,
        ["无需更新"] = false,
        ["魔法名"] = "大喷菇_dot",
        ["打印信息"] = false,
        ["显示在指令选单中"] = true,
        ["几率"] = 0,
        ["冷却"] = 0,
        ["各目标冷却"] = 0,
        ["基础威力"] = 1,
        ["释放给自己"] = false,
        ["延迟"] = 0,
        ["宽度倍率"] = 1,
        ["高度倍率"] = 1,
        ["尺寸倍率"] = 1,
        ["必须要目标"] = true
    }),
    ["大喷菇_伤害"] = Spell.Load({
        ["类型"] = "PainSpell",
        ["基础伤害"] = 0,
        ["基础倍率"] = 1,
        ["元素类型"] = "无",
        ["属性增伤"] = {
            {
                ["属性类型"] = "攻击",
                ["倍率"] = 1.8,
                ["增加类型"] = "增加",
                ["乘以基础数值"] = false
            }
        },
        ["仅造成仇恨"] = false,
        ["魔法名"] = "大喷菇_伤害",
        ["打印信息"] = true,
        ["显示在指令选单中"] = true,
        ["几率"] = 0,
        ["冷却"] = 0,
        ["各目标冷却"] = 0,
        ["基础威力"] = 1,
        ["释放给自己"] = false,
        ["延迟"] = 0,
        ["宽度倍率"] = 1,
        ["高度倍率"] = 1,
        ["尺寸倍率"] = 1,
        ["必须要目标"] = true
    }),
    ["大喷菇_入口"] = Spell.Load({
        ["类型"] = "ProjectileSpell",
        ["飞弹模型"] = "蘑菇孢子",
        ["持续时间"] = 5,
        ["寻找目标"] = false,
        ["生成于自己位置"] = true,
        ["散射次数"] = 1,
        ["散射角度"] = 0,
        ["散射延迟"] = 0,
        ["初始角度修改"] = {
            0,
            0
        },
        ["发射位置偏移"] = {
            0,
            0,
            0
        },
        ["速度"] = 500,
        ["重力"] = 0,
        ["追踪目标速度"] = 0,
        ["穿过地形"] = false,
        ["可重复碰撞同一目标"] = false,
        ["对同一目标生效间隔"] = -1,
        ["生效次数"] = -1,
        ["魔法名"] = "大喷菇_入口",
        ["打印信息"] = false,
        ["显示在指令选单中"] = true,
        ["几率"] = 0,
        ["冷却"] = 0,
        ["各目标冷却"] = 0,
        ["基础威力"] = 1,
        ["释放给自己"] = false,
        ["延迟"] = 0,
        ["子魔法"] = {
            {
                ["魔法"] = "大喷菇_伤害"
            },
            {
                ["魔法"] = "大喷菇_dot"
            },
            {
                ["魔法"] = "减速BUFF",
                ["复写参数"] = {
                    {
                        ["objectName"] = "减速BUFF",
                        ["paramName"] = "持续时间",
                        ["value"] = 3
                    }
                }
            }
        },
        ["特效_前摇"] = {
            {
                ["_type"] = "CameraShakeGraphic",
                ["旋转"] = {
                    0,
                    0
                },
                ["位移"] = {
                    0,
                    2,
                    5
                },
                ["频率"] = 1,
                ["动画风格"] = "震荡",
                ["衰减风格"] = "反二次方",
                ["目标"] = "自己",
                ["目标场景名"] = "",
                ["延迟"] = 0,
                ["持续时间"] = 0.5,
                ["重复次数"] = 1,
                ["重复延迟"] = 0
            },
            {
                ["_type"] = "AnimationGraphic",
                ["播放动画"] = "attack",
                ["播放速度"] = 1,
                ["目标"] = "自己",
                ["目标场景名"] = "",
                ["延迟"] = 0,
                ["持续时间"] = 1,
                ["重复次数"] = 1,
                ["重复延迟"] = 0
            },
            {
                ["_type"] = "SoundGraphic",
                ["声音资源"] = "sandboxId://soundeffect/fume_毒气.ogg",
                ["绑定实体"] = false,
                ["响度"] = 1,
                ["音调"] = 1,
                ["距离"] = {
                    600,
                    6000
                },
                ["仅播放给相关者"] = false,
                ["目标"] = "自己",
                ["目标场景名"] = "",
                ["延迟"] = 0,
                ["持续时间"] = 1,
                ["重复次数"] = 1,
                ["重复延迟"] = 0
            }
        },
        ["宽度倍率"] = 1,
        ["高度倍率"] = 1,
        ["尺寸倍率"] = 1,
        ["必须要目标"] = false
    }),
    ["小喷菇_伤害"] = Spell.Load({
        ["类型"] = "PainSpell",
        ["基础伤害"] = 0,
        ["基础倍率"] = 1,
        ["元素类型"] = "无",
        ["属性增伤"] = {
            {
                ["属性类型"] = "攻击",
                ["倍率"] = 1.5,
                ["增加类型"] = "增加",
                ["乘以基础数值"] = false
            }
        },
        ["仅造成仇恨"] = false,
        ["魔法名"] = "小喷菇_伤害",
        ["打印信息"] = true,
        ["显示在指令选单中"] = true,
        ["几率"] = 0,
        ["冷却"] = 0,
        ["各目标冷却"] = 0,
        ["基础威力"] = 1,
        ["释放给自己"] = false,
        ["延迟"] = 0,
        ["宽度倍率"] = 1,
        ["高度倍率"] = 1,
        ["尺寸倍率"] = 1,
        ["必须要目标"] = true
    }),
    ["小喷菇_入口"] = Spell.Load({
        ["类型"] = "ProjectileSpell",
        ["飞弹模型"] = "蘑菇孢子",
        ["持续时间"] = 5,
        ["寻找目标"] = false,
        ["生成于自己位置"] = true,
        ["散射次数"] = 3,
        ["散射角度"] = 0,
        ["散射延迟"] = 0.1,
        ["初始角度修改"] = {
            0,
            0
        },
        ["发射位置偏移"] = {
            -0.89,
            32.445,
            -90.738
        },
        ["速度"] = 5000,
        ["重力"] = 0,
        ["追踪目标速度"] = 0,
        ["穿过地形"] = false,
        ["可重复碰撞同一目标"] = false,
        ["对同一目标生效间隔"] = -1,
        ["生效次数"] = 3,
        ["魔法名"] = "小喷菇_入口",
        ["打印信息"] = true,
        ["显示在指令选单中"] = true,
        ["几率"] = 0,
        ["冷却"] = 0.4,
        ["各目标冷却"] = 0,
        ["基础威力"] = 1,
        ["释放给自己"] = false,
        ["延迟"] = 0,
        ["子魔法"] = {
            {
                ["魔法"] = "小喷菇_伤害"
            }
        },
        ["特效_前摇"] = {
            {
                ["_type"] = "CameraShakeGraphic",
                ["旋转"] = {
                    0,
                    0
                },
                ["位移"] = {
                    0,
                    2,
                    5
                },
                ["频率"] = 1,
                ["动画风格"] = "震荡",
                ["衰减风格"] = "反二次方",
                ["目标"] = "自己",
                ["目标场景名"] = "",
                ["延迟"] = 0,
                ["持续时间"] = 0.5,
                ["重复次数"] = 1,
                ["重复延迟"] = 0
            }
        },
        ["特效_释放"] = {
            {
                ["_type"] = "AnimationGraphic",
                ["播放动画"] = "attack",
                ["播放速度"] = 1,
                ["目标"] = "自己",
                ["目标场景名"] = "",
                ["延迟"] = 0,
                ["持续时间"] = 0,
                ["重复次数"] = 1,
                ["重复延迟"] = 0
            },
            {
                ["_type"] = "ParticleGraphic",
                ["特效对象"] = "特效/开火/喷射_紫色",
                ["特效资产"] = "",
                ["绑定实体"] = false,
                ["绑定挂点"] = "",
                ["偏移"] = {
                    0,
                    0,
                    0
                },
                ["目标"] = "触发点",
                ["目标场景名"] = "",
                ["延迟"] = 0,
                ["持续时间"] = 1,
                ["重复次数"] = 1,
                ["重复延迟"] = 0
            },
            {
                ["_type"] = "SoundGraphic",
                ["声音资源"] = "sandboxId://soundeffect/puff水泡发射.ogg",
                ["绑定实体"] = false,
                ["响度"] = 1,
                ["音调"] = 1,
                ["距离"] = {
                    600,
                    6000
                },
                ["仅播放给相关者"] = false,
                ["目标"] = "自己",
                ["目标场景名"] = "",
                ["延迟"] = 0,
                ["持续时间"] = 1,
                ["重复次数"] = 1,
                ["重复延迟"] = 0
            },
            {
                ["_type"] = "SoundGraphic",
                ["声音资源"] = "sandboxId://soundeffect/kernelpult_豌豆击中.ogg",
                ["绑定实体"] = false,
                ["响度"] = 1,
                ["音调"] = 1,
                ["距离"] = {
                    600,
                    6000
                },
                ["仅播放给相关者"] = false,
                ["目标"] = "触发点",
                ["目标场景名"] = "",
                ["延迟"] = 0,
                ["持续时间"] = 1,
                ["重复次数"] = 1,
                ["重复延迟"] = 0
            }
        },
        ["宽度倍率"] = 1,
        ["高度倍率"] = 1,
        ["尺寸倍率"] = 1,
        ["必须要目标"] = false
    }),
    ["胆小菇_dot"] = Spell.Load({
        ["类型"] = "DOTBuffSpell",
        ["基础伤害"] = 0,
        ["基础倍率"] = 1,
        ["属性增伤"] = {
            {
                ["属性类型"] = "攻击",
                ["倍率"] = 0.5,
                ["增加类型"] = "增加",
                ["乘以基础数值"] = false
            }
        },
        ["脉冲时间"] = 0,
        ["持续时间"] = 3,
        ["持续时间独立计算"] = false,
        ["重复释放刷新时间"] = true,
        ["生效次数"] = 0,
        ["最大层数"] = 0,
        ["无需更新"] = false,
        ["魔法名"] = "胆小菇_dot",
        ["打印信息"] = false,
        ["显示在指令选单中"] = true,
        ["几率"] = 0,
        ["冷却"] = 0,
        ["各目标冷却"] = 0,
        ["基础威力"] = 1,
        ["释放给自己"] = false,
        ["延迟"] = 0,
        ["宽度倍率"] = 1,
        ["高度倍率"] = 1,
        ["尺寸倍率"] = 1,
        ["必须要目标"] = true
    }),
    ["胆小菇_伤害"] = Spell.Load({
        ["类型"] = "PainSpell",
        ["基础伤害"] = 0,
        ["基础倍率"] = 1,
        ["元素类型"] = "无",
        ["属性增伤"] = {
            {
                ["属性类型"] = "攻击",
                ["倍率"] = 1.8,
                ["增加类型"] = "增加",
                ["乘以基础数值"] = false
            }
        },
        ["仅造成仇恨"] = false,
        ["魔法名"] = "胆小菇_伤害",
        ["打印信息"] = true,
        ["显示在指令选单中"] = true,
        ["几率"] = 0,
        ["冷却"] = 0,
        ["各目标冷却"] = 0,
        ["基础威力"] = 1,
        ["释放给自己"] = false,
        ["延迟"] = 0,
        ["宽度倍率"] = 1,
        ["高度倍率"] = 1,
        ["尺寸倍率"] = 1,
        ["必须要目标"] = true
    }),
    ["胆小菇_入口"] = Spell.Load({
        ["类型"] = "ProjectileSpell",
        ["飞弹模型"] = "蘑菇孢子",
        ["持续时间"] = 5,
        ["寻找目标"] = false,
        ["生成于自己位置"] = true,
        ["散射次数"] = 5,
        ["散射角度"] = 0,
        ["散射延迟"] = 0.1,
        ["初始角度修改"] = {
            0,
            0
        },
        ["发射位置偏移"] = {
            -12.763,
            94.783,
            -92.344
        },
        ["速度"] = 5000,
        ["重力"] = 0,
        ["追踪目标速度"] = 0,
        ["穿过地形"] = false,
        ["可重复碰撞同一目标"] = false,
        ["对同一目标生效间隔"] = -1,
        ["生效次数"] = 3,
        ["魔法名"] = "胆小菇_入口",
        ["打印信息"] = true,
        ["显示在指令选单中"] = true,
        ["几率"] = 0,
        ["冷却"] = 0.4,
        ["各目标冷却"] = 0,
        ["基础威力"] = 1,
        ["释放给自己"] = false,
        ["延迟"] = 0,
        ["子魔法"] = {
            {
                ["魔法"] = "胆小菇_伤害"
            },
            {
                ["魔法"] = "胆小菇_dot"
            }
        },
        ["特效_前摇"] = {
            {
                ["_type"] = "CameraShakeGraphic",
                ["旋转"] = {
                    0,
                    0
                },
                ["位移"] = {
                    0,
                    2,
                    5
                },
                ["频率"] = 1,
                ["动画风格"] = "震荡",
                ["衰减风格"] = "反二次方",
                ["目标"] = "自己",
                ["目标场景名"] = "",
                ["延迟"] = 0,
                ["持续时间"] = 0.5,
                ["重复次数"] = 1,
                ["重复延迟"] = 0
            }
        },
        ["特效_释放"] = {
            {
                ["_type"] = "AnimationGraphic",
                ["播放动画"] = "attack",
                ["播放速度"] = 1,
                ["目标"] = "自己",
                ["目标场景名"] = "",
                ["延迟"] = 0,
                ["持续时间"] = 1,
                ["重复次数"] = 1,
                ["重复延迟"] = 0
            },
            {
                ["_type"] = "ParticleGraphic",
                ["特效对象"] = "特效/开火/喷射_紫色",
                ["特效资产"] = "",
                ["绑定实体"] = false,
                ["绑定挂点"] = "",
                ["偏移"] = {
                    0,
                    0,
                    0
                },
                ["目标"] = "触发点",
                ["目标场景名"] = "",
                ["延迟"] = 0,
                ["持续时间"] = 1,
                ["重复次数"] = 1,
                ["重复延迟"] = 0
            },
            {
                ["_type"] = "SoundGraphic",
                ["声音资源"] = "sandboxId://soundeffect/puff水泡发射.ogg",
                ["绑定实体"] = false,
                ["响度"] = 1,
                ["音调"] = 1,
                ["距离"] = {
                    600,
                    6000
                },
                ["仅播放给相关者"] = false,
                ["目标"] = "自己",
                ["目标场景名"] = "",
                ["延迟"] = 0,
                ["持续时间"] = 1,
                ["重复次数"] = 1,
                ["重复延迟"] = 0
            },
            {
                ["_type"] = "SoundGraphic",
                ["声音资源"] = "sandboxId://soundeffect/kernelpult_豌豆击中.ogg",
                ["绑定实体"] = false,
                ["响度"] = 1,
                ["音调"] = 1,
                ["距离"] = {
                    600,
                    6000
                },
                ["仅播放给相关者"] = false,
                ["目标"] = "触发点",
                ["目标场景名"] = "",
                ["延迟"] = 0,
                ["持续时间"] = 1,
                ["重复次数"] = 1,
                ["重复延迟"] = 0
            }
        },
        ["宽度倍率"] = 1,
        ["高度倍率"] = 1,
        ["尺寸倍率"] = 1,
        ["必须要目标"] = false
    }),
    ["寒冰射手-伤害"] = Spell.Load({
        ["类型"] = "PainSpell",
        ["基础伤害"] = 0,
        ["基础倍率"] = 1,
        ["元素类型"] = "无",
        ["属性增伤"] = {
            {
                ["属性类型"] = "攻击",
                ["倍率"] = 0.7,
                ["增加类型"] = "增加",
                ["乘以基础数值"] = false
            }
        },
        ["仅造成仇恨"] = false,
        ["魔法名"] = "寒冰射手-伤害",
        ["打印信息"] = false,
        ["显示在指令选单中"] = true,
        ["几率"] = 0,
        ["冷却"] = 0,
        ["各目标冷却"] = 0,
        ["基础威力"] = 1,
        ["释放给自己"] = false,
        ["延迟"] = 0,
        ["宽度倍率"] = 1,
        ["高度倍率"] = 1,
        ["尺寸倍率"] = 1,
        ["必须要目标"] = true
    }),
    ["寒冰射手_入口"] = Spell.Load({
        ["类型"] = "ProjectileSpell",
        ["飞弹模型"] = "冰豌豆",
        ["持续时间"] = 5,
        ["寻找目标"] = false,
        ["生成于自己位置"] = true,
        ["散射次数"] = 2,
        ["散射角度"] = 0,
        ["散射延迟"] = 0.25,
        ["初始角度修改"] = {
            0,
            0
        },
        ["发射位置偏移"] = {
            0,
            108,
            -167
        },
        ["速度"] = 5000,
        ["重力"] = 0,
        ["追踪目标速度"] = 0,
        ["穿过地形"] = false,
        ["可重复碰撞同一目标"] = false,
        ["对同一目标生效间隔"] = -1,
        ["生效次数"] = 1,
        ["魔法名"] = "寒冰射手_入口",
        ["打印信息"] = false,
        ["显示在指令选单中"] = true,
        ["几率"] = 0,
        ["冷却"] = 0.4,
        ["各目标冷却"] = 0,
        ["基础威力"] = 1,
        ["释放给自己"] = false,
        ["延迟"] = 0,
        ["子魔法"] = {
            {
                ["魔法"] = "寒冰射手-伤害"
            },
            {
                ["魔法"] = "减速BUFF"
            }
        },
        ["特效_前摇"] = {
            {
                ["_type"] = "CameraShakeGraphic",
                ["旋转"] = {
                    0,
                    0
                },
                ["位移"] = {
                    0,
                    2,
                    5
                },
                ["频率"] = 1,
                ["动画风格"] = "震荡",
                ["衰减风格"] = "反二次方",
                ["目标"] = "自己",
                ["目标场景名"] = "",
                ["延迟"] = 0,
                ["持续时间"] = 0.5,
                ["重复次数"] = 1,
                ["重复延迟"] = 0
            }
        },
        ["特效_释放"] = {
            {
                ["_type"] = "ParticleGraphic",
                ["特效对象"] = "特效/开火/寒冰射手_开火",
                ["特效资产"] = "",
                ["绑定实体"] = true,
                ["绑定挂点"] = "",
                ["偏移"] = {
                    0,
                    -2,
                    0
                },
                ["目标"] = "自己",
                ["目标场景名"] = "",
                ["延迟"] = 0,
                ["持续时间"] = 1,
                ["重复次数"] = 1,
                ["重复延迟"] = 0
            },
            {
                ["_type"] = "AnimationGraphic",
                ["播放动画"] = "attack",
                ["播放速度"] = 1,
                ["目标"] = "自己",
                ["目标场景名"] = "",
                ["延迟"] = 0,
                ["持续时间"] = 0,
                ["重复次数"] = 1,
                ["重复延迟"] = 0
            },
            {
                ["_type"] = "ParticleGraphic",
                ["特效对象"] = "特效/击中/溅射_蓝色_粒子水花散开",
                ["特效资产"] = "",
                ["绑定实体"] = false,
                ["绑定挂点"] = "",
                ["偏移"] = {
                    0,
                    0,
                    0
                },
                ["目标"] = "触发点",
                ["目标场景名"] = "",
                ["延迟"] = 0,
                ["持续时间"] = 1,
                ["重复次数"] = 1,
                ["重复延迟"] = 0
            },
            {
                ["_type"] = "SoundGraphic",
                ["声音资源"] = "sandboxId://soundeffect/limbs_pop四肢脱落_豌豆发射.ogg",
                ["绑定实体"] = false,
                ["响度"] = 1,
                ["音调"] = 1,
                ["距离"] = {
                    600,
                    6000
                },
                ["仅播放给相关者"] = false,
                ["目标"] = "自己",
                ["目标场景名"] = "",
                ["延迟"] = 0,
                ["持续时间"] = 1,
                ["重复次数"] = 1,
                ["重复延迟"] = 0
            },
            {
                ["_type"] = "SoundGraphic",
                ["声音资源"] = "sandboxId://soundeffect/splat3击中音效.ogg",
                ["绑定实体"] = false,
                ["响度"] = 1,
                ["音调"] = 1,
                ["距离"] = {
                    600,
                    6000
                },
                ["仅播放给相关者"] = false,
                ["目标"] = "触发点",
                ["目标场景名"] = "",
                ["延迟"] = 0,
                ["持续时间"] = 1,
                ["重复次数"] = 1,
                ["重复延迟"] = 0
            }
        },
        ["宽度倍率"] = 1,
        ["高度倍率"] = 1,
        ["尺寸倍率"] = 1,
        ["必须要目标"] = false
    }),
    ["寒冰加特林-伤害"] = Spell.Load({
        ["类型"] = "PainSpell",
        ["基础伤害"] = 0,
        ["基础倍率"] = 1,
        ["元素类型"] = "无",
        ["属性增伤"] = {
            {
                ["属性类型"] = "攻击",
                ["倍率"] = 0.75,
                ["增加类型"] = "增加",
                ["乘以基础数值"] = false
            }
        },
        ["仅造成仇恨"] = false,
        ["魔法名"] = "寒冰加特林-伤害",
        ["打印信息"] = true,
        ["显示在指令选单中"] = true,
        ["几率"] = 0,
        ["冷却"] = 0,
        ["各目标冷却"] = 0,
        ["基础威力"] = 1,
        ["释放给自己"] = false,
        ["延迟"] = 0,
        ["宽度倍率"] = 1,
        ["高度倍率"] = 1,
        ["尺寸倍率"] = 1,
        ["必须要目标"] = true
    }),
    ["寒冰加特林_dot"] = Spell.Load({
        ["类型"] = "DOTBuffSpell",
        ["基础伤害"] = 0,
        ["基础倍率"] = 1,
        ["属性增伤"] = {
            {
                ["属性类型"] = "攻击",
                ["倍率"] = 0.4,
                ["增加类型"] = "增加",
                ["乘以基础数值"] = false
            }
        },
        ["脉冲时间"] = 0,
        ["持续时间"] = 2,
        ["持续时间独立计算"] = false,
        ["重复释放刷新时间"] = true,
        ["生效次数"] = 0,
        ["最大层数"] = 0,
        ["无需更新"] = false,
        ["魔法名"] = "寒冰加特林_dot",
        ["打印信息"] = true,
        ["显示在指令选单中"] = true,
        ["几率"] = 0,
        ["冷却"] = 0,
        ["各目标冷却"] = 0,
        ["基础威力"] = 1,
        ["释放给自己"] = false,
        ["延迟"] = 0,
        ["宽度倍率"] = 1,
        ["高度倍率"] = 1,
        ["尺寸倍率"] = 1,
        ["必须要目标"] = true
    }),
    ["寒冰加特林_入口"] = Spell.Load({
        ["类型"] = "ProjectileSpell",
        ["飞弹模型"] = "冰豌豆",
        ["持续时间"] = 5,
        ["寻找目标"] = false,
        ["生成于自己位置"] = true,
        ["散射次数"] = 2,
        ["散射角度"] = 0,
        ["散射延迟"] = 0.2,
        ["初始角度修改"] = {
            0,
            0
        },
        ["发射位置偏移"] = {
            0,
            138,
            -167
        },
        ["速度"] = 5000,
        ["重力"] = 0,
        ["追踪目标速度"] = 0,
        ["穿过地形"] = false,
        ["可重复碰撞同一目标"] = false,
        ["对同一目标生效间隔"] = -1,
        ["生效次数"] = 2,
        ["魔法名"] = "寒冰加特林_入口",
        ["打印信息"] = true,
        ["显示在指令选单中"] = true,
        ["几率"] = 0,
        ["冷却"] = 0.4,
        ["各目标冷却"] = 0,
        ["基础威力"] = 1,
        ["释放给自己"] = false,
        ["延迟"] = 0,
        ["子魔法"] = {
            {
                ["魔法"] = "寒冰加特林-伤害"
            },
            {
                ["魔法"] = "减速BUFF",
                ["复写参数"] = {
                    {
                        ["objectName"] = "减速BUFF",
                        ["paramName"] = "持续时间",
                        ["value"] = 2
                    }
                }
            },
            {
                ["魔法"] = "冰冻BUFF",
                ["复写参数"] = {
                    {
                        ["objectName"] = "冰冻BUFF",
                        ["paramName"] = "几率",
                        ["value"] = 30
                    }
                }
            }
        },
        ["特效_前摇"] = {
            {
                ["_type"] = "CameraShakeGraphic",
                ["旋转"] = {
                    0,
                    0
                },
                ["位移"] = {
                    0,
                    2,
                    5
                },
                ["频率"] = 1,
                ["动画风格"] = "震荡",
                ["衰减风格"] = "反二次方",
                ["目标"] = "自己",
                ["目标场景名"] = "",
                ["延迟"] = 0,
                ["持续时间"] = 0.5,
                ["重复次数"] = 1,
                ["重复延迟"] = 0
            }
        },
        ["特效_释放"] = {
            {
                ["_type"] = "ParticleGraphic",
                ["特效对象"] = "特效/开火/寒冰加特林_开火",
                ["特效资产"] = "",
                ["绑定实体"] = true,
                ["绑定挂点"] = "",
                ["偏移"] = {
                    0,
                    -2,
                    0
                },
                ["目标"] = "自己",
                ["目标场景名"] = "",
                ["延迟"] = 0,
                ["持续时间"] = 1,
                ["重复次数"] = 1,
                ["重复延迟"] = 0
            },
            {
                ["_type"] = "AnimationGraphic",
                ["播放动画"] = "attack",
                ["播放速度"] = 1,
                ["目标"] = "自己",
                ["目标场景名"] = "",
                ["延迟"] = 0,
                ["持续时间"] = 0,
                ["重复次数"] = 1,
                ["重复延迟"] = 0
            },
            {
                ["_type"] = "ParticleGraphic",
                ["特效对象"] = "特效/击中/溅射_蓝色_粒子水花散开",
                ["特效资产"] = "",
                ["绑定实体"] = false,
                ["绑定挂点"] = "",
                ["偏移"] = {
                    0,
                    0,
                    0
                },
                ["目标"] = "触发点",
                ["目标场景名"] = "",
                ["延迟"] = 0,
                ["持续时间"] = 1,
                ["重复次数"] = 1,
                ["重复延迟"] = 0
            },
            {
                ["_type"] = "SoundGraphic",
                ["声音资源"] = "sandboxId://soundeffect/limbs_pop四肢脱落_豌豆发射.ogg",
                ["绑定实体"] = false,
                ["响度"] = 1,
                ["音调"] = 1,
                ["距离"] = {
                    600,
                    6000
                },
                ["仅播放给相关者"] = false,
                ["目标"] = "自己",
                ["目标场景名"] = "",
                ["延迟"] = 0,
                ["持续时间"] = 1,
                ["重复次数"] = 1,
                ["重复延迟"] = 0
            },
            {
                ["_type"] = "SoundGraphic",
                ["声音资源"] = "sandboxId://soundeffect/splat3击中音效.ogg",
                ["绑定实体"] = false,
                ["响度"] = 1,
                ["音调"] = 1,
                ["距离"] = {
                    600,
                    6000
                },
                ["仅播放给相关者"] = false,
                ["目标"] = "触发点",
                ["目标场景名"] = "",
                ["延迟"] = 0,
                ["持续时间"] = 1,
                ["重复次数"] = 1,
                ["重复延迟"] = 0
            }
        },
        ["宽度倍率"] = 1,
        ["高度倍率"] = 1,
        ["尺寸倍率"] = 1,
        ["必须要目标"] = false
    }),
    ["火焰豌豆-伤害"] = Spell.Load({
        ["类型"] = "PainSpell",
        ["基础伤害"] = 0,
        ["基础倍率"] = 1,
        ["元素类型"] = "无",
        ["属性增伤"] = {
            {
                ["属性类型"] = "攻击",
                ["倍率"] = 0.8,
                ["增加类型"] = "增加",
                ["乘以基础数值"] = false
            }
        },
        ["仅造成仇恨"] = false,
        ["魔法名"] = "火焰豌豆-伤害",
        ["打印信息"] = false,
        ["显示在指令选单中"] = true,
        ["几率"] = 0,
        ["冷却"] = 0,
        ["各目标冷却"] = 0,
        ["基础威力"] = 1,
        ["释放给自己"] = false,
        ["延迟"] = 0,
        ["宽度倍率"] = 1,
        ["高度倍率"] = 1,
        ["尺寸倍率"] = 1,
        ["必须要目标"] = true
    }),
    ["火焰豌豆_dot"] = Spell.Load({
        ["类型"] = "DOTBuffSpell",
        ["基础伤害"] = 0,
        ["基础倍率"] = 1,
        ["属性增伤"] = {
            {
                ["属性类型"] = "攻击",
                ["倍率"] = 0.4,
                ["增加类型"] = "增加",
                ["乘以基础数值"] = false
            }
        },
        ["脉冲时间"] = 0,
        ["持续时间"] = 2,
        ["持续时间独立计算"] = false,
        ["重复释放刷新时间"] = true,
        ["生效次数"] = 0,
        ["最大层数"] = 0,
        ["无需更新"] = false,
        ["魔法名"] = "火焰豌豆_dot",
        ["打印信息"] = false,
        ["显示在指令选单中"] = true,
        ["几率"] = 0,
        ["冷却"] = 0,
        ["各目标冷却"] = 0,
        ["基础威力"] = 1,
        ["释放给自己"] = false,
        ["延迟"] = 0,
        ["宽度倍率"] = 1,
        ["高度倍率"] = 1,
        ["尺寸倍率"] = 1,
        ["必须要目标"] = true
    }),
    ["火焰豌豆_入口"] = Spell.Load({
        ["类型"] = "ProjectileSpell",
        ["飞弹模型"] = "火焰豌豆",
        ["持续时间"] = 5,
        ["寻找目标"] = false,
        ["生成于自己位置"] = true,
        ["散射次数"] = 2,
        ["散射角度"] = 0,
        ["散射延迟"] = 0.2,
        ["初始角度修改"] = {
            0,
            0
        },
        ["发射位置偏移"] = {
            0,
            138,
            -167
        },
        ["速度"] = 5000,
        ["重力"] = 0,
        ["追踪目标速度"] = 0,
        ["穿过地形"] = false,
        ["可重复碰撞同一目标"] = false,
        ["对同一目标生效间隔"] = -1,
        ["生效次数"] = 1,
        ["魔法名"] = "火焰豌豆_入口",
        ["打印信息"] = false,
        ["显示在指令选单中"] = true,
        ["几率"] = 0,
        ["冷却"] = 0.3,
        ["各目标冷却"] = 0,
        ["基础威力"] = 1,
        ["释放给自己"] = false,
        ["延迟"] = 0,
        ["子魔法"] = {
            {
                ["魔法"] = "火焰豌豆_范围"
            }
        },
        ["特效_前摇"] = {
            {
                ["_type"] = "CameraShakeGraphic",
                ["旋转"] = {
                    0,
                    0
                },
                ["位移"] = {
                    0,
                    2,
                    5
                },
                ["频率"] = 1,
                ["动画风格"] = "震荡",
                ["衰减风格"] = "反二次方",
                ["目标"] = "自己",
                ["目标场景名"] = "",
                ["延迟"] = 0,
                ["持续时间"] = 0.5,
                ["重复次数"] = 1,
                ["重复延迟"] = 0
            }
        },
        ["特效_释放"] = {
            {
                ["_type"] = "ParticleGraphic",
                ["特效对象"] = "特效/开火/火焰射手_开火",
                ["特效资产"] = "",
                ["绑定实体"] = true,
                ["绑定挂点"] = "",
                ["偏移"] = {
                    0,
                    -2,
                    0
                },
                ["目标"] = "自己",
                ["目标场景名"] = "",
                ["延迟"] = 0,
                ["持续时间"] = 1,
                ["重复次数"] = 1,
                ["重复延迟"] = 0
            },
            {
                ["_type"] = "AnimationGraphic",
                ["播放动画"] = "attack",
                ["播放速度"] = 1,
                ["目标"] = "自己",
                ["目标场景名"] = "",
                ["延迟"] = 0,
                ["持续时间"] = 0,
                ["重复次数"] = 1,
                ["重复延迟"] = 0
            },
            {
                ["_type"] = "ParticleGraphic",
                ["特效对象"] = "特效/击中/爆炸_黄色_火球炸开",
                ["特效资产"] = "",
                ["绑定实体"] = false,
                ["绑定挂点"] = "",
                ["偏移"] = {
                    0,
                    0,
                    0
                },
                ["目标"] = "触发点",
                ["目标场景名"] = "",
                ["延迟"] = 0,
                ["持续时间"] = 1,
                ["重复次数"] = 1,
                ["重复延迟"] = 0
            },
            {
                ["_type"] = "SoundGraphic",
                ["声音资源"] = "sandboxId://soundeffect/limbs_pop四肢脱落_豌豆发射.ogg",
                ["绑定实体"] = false,
                ["响度"] = 1,
                ["音调"] = 1,
                ["距离"] = {
                    600,
                    6000
                },
                ["仅播放给相关者"] = false,
                ["目标"] = "自己",
                ["目标场景名"] = "",
                ["延迟"] = 0,
                ["持续时间"] = 1,
                ["重复次数"] = 1,
                ["重复延迟"] = 0
            },
            {
                ["_type"] = "SoundGraphic",
                ["声音资源"] = "sandboxId://soundeffect/ignite2_燃烧植物击中.ogg",
                ["绑定实体"] = false,
                ["响度"] = 1,
                ["音调"] = 1,
                ["距离"] = {
                    600,
                    6000
                },
                ["仅播放给相关者"] = false,
                ["目标"] = "自己",
                ["目标场景名"] = "",
                ["延迟"] = 0,
                ["持续时间"] = 1,
                ["重复次数"] = 1,
                ["重复延迟"] = 0
            }
        },
        ["宽度倍率"] = 1,
        ["高度倍率"] = 1,
        ["尺寸倍率"] = 1,
        ["必须要目标"] = false
    }),
    ["火焰豌豆_范围"] = Spell.Load({
        ["类型"] = "AOESpell",
        ["持续时间"] = 0,
        ["范围形状"] = "圆形",
        ["圆形半径"] = 400,
        ["偏移"] = {
            0,
            0,
            0
        },
        ["_previewLocation"] = nil,
        ["魔法名"] = "火焰豌豆_范围",
        ["打印信息"] = false,
        ["显示在指令选单中"] = true,
        ["几率"] = 0,
        ["冷却"] = 0,
        ["各目标冷却"] = 0,
        ["基础威力"] = 1,
        ["释放给自己"] = false,
        ["延迟"] = 0,
        ["子魔法"] = {
            {
                ["魔法"] = "火焰豌豆-伤害"
            },
            {
                ["魔法"] = "火焰豌豆_dot"
            }
        },
        ["宽度倍率"] = 1,
        ["高度倍率"] = 1,
        ["尺寸倍率"] = 1,
        ["必须要目标"] = true
    }),
    ["三头豌豆-伤害"] = Spell.Load({
        ["类型"] = "PainSpell",
        ["基础伤害"] = 0,
        ["基础倍率"] = 1,
        ["元素类型"] = "无",
        ["属性增伤"] = {
            {
                ["属性类型"] = "攻击",
                ["倍率"] = 0.7,
                ["增加类型"] = "增加",
                ["乘以基础数值"] = false
            }
        },
        ["仅造成仇恨"] = false,
        ["魔法名"] = "三头豌豆-伤害",
        ["打印信息"] = false,
        ["显示在指令选单中"] = true,
        ["几率"] = 0,
        ["冷却"] = 0,
        ["各目标冷却"] = 0,
        ["基础威力"] = 1,
        ["释放给自己"] = false,
        ["延迟"] = 0,
        ["释放条件"] = Modifiers.New({
            {
                ["目标"] = "自己",
                ["条件类型"] = "ChanceCondition",
                ["条件"] = {
                    ["最小值"] = 20
                },
                ["动作"] = "威力乘以",
                ["数量"] = "2"
            }
        }),
        ["宽度倍率"] = 1,
        ["高度倍率"] = 1,
        ["尺寸倍率"] = 1,
        ["必须要目标"] = true
    }),
    ["三头豌豆_入口"] = Spell.Load({
        ["类型"] = "ProjectileSpell",
        ["飞弹模型"] = "豌豆",
        ["持续时间"] = 5,
        ["寻找目标"] = false,
        ["生成于自己位置"] = true,
        ["散射次数"] = 3,
        ["散射角度"] = 10,
        ["散射延迟"] = 0,
        ["初始角度修改"] = {
            0,
            0
        },
        ["发射位置偏移"] = {
            0,
            142,
            -150
        },
        ["速度"] = 5000,
        ["重力"] = 0,
        ["追踪目标速度"] = 0,
        ["穿过地形"] = false,
        ["可重复碰撞同一目标"] = false,
        ["对同一目标生效间隔"] = -1,
        ["生效次数"] = 3,
        ["魔法名"] = "三头豌豆_入口",
        ["打印信息"] = false,
        ["显示在指令选单中"] = true,
        ["几率"] = 0,
        ["冷却"] = 0.8,
        ["各目标冷却"] = 0,
        ["基础威力"] = 1,
        ["释放给自己"] = false,
        ["延迟"] = 0,
        ["子魔法"] = {
            {
                ["魔法"] = "三头豌豆-伤害"
            }
        },
        ["特效_前摇"] = {
            {
                ["_type"] = "CameraShakeGraphic",
                ["旋转"] = {
                    0,
                    0
                },
                ["位移"] = {
                    0,
                    1,
                    0
                },
                ["频率"] = 0.05,
                ["动画风格"] = "震荡",
                ["衰减风格"] = "线性",
                ["目标"] = "自己",
                ["目标场景名"] = "",
                ["延迟"] = 0,
                ["持续时间"] = 0,
                ["重复次数"] = 1,
                ["重复延迟"] = 0
            }
        },
        ["特效_释放"] = {
            {
                ["_type"] = "ParticleGraphic",
                ["特效对象"] = "特效/开火/三头豌豆_开火",
                ["特效资产"] = "",
                ["绑定实体"] = true,
                ["绑定挂点"] = "",
                ["偏移"] = {
                    0,
                    -2,
                    0
                },
                ["目标"] = "自己",
                ["目标场景名"] = "",
                ["延迟"] = 0,
                ["持续时间"] = 1,
                ["重复次数"] = 1,
                ["重复延迟"] = 0
            },
            {
                ["_type"] = "AnimationGraphic",
                ["播放动画"] = "attack",
                ["播放速度"] = 1,
                ["目标"] = "自己",
                ["目标场景名"] = "",
                ["延迟"] = 0,
                ["持续时间"] = 0,
                ["重复次数"] = 1,
                ["重复延迟"] = 0
            },
            {
                ["_type"] = "ParticleGraphic",
                ["特效对象"] = "特效/击中/爆炸_绿色",
                ["特效资产"] = "",
                ["绑定实体"] = false,
                ["绑定挂点"] = "",
                ["偏移"] = {
                    0,
                    0,
                    0
                },
                ["目标"] = "触发点",
                ["目标场景名"] = "",
                ["延迟"] = 0,
                ["持续时间"] = 1,
                ["重复次数"] = 1,
                ["重复延迟"] = 0
            },
            {
                ["_type"] = "SoundGraphic",
                ["声音资源"] = "sandboxId://soundeffect/limbs_pop四肢脱落_豌豆发射.ogg",
                ["绑定实体"] = false,
                ["响度"] = 1,
                ["音调"] = 1,
                ["距离"] = {
                    600,
                    6000
                },
                ["仅播放给相关者"] = false,
                ["目标"] = "自己",
                ["目标场景名"] = "",
                ["延迟"] = 0,
                ["持续时间"] = 1,
                ["重复次数"] = 1,
                ["重复延迟"] = 0
            },
            {
                ["_type"] = "SoundGraphic",
                ["声音资源"] = "sandboxId://soundeffect/kernelpult2_豌豆击中2.ogg",
                ["绑定实体"] = false,
                ["响度"] = 1,
                ["音调"] = 1,
                ["距离"] = {
                    600,
                    6000
                },
                ["仅播放给相关者"] = false,
                ["目标"] = "触发点",
                ["目标场景名"] = "",
                ["延迟"] = 0,
                ["持续时间"] = 1,
                ["重复次数"] = 1,
                ["重复延迟"] = 0
            }
        },
        ["宽度倍率"] = 1,
        ["高度倍率"] = 1,
        ["尺寸倍率"] = 1,
        ["必须要目标"] = false
    }),
    ["高速射手-伤害"] = Spell.Load({
        ["类型"] = "PainSpell",
        ["基础伤害"] = 0,
        ["基础倍率"] = 1,
        ["元素类型"] = "无",
        ["属性增伤"] = {
            {
                ["属性类型"] = "攻击",
                ["倍率"] = 0.6,
                ["增加类型"] = "增加",
                ["乘以基础数值"] = false
            }
        },
        ["仅造成仇恨"] = false,
        ["魔法名"] = "高速射手-伤害",
        ["打印信息"] = false,
        ["显示在指令选单中"] = true,
        ["几率"] = 0,
        ["冷却"] = 0,
        ["各目标冷却"] = 0,
        ["基础威力"] = 1,
        ["释放给自己"] = false,
        ["延迟"] = 0,
        ["宽度倍率"] = 1,
        ["高度倍率"] = 1,
        ["尺寸倍率"] = 1,
        ["必须要目标"] = true
    }),
    ["高速射手_入口"] = Spell.Load({
        ["类型"] = "ProjectileSpell",
        ["飞弹模型"] = "豌豆",
        ["持续时间"] = 5,
        ["寻找目标"] = false,
        ["生成于自己位置"] = true,
        ["散射次数"] = 2,
        ["散射角度"] = 0,
        ["散射延迟"] = 0,
        ["初始角度修改"] = {
            0,
            0
        },
        ["发射位置偏移"] = {
            0,
            138,
            -167
        },
        ["速度"] = 5000,
        ["重力"] = 0,
        ["追踪目标速度"] = 0,
        ["穿过地形"] = false,
        ["可重复碰撞同一目标"] = false,
        ["对同一目标生效间隔"] = -1,
        ["生效次数"] = 2,
        ["魔法名"] = "高速射手_入口",
        ["打印信息"] = false,
        ["显示在指令选单中"] = true,
        ["几率"] = 0,
        ["冷却"] = 0.8,
        ["各目标冷却"] = 0,
        ["基础威力"] = 1,
        ["释放给自己"] = false,
        ["延迟"] = 0,
        ["子魔法"] = {
            {
                ["魔法"] = "高速射手-伤害"
            }
        },
        ["特效_前摇"] = {
            {
                ["_type"] = "CameraShakeGraphic",
                ["旋转"] = {
                    0,
                    0
                },
                ["位移"] = {
                    0,
                    2,
                    5
                },
                ["频率"] = 1,
                ["动画风格"] = "震荡",
                ["衰减风格"] = "反二次方",
                ["目标"] = "自己",
                ["目标场景名"] = "",
                ["延迟"] = 0,
                ["持续时间"] = 0.5,
                ["重复次数"] = 1,
                ["重复延迟"] = 0
            }
        },
        ["特效_释放"] = {
            {
                ["_type"] = "ParticleGraphic",
                ["特效对象"] = "特效/开火/高速射手_开火",
                ["特效资产"] = "",
                ["绑定实体"] = true,
                ["绑定挂点"] = "",
                ["偏移"] = {
                    0,
                    -2,
                    0
                },
                ["目标"] = "自己",
                ["目标场景名"] = "",
                ["延迟"] = 0,
                ["持续时间"] = 0,
                ["重复次数"] = 1,
                ["重复延迟"] = 0
            },
            {
                ["_type"] = "AnimationGraphic",
                ["播放动画"] = "attack",
                ["播放速度"] = 1,
                ["目标"] = "自己",
                ["目标场景名"] = "",
                ["延迟"] = 0,
                ["持续时间"] = 0,
                ["重复次数"] = 1,
                ["重复延迟"] = 0
            },
            {
                ["_type"] = "ParticleGraphic",
                ["特效对象"] = "特效/击中/爆炸_绿色",
                ["特效资产"] = "",
                ["绑定实体"] = false,
                ["绑定挂点"] = "",
                ["偏移"] = {
                    0,
                    0,
                    0
                },
                ["目标"] = "触发点",
                ["目标场景名"] = "",
                ["延迟"] = 0,
                ["持续时间"] = 1,
                ["重复次数"] = 1,
                ["重复延迟"] = 0
            },
            {
                ["_type"] = "SoundGraphic",
                ["声音资源"] = "sandboxId://soundeffect/limbs_pop四肢脱落_豌豆发射.ogg",
                ["绑定实体"] = false,
                ["响度"] = 1,
                ["音调"] = 1,
                ["距离"] = {
                    600,
                    6000
                },
                ["仅播放给相关者"] = false,
                ["目标"] = "自己",
                ["目标场景名"] = "",
                ["延迟"] = 0,
                ["持续时间"] = 1,
                ["重复次数"] = 1,
                ["重复延迟"] = 0
            },
            {
                ["_type"] = "SoundGraphic",
                ["声音资源"] = "sandboxId://soundeffect/kernelpult2_豌豆击中2.ogg",
                ["绑定实体"] = false,
                ["响度"] = 1,
                ["音调"] = 1,
                ["距离"] = {
                    600,
                    6000
                },
                ["仅播放给相关者"] = false,
                ["目标"] = "触发点",
                ["目标场景名"] = "",
                ["延迟"] = 0,
                ["持续时间"] = 1,
                ["重复次数"] = 1,
                ["重复延迟"] = 0
            }
        },
        ["宽度倍率"] = 1,
        ["高度倍率"] = 1,
        ["尺寸倍率"] = 1,
        ["必须要目标"] = false
    }),
    ["高速加特林-伤害"] = Spell.Load({
        ["类型"] = "PainSpell",
        ["基础伤害"] = 0,
        ["基础倍率"] = 1,
        ["元素类型"] = "无",
        ["属性增伤"] = {
            {
                ["属性类型"] = "攻击",
                ["倍率"] = 0.65,
                ["增加类型"] = "增加",
                ["乘以基础数值"] = false
            }
        },
        ["仅造成仇恨"] = false,
        ["魔法名"] = "高速加特林-伤害",
        ["打印信息"] = false,
        ["显示在指令选单中"] = true,
        ["几率"] = 0,
        ["冷却"] = 0,
        ["各目标冷却"] = 0,
        ["基础威力"] = 1,
        ["释放给自己"] = false,
        ["延迟"] = 0,
        ["释放条件"] = Modifiers.New({
            {
                ["目标"] = "自己",
                ["条件类型"] = "ChanceCondition",
                ["条件"] = {
                    ["最小值"] = 20
                },
                ["动作"] = "威力乘以",
                ["数量"] = "2"
            }
        }),
        ["宽度倍率"] = 1,
        ["高度倍率"] = 1,
        ["尺寸倍率"] = 1,
        ["必须要目标"] = true
    }),
    ["高速加特林_入口"] = Spell.Load({
        ["类型"] = "ProjectileSpell",
        ["飞弹模型"] = "豌豆",
        ["持续时间"] = 5,
        ["寻找目标"] = false,
        ["生成于自己位置"] = true,
        ["散射次数"] = 4,
        ["散射角度"] = 0,
        ["散射延迟"] = 0.15,
        ["初始角度修改"] = {
            0,
            0
        },
        ["发射位置偏移"] = {
            0,
            144,
            -182
        },
        ["速度"] = 5000,
        ["重力"] = 0,
        ["追踪目标速度"] = 0,
        ["穿过地形"] = false,
        ["可重复碰撞同一目标"] = false,
        ["对同一目标生效间隔"] = -1,
        ["生效次数"] = 2,
        ["魔法名"] = "高速加特林_入口",
        ["打印信息"] = false,
        ["显示在指令选单中"] = true,
        ["几率"] = 0,
        ["冷却"] = 0.3,
        ["各目标冷却"] = 0,
        ["基础威力"] = 1,
        ["释放给自己"] = false,
        ["延迟"] = 0,
        ["子魔法"] = {
            {
                ["魔法"] = "高速加特林-伤害"
            }
        },
        ["特效_前摇"] = {
            {
                ["_type"] = "CameraShakeGraphic",
                ["旋转"] = {
                    0,
                    0
                },
                ["位移"] = {
                    0,
                    2,
                    5
                },
                ["频率"] = 1,
                ["动画风格"] = "震荡",
                ["衰减风格"] = "反二次方",
                ["目标"] = "自己",
                ["目标场景名"] = "",
                ["延迟"] = 0,
                ["持续时间"] = 0.5,
                ["重复次数"] = 1,
                ["重复延迟"] = 0
            }
        },
        ["特效_释放"] = {
            {
                ["_type"] = "ParticleGraphic",
                ["特效对象"] = "特效/开火/高速加特林_开火",
                ["特效资产"] = "",
                ["绑定实体"] = true,
                ["绑定挂点"] = "",
                ["偏移"] = {
                    0,
                    0,
                    0
                },
                ["目标"] = "自己",
                ["目标场景名"] = "",
                ["延迟"] = 0,
                ["持续时间"] = 1,
                ["重复次数"] = 1,
                ["重复延迟"] = 0
            },
            {
                ["_type"] = "AnimationGraphic",
                ["播放动画"] = "attack",
                ["播放速度"] = 1,
                ["目标"] = "自己",
                ["目标场景名"] = "",
                ["延迟"] = 0,
                ["持续时间"] = 0,
                ["重复次数"] = 1,
                ["重复延迟"] = 0
            },
            {
                ["_type"] = "ParticleGraphic",
                ["特效对象"] = "特效/击中/爆炸_绿色",
                ["特效资产"] = "",
                ["绑定实体"] = false,
                ["绑定挂点"] = "",
                ["偏移"] = {
                    0,
                    0,
                    0
                },
                ["目标"] = "触发点",
                ["目标场景名"] = "",
                ["延迟"] = 0,
                ["持续时间"] = 1,
                ["重复次数"] = 1,
                ["重复延迟"] = 0
            },
            {
                ["_type"] = "SoundGraphic",
                ["声音资源"] = "sandboxId://soundeffect/limbs_pop四肢脱落_豌豆发射.ogg",
                ["绑定实体"] = false,
                ["响度"] = 1,
                ["音调"] = 1,
                ["距离"] = {
                    600,
                    6000
                },
                ["仅播放给相关者"] = false,
                ["目标"] = "自己",
                ["目标场景名"] = "",
                ["延迟"] = 0,
                ["持续时间"] = 1,
                ["重复次数"] = 1,
                ["重复延迟"] = 0
            },
            {
                ["_type"] = "SoundGraphic",
                ["声音资源"] = "sandboxId://soundeffect/kernelpult2_豌豆击中2.ogg",
                ["绑定实体"] = false,
                ["响度"] = 1,
                ["音调"] = 1,
                ["距离"] = {
                    600,
                    6000
                },
                ["仅播放给相关者"] = false,
                ["目标"] = "触发点",
                ["目标场景名"] = "",
                ["延迟"] = 0,
                ["持续时间"] = 1,
                ["重复次数"] = 1,
                ["重复延迟"] = 0
            }
        },
        ["宽度倍率"] = 1,
        ["高度倍率"] = 1,
        ["尺寸倍率"] = 1,
        ["必须要目标"] = false
    }),
    ["双头豌豆-伤害"] = Spell.Load({
        ["类型"] = "PainSpell",
        ["基础伤害"] = 0,
        ["基础倍率"] = 1,
        ["元素类型"] = "无",
        ["属性增伤"] = {
            {
                ["属性类型"] = "攻击",
                ["倍率"] = 0.55,
                ["增加类型"] = "增加",
                ["乘以基础数值"] = false
            }
        },
        ["仅造成仇恨"] = false,
        ["魔法名"] = "双头豌豆-伤害",
        ["打印信息"] = false,
        ["显示在指令选单中"] = true,
        ["几率"] = 0,
        ["冷却"] = 0,
        ["各目标冷却"] = 0,
        ["基础威力"] = 1,
        ["释放给自己"] = false,
        ["延迟"] = 0,
        ["宽度倍率"] = 1,
        ["高度倍率"] = 1,
        ["尺寸倍率"] = 1,
        ["必须要目标"] = true
    }),
    ["双头豌豆_入口"] = Spell.Load({
        ["类型"] = "ProjectileSpell",
        ["飞弹模型"] = "豌豆",
        ["持续时间"] = 5,
        ["寻找目标"] = false,
        ["生成于自己位置"] = true,
        ["散射次数"] = 2,
        ["散射角度"] = 0,
        ["散射延迟"] = 0.2,
        ["初始角度修改"] = {
            0,
            0
        },
        ["发射位置偏移"] = {
            0,
            138,
            -167
        },
        ["速度"] = 5000,
        ["重力"] = 0,
        ["追踪目标速度"] = 0,
        ["穿过地形"] = false,
        ["可重复碰撞同一目标"] = false,
        ["对同一目标生效间隔"] = -1,
        ["生效次数"] = 1,
        ["魔法名"] = "双头豌豆_入口",
        ["打印信息"] = false,
        ["显示在指令选单中"] = true,
        ["几率"] = 0,
        ["冷却"] = 0.8,
        ["各目标冷却"] = 0,
        ["基础威力"] = 1,
        ["释放给自己"] = false,
        ["延迟"] = 0,
        ["子魔法"] = {
            {
                ["魔法"] = "双头豌豆-伤害"
            }
        },
        ["特效_前摇"] = {
            {
                ["_type"] = "CameraShakeGraphic",
                ["旋转"] = {
                    0,
                    0
                },
                ["位移"] = {
                    0,
                    2,
                    5
                },
                ["频率"] = 1,
                ["动画风格"] = "震荡",
                ["衰减风格"] = "反二次方",
                ["目标"] = "自己",
                ["目标场景名"] = "",
                ["延迟"] = 0,
                ["持续时间"] = 0.5,
                ["重复次数"] = 1,
                ["重复延迟"] = 0
            }
        },
        ["特效_释放"] = {
            {
                ["_type"] = "ParticleGraphic",
                ["特效对象"] = "特效/开火/双头豌豆_开火",
                ["特效资产"] = "",
                ["绑定实体"] = true,
                ["绑定挂点"] = "",
                ["偏移"] = {
                    0,
                    -2,
                    0
                },
                ["目标"] = "自己",
                ["目标场景名"] = "",
                ["延迟"] = 0,
                ["持续时间"] = 1,
                ["重复次数"] = 1,
                ["重复延迟"] = 0
            },
            {
                ["_type"] = "AnimationGraphic",
                ["播放动画"] = "attack",
                ["播放速度"] = 1,
                ["目标"] = "自己",
                ["目标场景名"] = "",
                ["延迟"] = 0,
                ["持续时间"] = 0,
                ["重复次数"] = 1,
                ["重复延迟"] = 0
            },
            {
                ["_type"] = "ParticleGraphic",
                ["特效对象"] = "特效/击中/爆炸_绿色",
                ["特效资产"] = "",
                ["绑定实体"] = false,
                ["绑定挂点"] = "",
                ["偏移"] = {
                    0,
                    0,
                    0
                },
                ["目标"] = "触发点",
                ["目标场景名"] = "",
                ["延迟"] = 0,
                ["持续时间"] = 1,
                ["重复次数"] = 1,
                ["重复延迟"] = 0
            },
            {
                ["_type"] = "SoundGraphic",
                ["声音资源"] = "sandboxId://soundeffect/limbs_pop四肢脱落_豌豆发射.ogg",
                ["绑定实体"] = false,
                ["响度"] = 1,
                ["音调"] = 1,
                ["距离"] = {
                    600,
                    6000
                },
                ["仅播放给相关者"] = false,
                ["目标"] = "自己",
                ["目标场景名"] = "",
                ["延迟"] = 0,
                ["持续时间"] = 1,
                ["重复次数"] = 1,
                ["重复延迟"] = 0
            },
            {
                ["_type"] = "SoundGraphic",
                ["声音资源"] = "sandboxId://soundeffect/kernelpult2_豌豆击中2.ogg",
                ["绑定实体"] = false,
                ["响度"] = 1,
                ["音调"] = 1,
                ["距离"] = {
                    600,
                    6000
                },
                ["仅播放给相关者"] = false,
                ["目标"] = "触发点",
                ["目标场景名"] = "",
                ["延迟"] = 0,
                ["持续时间"] = 1,
                ["重复次数"] = 1,
                ["重复延迟"] = 0
            }
        },
        ["宽度倍率"] = 1,
        ["高度倍率"] = 1,
        ["尺寸倍率"] = 1,
        ["必须要目标"] = false
    }),
    ["豌豆射手-伤害"] = Spell.Load({
        ["类型"] = "PainSpell",
        ["基础伤害"] = 0,
        ["基础倍率"] = 1,
        ["元素类型"] = "无",
        ["属性增伤"] = {
            {
                ["属性类型"] = "攻击",
                ["倍率"] = 0.5,
                ["增加类型"] = "增加",
                ["乘以基础数值"] = false
            }
        },
        ["仅造成仇恨"] = false,
        ["魔法名"] = "豌豆射手-伤害",
        ["打印信息"] = true,
        ["显示在指令选单中"] = true,
        ["几率"] = 0,
        ["冷却"] = 0,
        ["各目标冷却"] = 0,
        ["基础威力"] = 1,
        ["释放给自己"] = false,
        ["延迟"] = 0,
        ["宽度倍率"] = 1,
        ["高度倍率"] = 1,
        ["尺寸倍率"] = 1,
        ["必须要目标"] = true
    }),
    ["豌豆射手_入口"] = Spell.Load({
        ["类型"] = "ProjectileSpell",
        ["飞弹模型"] = "豌豆",
        ["持续时间"] = 5,
        ["寻找目标"] = false,
        ["生成于自己位置"] = true,
        ["散射次数"] = 1,
        ["散射角度"] = 0,
        ["散射延迟"] = 0,
        ["初始角度修改"] = {
            0,
            0
        },
        ["发射位置偏移"] = {
            0,
            138,
            -167
        },
        ["速度"] = 5000,
        ["重力"] = 0,
        ["追踪目标速度"] = 0,
        ["穿过地形"] = false,
        ["可重复碰撞同一目标"] = false,
        ["对同一目标生效间隔"] = -1,
        ["生效次数"] = 1,
        ["魔法名"] = "豌豆射手_入口",
        ["打印信息"] = false,
        ["显示在指令选单中"] = true,
        ["几率"] = 0,
        ["冷却"] = 0.8,
        ["各目标冷却"] = 0,
        ["基础威力"] = 1,
        ["释放给自己"] = false,
        ["延迟"] = 0,
        ["子魔法"] = {
            {
                ["魔法"] = "豌豆射手-伤害"
            }
        },
        ["特效_前摇"] = {
            {
                ["_type"] = "CameraShakeGraphic",
                ["旋转"] = {
                    0,
                    0
                },
                ["位移"] = {
                    0,
                    2,
                    5
                },
                ["频率"] = 1,
                ["动画风格"] = "震荡",
                ["衰减风格"] = "反二次方",
                ["目标"] = "自己",
                ["目标场景名"] = "",
                ["延迟"] = 0,
                ["持续时间"] = 0.5,
                ["重复次数"] = 1,
                ["重复延迟"] = 0
            },
            {
                ["_type"] = "ParticleGraphic",
                ["特效对象"] = "特效/开火/豌豆射手_开火",
                ["特效资产"] = "",
                ["绑定实体"] = true,
                ["绑定挂点"] = "",
                ["偏移"] = {
                    0,
                    -2,
                    0
                },
                ["目标"] = "自己",
                ["目标场景名"] = "",
                ["延迟"] = 0,
                ["持续时间"] = 1,
                ["重复次数"] = 1,
                ["重复延迟"] = 0
            },
            {
                ["_type"] = "AnimationGraphic",
                ["播放动画"] = "attack",
                ["播放速度"] = 1,
                ["目标"] = "自己",
                ["目标场景名"] = "",
                ["延迟"] = 0,
                ["持续时间"] = 0,
                ["重复次数"] = 1,
                ["重复延迟"] = 0
            },
            {
                ["_type"] = "ParticleGraphic",
                ["特效对象"] = "特效/击中/爆炸_绿色",
                ["特效资产"] = "",
                ["绑定实体"] = false,
                ["绑定挂点"] = "",
                ["偏移"] = {
                    0,
                    0,
                    0
                },
                ["目标"] = "触发点",
                ["目标场景名"] = "",
                ["延迟"] = 0,
                ["持续时间"] = 1,
                ["重复次数"] = 1,
                ["重复延迟"] = 0
            },
            {
                ["_type"] = "SoundGraphic",
                ["声音资源"] = "sandboxId://soundeffect/limbs_pop四肢脱落_豌豆发射.ogg",
                ["绑定实体"] = false,
                ["响度"] = 1,
                ["音调"] = 1,
                ["距离"] = {
                    600,
                    6000
                },
                ["仅播放给相关者"] = false,
                ["目标"] = "自己",
                ["目标场景名"] = "",
                ["延迟"] = 0,
                ["持续时间"] = 1,
                ["重复次数"] = 1,
                ["重复延迟"] = 0
            }
        },
        ["特效_释放"] = {
            {
                ["_type"] = "SoundGraphic",
                ["声音资源"] = "sandboxId://soundeffect/kernelpult2_豌豆击中2.ogg",
                ["绑定实体"] = false,
                ["响度"] = 1,
                ["音调"] = 1,
                ["距离"] = {
                    600,
                    6000
                },
                ["仅播放给相关者"] = false,
                ["目标"] = "触发点",
                ["目标场景名"] = "",
                ["延迟"] = 0,
                ["持续时间"] = 1,
                ["重复次数"] = 1,
                ["重复延迟"] = 0
            }
        },
        ["宽度倍率"] = 1,
        ["高度倍率"] = 1,
        ["尺寸倍率"] = 1,
        ["必须要目标"] = false
    }),
    ["完成时延迟提示导航"] = Spell.Load({
        ["类型"] = "CommandSpell",
        ["指令"] = {
            [[focusOn {"聚焦UI":{"聚焦UI":[{"UI名":"HudAvatar","控件路径":"头像背景/任务列表/任务_1","提示文本":"任务完成啦！\\n点击跳转到下一任务吧！","可点击任意位置":false}],"完成时执行指令":[]}} ]],
            [[skill {"技能名":"豌豆射手","操作":"习得"} ]],
            [[skill {"技能名":"副-樱桃炸弹","操作":"习得"} ]],
            [[skill {"技能名":"豌豆射手","操作":"装备","装备格子":1} ]],
            [[skill {"技能名":"副-樱桃炸弹","操作":"装备","装备格子":2} ]]
        },
        ["魔法名"] = "完成时延迟提示导航",
        ["打印信息"] = false,
        ["显示在指令选单中"] = true,
        ["几率"] = 0,
        ["冷却"] = 0,
        ["各目标冷却"] = 0,
        ["基础威力"] = 1,
        ["释放给自己"] = true,
        ["延迟"] = 3,
        ["宽度倍率"] = 1,
        ["高度倍率"] = 1,
        ["尺寸倍率"] = 1,
        ["必须要目标"] = true
    }),
    ["新玩家进入"] = Spell.Load({
        ["类型"] = "CommandSpell",
        ["指令"] = {
            [[level {"关卡":"新手关","无需匹配直接开始":true} ]]
        },
        ["魔法名"] = "新玩家进入",
        ["打印信息"] = false,
        ["显示在指令选单中"] = true,
        ["几率"] = 0,
        ["冷却"] = 0,
        ["各目标冷却"] = 0,
        ["基础威力"] = 1,
        ["释放给自己"] = true,
        ["延迟"] = 0,
        ["释放条件"] = Modifiers.New({
            {
                ["目标"] = "自己",
                ["条件类型"] = "QuestCondition",
                ["条件"] = {
                    ["任务"] = "1教程任务——化身射手",
                    ["条件"] = "已完成或提交"
                },
                ["动作"] = "拒绝"
            }
        }),
        ["宽度倍率"] = 1,
        ["高度倍率"] = 1,
        ["尺寸倍率"] = 1,
        ["必须要目标"] = true
    }),
    ["旧玩家补足豌豆射手"] = Spell.Load({
        ["类型"] = "CommandSpell",
        ["指令"] = {
            [[skill {"技能名":"豌豆射手","操作":"习得"} ]],
            [[skill {"技能名":"豌豆射手","操作":"装备","装备格子":1,"仅在该格无装备时生效":true} ]]
        },
        ["魔法名"] = "旧玩家补足豌豆射手",
        ["打印信息"] = false,
        ["显示在指令选单中"] = true,
        ["几率"] = 0,
        ["冷却"] = 0,
        ["各目标冷却"] = 0,
        ["基础威力"] = 1,
        ["释放给自己"] = true,
        ["延迟"] = 0,
        ["释放条件"] = Modifiers.New({
            {
                ["目标"] = "自己",
                ["条件类型"] = "QuestCondition",
                ["条件"] = {
                    ["任务"] = "1教程任务——化身射手",
                    ["条件"] = "已完成或提交"
                },
                ["动作"] = "必须"
            }
        }),
        ["宽度倍率"] = 1,
        ["高度倍率"] = 1,
        ["尺寸倍率"] = 1,
        ["必须要目标"] = true
    }),
    ["地刺_dot"] = Spell.Load({
        ["类型"] = "DOTBuffSpell",
        ["基础伤害"] = 260,
        ["基础倍率"] = 1,
        ["属性增伤"] = {
            {
                ["属性类型"] = "攻击",
                ["倍率"] = 1.8,
                ["增加类型"] = "增加",
                ["乘以基础数值"] = false
            }
        },
        ["脉冲时间"] = 1,
        ["持续时间"] = 3,
        ["持续时间独立计算"] = false,
        ["重复释放刷新时间"] = true,
        ["生效次数"] = 0,
        ["最大层数"] = 0,
        ["无需更新"] = false,
        ["魔法名"] = "地刺_dot",
        ["打印信息"] = false,
        ["显示在指令选单中"] = true,
        ["几率"] = 0,
        ["冷却"] = 0,
        ["各目标冷却"] = 0,
        ["基础威力"] = 1,
        ["释放给自己"] = false,
        ["延迟"] = 0,
        ["宽度倍率"] = 1,
        ["高度倍率"] = 1,
        ["尺寸倍率"] = 1,
        ["必须要目标"] = true
    }),
    ["地刺_脉冲"] = Spell.Load({
        ["类型"] = "AOESpell",
        ["持续时间"] = 5,
        ["可重复击中同一目标"] = true,
        ["击中间隔"] = 1,
        ["特效_持续"] = {
            {
                ["_type"] = "ModelGraphic",
                ["模型对象"] = "怪物模型/植物/地刺",
                ["模型状态机"] = "",
                ["播放动画"] = "",
                ["绑定实体"] = false,
                ["绑定挂点"] = "",
                ["偏移"] = {
                    0,
                    0,
                    0
                },
                ["目标"] = "目标",
                ["目标场景名"] = "",
                ["延迟"] = 0,
                ["持续时间"] = 0,
                ["重复次数"] = 1,
                ["重复延迟"] = 0
            }
        },
        ["范围形状"] = "圆形",
        ["圆形半径"] = 500,
        ["偏移"] = {
            0,
            0,
            0
        },
        ["_previewLocation"] = nil,
        ["魔法名"] = "地刺_脉冲",
        ["打印信息"] = false,
        ["显示在指令选单中"] = true,
        ["几率"] = 0,
        ["冷却"] = 30,
        ["各目标冷却"] = 0,
        ["基础威力"] = 1,
        ["释放给自己"] = false,
        ["延迟"] = 0,
        ["子魔法"] = {
            {
                ["魔法"] = "地刺_dot"
            }
        },
        ["特效_释放"] = {
            {
                ["_type"] = "SoundGraphic",
                ["声音资源"] = "sandboxId://soundeffect/plant放植物.ogg",
                ["绑定实体"] = false,
                ["响度"] = 1,
                ["音调"] = 1,
                ["距离"] = {
                    600,
                    6000
                },
                ["仅播放给相关者"] = false,
                ["目标"] = "目标",
                ["目标场景名"] = "",
                ["延迟"] = 0,
                ["持续时间"] = 1,
                ["重复次数"] = 1,
                ["重复延迟"] = 0
            }
        },
        ["宽度倍率"] = 1,
        ["高度倍率"] = 1,
        ["尺寸倍率"] = 1,
        ["必须要目标"] = true
    }),
    ["副_召唤_坚果"] = Spell.Load({
        ["类型"] = "SummonSpell",
        ["召唤在目标位置"] = true,
        ["怪物类型"] = "副-召唤物-坚果",
        ["最大数量"] = 1,
        ["召唤范围"] = 100,
        ["持续时间"] = 20,
        ["继承等级"] = false,
        ["额外召唤物属性"] = {
            ["生命"] = {
                ["额外属性"] = "生命",
                ["属性增伤"] = {
                    ["属性类型"] = "生命",
                    ["倍率"] = 10,
                    ["增加类型"] = "增加",
                    ["乘以基础数值"] = false
                }
            },
            ["仇恨"] = {
                ["额外属性"] = "仇恨",
                ["属性增伤"] = {
                    ["属性类型"] = "攻击",
                    ["倍率"] = 1,
                    ["增加类型"] = "增加",
                    ["乘以基础数值"] = false
                }
            }
        },
        ["魔法名"] = "副_召唤_坚果",
        ["打印信息"] = false,
        ["显示在指令选单中"] = true,
        ["几率"] = 0,
        ["冷却"] = 30,
        ["各目标冷却"] = 0,
        ["基础威力"] = 1,
        ["释放给自己"] = false,
        ["延迟"] = 0,
        ["特效_释放"] = {
            {
                ["_type"] = "SoundGraphic",
                ["声音资源"] = "sandboxId://soundeffect/plant放植物.ogg",
                ["绑定实体"] = false,
                ["响度"] = 1,
                ["音调"] = 1,
                ["距离"] = {
                    600,
                    6000
                },
                ["仅播放给相关者"] = false,
                ["目标"] = "目标",
                ["目标场景名"] = "",
                ["延迟"] = 0,
                ["持续时间"] = 1,
                ["重复次数"] = 1,
                ["重复延迟"] = 0
            }
        },
        ["宽度倍率"] = 1,
        ["高度倍率"] = 1,
        ["尺寸倍率"] = 1,
        ["必须要目标"] = true
    }),
    ["副_坚果_伤害"] = Spell.Load({
        ["类型"] = "PainSpell",
        ["基础伤害"] = 0,
        ["基础倍率"] = 1,
        ["元素类型"] = "无",
        ["属性增伤"] = {
            {
                ["属性类型"] = "仇恨",
                ["倍率"] = 1,
                ["增加类型"] = "增加",
                ["乘以基础数值"] = false
            }
        },
        ["仅造成仇恨"] = true,
        ["魔法名"] = "副_坚果_伤害",
        ["打印信息"] = false,
        ["显示在指令选单中"] = true,
        ["几率"] = 0,
        ["冷却"] = 0,
        ["各目标冷却"] = 0,
        ["基础威力"] = 1,
        ["释放给自己"] = false,
        ["延迟"] = 0,
        ["宽度倍率"] = 1,
        ["高度倍率"] = 1,
        ["尺寸倍率"] = 1,
        ["必须要目标"] = true
    }),
    ["副_坚果_范围"] = Spell.Load({
        ["类型"] = "AOESpell",
        ["持续时间"] = 0,
        ["范围形状"] = "圆形",
        ["圆形半径"] = 400,
        ["偏移"] = {
            0,
            0,
            0
        },
        ["_previewLocation"] = nil,
        ["魔法名"] = "副_坚果_范围",
        ["打印信息"] = false,
        ["显示在指令选单中"] = true,
        ["几率"] = 0,
        ["冷却"] = 1,
        ["各目标冷却"] = 0,
        ["基础威力"] = 1,
        ["释放给自己"] = false,
        ["延迟"] = 0,
        ["子魔法"] = {
            {
                ["魔法"] = "副_坚果_伤害"
            }
        },
        ["宽度倍率"] = 1,
        ["高度倍率"] = 1,
        ["尺寸倍率"] = 1,
        ["必须要目标"] = true
    }),
    ["副-樱桃炸弹-飞弹-范围"] = Spell.Load({
        ["类型"] = "AOESpell",
        ["持续时间"] = 0,
        ["范围形状"] = "圆形",
        ["圆形半径"] = 300,
        ["偏移"] = {
            0,
            0,
            0
        },
        ["_previewLocation"] = nil,
        ["魔法名"] = "副-樱桃炸弹-飞弹-范围",
        ["打印信息"] = false,
        ["显示在指令选单中"] = true,
        ["几率"] = 0,
        ["冷却"] = 0,
        ["各目标冷却"] = 0,
        ["基础威力"] = 1,
        ["释放给自己"] = false,
        ["延迟"] = 0,
        ["子魔法"] = {
            {
                ["魔法"] = "副_樱桃炸弹_飞弹_范围_伤害"
            }
        },
        ["特效_释放"] = {
            {
                ["_type"] = "ParticleGraphic",
                ["特效对象"] = "特效/击中/爆炸_紫红色",
                ["特效资产"] = "",
                ["绑定实体"] = false,
                ["绑定挂点"] = "",
                ["偏移"] = {
                    0,
                    0,
                    0
                },
                ["目标"] = "触发点",
                ["目标场景名"] = "",
                ["延迟"] = 0,
                ["持续时间"] = 1.5,
                ["重复次数"] = 1,
                ["重复延迟"] = 0
            }
        },
        ["宽度倍率"] = 1,
        ["高度倍率"] = 1,
        ["尺寸倍率"] = 1,
        ["必须要目标"] = true
    }),
    ["副-樱桃炸弹-飞弹"] = Spell.Load({
        ["类型"] = "ProjectileSpell",
        ["飞弹模型"] = "樱桃炸弹",
        ["持续时间"] = 20,
        ["寻找目标"] = false,
        ["生成于自己位置"] = true,
        ["散射次数"] = 1,
        ["散射角度"] = 0,
        ["散射延迟"] = 0,
        ["初始角度修改"] = {
            70,
            0
        },
        ["发射位置偏移"] = {
            0,
            0,
            0
        },
        ["速度"] = 200,
        ["重力"] = 0,
        ["追踪目标速度"] = 50,
        ["穿过地形"] = false,
        ["结束子魔法"] = {
            {
                ["魔法"] = "副-樱桃炸弹-飞弹-范围"
            }
        },
        ["可重复碰撞同一目标"] = false,
        ["对同一目标生效间隔"] = -1,
        ["生效次数"] = 1,
        ["魔法名"] = "副-樱桃炸弹-飞弹",
        ["打印信息"] = false,
        ["显示在指令选单中"] = true,
        ["几率"] = 0,
        ["冷却"] = 5,
        ["各目标冷却"] = 0,
        ["基础威力"] = 1,
        ["释放给自己"] = false,
        ["延迟"] = 0,
        ["特效_释放"] = {
            {
                ["_type"] = "AnimationGraphic",
                ["播放动画"] = "attack",
                ["播放速度"] = 1,
                ["目标"] = "自己",
                ["目标场景名"] = "",
                ["延迟"] = 0,
                ["持续时间"] = 0,
                ["重复次数"] = 1,
                ["重复延迟"] = 0
            },
            {
                ["_type"] = "ParticleGraphic",
                ["特效对象"] = "特效/击中/爆炸_紫红色",
                ["特效资产"] = "",
                ["绑定实体"] = false,
                ["绑定挂点"] = "",
                ["偏移"] = {
                    0,
                    0,
                    0
                },
                ["目标"] = "触发点",
                ["目标场景名"] = "",
                ["延迟"] = 0,
                ["持续时间"] = 1,
                ["重复次数"] = 1,
                ["重复延迟"] = 0
            },
            {
                ["_type"] = "SoundGraphic",
                ["声音资源"] = "sandboxId://soundeffect/cherrybomb_樱桃炸弹.ogg",
                ["绑定实体"] = false,
                ["响度"] = 1,
                ["音调"] = 1,
                ["距离"] = {
                    600,
                    6000
                },
                ["仅播放给相关者"] = false,
                ["目标"] = "触发点",
                ["目标场景名"] = "",
                ["延迟"] = 0,
                ["持续时间"] = 1,
                ["重复次数"] = 1,
                ["重复延迟"] = 0
            },
            {
                ["_type"] = "SoundGraphic",
                ["声音资源"] = "sandboxId://soundeffect/throw[1~2].ogg",
                ["绑定实体"] = false,
                ["响度"] = 1,
                ["音调"] = 1,
                ["距离"] = {
                    600,
                    6000
                },
                ["仅播放给相关者"] = false,
                ["目标"] = "自己",
                ["目标场景名"] = "",
                ["延迟"] = 0,
                ["持续时间"] = 1,
                ["重复次数"] = 1,
                ["重复延迟"] = 0
            }
        },
        ["宽度倍率"] = 1,
        ["高度倍率"] = 1,
        ["尺寸倍率"] = 1,
        ["必须要目标"] = false
    }),
    ["副_樱桃炸弹_飞弹_范围_伤害"] = Spell.Load({
        ["类型"] = "PainSpell",
        ["基础伤害"] = 300,
        ["基础倍率"] = 1,
        ["元素类型"] = "无",
        ["属性增伤"] = {
            {
                ["属性类型"] = "攻击",
                ["倍率"] = 2,
                ["增加类型"] = "增加",
                ["乘以基础数值"] = false
            }
        },
        ["仅造成仇恨"] = false,
        ["魔法名"] = "副_樱桃炸弹_飞弹_范围_伤害",
        ["打印信息"] = false,
        ["显示在指令选单中"] = true,
        ["几率"] = 0,
        ["冷却"] = 0,
        ["各目标冷却"] = 0,
        ["基础威力"] = 1,
        ["释放给自己"] = false,
        ["延迟"] = 0,
        ["宽度倍率"] = 1,
        ["高度倍率"] = 1,
        ["尺寸倍率"] = 1,
        ["必须要目标"] = true
    }),
    ["副_菜问召唤"] = Spell.Load({
        ["类型"] = "SummonSpell",
        ["召唤在目标位置"] = true,
        ["怪物类型"] = "副-召唤物-菜问",
        ["最大数量"] = 1,
        ["召唤范围"] = 100,
        ["持续时间"] = 20,
        ["继承等级"] = false,
        ["额外召唤物属性"] = {
            ["生命"] = {
                ["额外属性"] = "生命",
                ["属性增伤"] = {
                    ["属性类型"] = "生命",
                    ["倍率"] = 2,
                    ["增加类型"] = "增加",
                    ["乘以基础数值"] = false
                }
            },
            ["攻击"] = {
                ["额外属性"] = "攻击",
                ["属性增伤"] = {
                    ["属性类型"] = "攻击",
                    ["倍率"] = 0.3,
                    ["增加类型"] = "增加",
                    ["乘以基础数值"] = false
                }
            }
        },
        ["魔法名"] = "副_菜问召唤",
        ["打印信息"] = false,
        ["显示在指令选单中"] = true,
        ["几率"] = 0,
        ["冷却"] = 30,
        ["各目标冷却"] = 0,
        ["基础威力"] = 1,
        ["释放给自己"] = false,
        ["延迟"] = 0,
        ["特效_释放"] = {
            {
                ["_type"] = "SoundGraphic",
                ["声音资源"] = "sandboxId://soundeffect/plant放植物.ogg",
                ["绑定实体"] = false,
                ["响度"] = 1,
                ["音调"] = 1,
                ["距离"] = {
                    600,
                    6000
                },
                ["仅播放给相关者"] = false,
                ["目标"] = "目标",
                ["目标场景名"] = "",
                ["延迟"] = 0,
                ["持续时间"] = 1,
                ["重复次数"] = 1,
                ["重复延迟"] = 0
            }
        },
        ["宽度倍率"] = 1,
        ["高度倍率"] = 1,
        ["尺寸倍率"] = 1,
        ["必须要目标"] = true
    }),
    ["副_召唤_豌豆射手"] = Spell.Load({
        ["类型"] = "SummonSpell",
        ["召唤在目标位置"] = true,
        ["怪物类型"] = "副-召唤物-豌豆射手",
        ["最大数量"] = 1,
        ["召唤范围"] = 100,
        ["持续时间"] = 20,
        ["继承等级"] = false,
        ["额外召唤物属性"] = {
            ["生命"] = {
                ["额外属性"] = "生命",
                ["属性增伤"] = {
                    ["属性类型"] = "生命",
                    ["倍率"] = 2,
                    ["增加类型"] = "增加",
                    ["乘以基础数值"] = false
                }
            },
            ["攻击"] = {
                ["额外属性"] = "攻击",
                ["属性增伤"] = {
                    ["属性类型"] = "攻击",
                    ["倍率"] = 0.1,
                    ["增加类型"] = "增加",
                    ["乘以基础数值"] = false
                }
            }
        },
        ["魔法名"] = "副_召唤_豌豆射手",
        ["打印信息"] = false,
        ["显示在指令选单中"] = true,
        ["几率"] = 0,
        ["冷却"] = 30,
        ["各目标冷却"] = 0,
        ["基础威力"] = 1,
        ["释放给自己"] = false,
        ["延迟"] = 0,
        ["特效_释放"] = {
            {
                ["_type"] = "SoundGraphic",
                ["声音资源"] = "sandboxId://soundeffect/plant放植物.ogg",
                ["绑定实体"] = false,
                ["响度"] = 1,
                ["音调"] = 1,
                ["距离"] = {
                    600,
                    6000
                },
                ["仅播放给相关者"] = false,
                ["目标"] = "目标",
                ["目标场景名"] = "",
                ["延迟"] = 0,
                ["持续时间"] = 1,
                ["重复次数"] = 1,
                ["重复延迟"] = 0
            }
        },
        ["宽度倍率"] = 1,
        ["高度倍率"] = 1,
        ["尺寸倍率"] = 1,
        ["必须要目标"] = true
    }),
    ["副_豌豆射手_伤害"] = Spell.Load({
        ["类型"] = "PainSpell",
        ["基础伤害"] = 0,
        ["基础倍率"] = 1,
        ["元素类型"] = "无",
        ["属性增伤"] = {
            {
                ["属性类型"] = "攻击",
                ["倍率"] = 1,
                ["增加类型"] = "增加",
                ["乘以基础数值"] = false
            }
        },
        ["仅造成仇恨"] = false,
        ["魔法名"] = "副_豌豆射手_伤害",
        ["打印信息"] = false,
        ["显示在指令选单中"] = true,
        ["几率"] = 0,
        ["冷却"] = 0,
        ["各目标冷却"] = 0,
        ["基础威力"] = 1,
        ["释放给自己"] = false,
        ["延迟"] = 0,
        ["宽度倍率"] = 1,
        ["高度倍率"] = 1,
        ["尺寸倍率"] = 1,
        ["必须要目标"] = true
    }),
    ["副_豌豆射手_入口"] = Spell.Load({
        ["类型"] = "ProjectileSpell",
        ["飞弹模型"] = "豌豆",
        ["持续时间"] = 5,
        ["寻找目标"] = false,
        ["生成于自己位置"] = true,
        ["散射次数"] = 1,
        ["散射角度"] = 0,
        ["散射延迟"] = 0,
        ["初始角度修改"] = {
            0,
            0
        },
        ["发射位置偏移"] = {
            0,
            138,
            -167
        },
        ["速度"] = 5000,
        ["重力"] = 0,
        ["追踪目标速度"] = 0,
        ["穿过地形"] = false,
        ["可重复碰撞同一目标"] = false,
        ["对同一目标生效间隔"] = -1,
        ["生效次数"] = 1,
        ["魔法名"] = "副_豌豆射手_入口",
        ["打印信息"] = false,
        ["显示在指令选单中"] = true,
        ["几率"] = 0,
        ["冷却"] = 0.5,
        ["各目标冷却"] = 0,
        ["基础威力"] = 1,
        ["释放给自己"] = false,
        ["延迟"] = 0,
        ["子魔法"] = {
            {
                ["魔法"] = "副_豌豆射手_伤害"
            }
        },
        ["特效_释放"] = {
            {
                ["_type"] = "ParticleGraphic",
                ["特效对象"] = "特效/开火/豌豆射手_开火",
                ["特效资产"] = "",
                ["绑定实体"] = true,
                ["绑定挂点"] = "",
                ["偏移"] = {
                    0,
                    0,
                    0
                },
                ["目标"] = "自己",
                ["目标场景名"] = "",
                ["延迟"] = 0,
                ["持续时间"] = 1,
                ["重复次数"] = 1,
                ["重复延迟"] = 0
            },
            {
                ["_type"] = "AnimationGraphic",
                ["播放动画"] = "attack",
                ["播放速度"] = 1,
                ["目标"] = "自己",
                ["目标场景名"] = "",
                ["延迟"] = 0,
                ["持续时间"] = 0,
                ["重复次数"] = 1,
                ["重复延迟"] = 0
            },
            {
                ["_type"] = "ParticleGraphic",
                ["特效对象"] = "特效/击中/爆炸_绿色",
                ["特效资产"] = "",
                ["绑定实体"] = false,
                ["绑定挂点"] = "",
                ["偏移"] = {
                    0,
                    0,
                    0
                },
                ["目标"] = "触发点",
                ["目标场景名"] = "",
                ["延迟"] = 0,
                ["持续时间"] = 1,
                ["重复次数"] = 1,
                ["重复延迟"] = 0
            },
            {
                ["_type"] = "SoundGraphic",
                ["声音资源"] = "sandboxId://soundeffect/limbs_pop四肢脱落_豌豆发射.ogg",
                ["绑定实体"] = false,
                ["响度"] = 1,
                ["音调"] = 1,
                ["距离"] = {
                    600,
                    6000
                },
                ["仅播放给相关者"] = false,
                ["目标"] = "自己",
                ["目标场景名"] = "",
                ["延迟"] = 0,
                ["持续时间"] = 1,
                ["重复次数"] = 1,
                ["重复延迟"] = 0
            },
            {
                ["_type"] = "SoundGraphic",
                ["声音资源"] = "sandboxId://soundeffect/kernelpult2_豌豆击中2.ogg",
                ["绑定实体"] = false,
                ["响度"] = 1,
                ["音调"] = 1,
                ["距离"] = {
                    600,
                    6000
                },
                ["仅播放给相关者"] = false,
                ["目标"] = "触发点",
                ["目标场景名"] = "",
                ["延迟"] = 0,
                ["持续时间"] = 1,
                ["重复次数"] = 1,
                ["重复延迟"] = 0
            }
        },
        ["宽度倍率"] = 1,
        ["高度倍率"] = 1,
        ["尺寸倍率"] = 1,
        ["必须要目标"] = false
    }),
    ["副_仙人掌_伤害"] = Spell.Load({
        ["类型"] = "PainSpell",
        ["基础伤害"] = 0,
        ["基础倍率"] = 1,
        ["元素类型"] = "无",
        ["属性增伤"] = {
            {
                ["属性类型"] = "攻击",
                ["倍率"] = 1,
                ["增加类型"] = "增加",
                ["乘以基础数值"] = false
            }
        },
        ["仅造成仇恨"] = false,
        ["魔法名"] = "副_仙人掌_伤害",
        ["打印信息"] = false,
        ["显示在指令选单中"] = true,
        ["几率"] = 0,
        ["冷却"] = 0,
        ["各目标冷却"] = 0,
        ["基础威力"] = 1,
        ["释放给自己"] = false,
        ["延迟"] = 0,
        ["宽度倍率"] = 1,
        ["高度倍率"] = 1,
        ["尺寸倍率"] = 1,
        ["必须要目标"] = true
    }),
    ["副_仙人掌_入口"] = Spell.Load({
        ["类型"] = "ProjectileSpell",
        ["飞弹模型"] = "仙人掌刺",
        ["持续时间"] = 5,
        ["寻找目标"] = false,
        ["生成于自己位置"] = true,
        ["散射次数"] = 1,
        ["散射角度"] = 0,
        ["散射延迟"] = 0,
        ["初始角度修改"] = {
            0,
            0
        },
        ["发射位置偏移"] = {
            0,
            238,
            -128
        },
        ["速度"] = 5500,
        ["重力"] = 0,
        ["追踪目标速度"] = 0,
        ["穿过地形"] = false,
        ["可重复碰撞同一目标"] = false,
        ["对同一目标生效间隔"] = -1,
        ["生效次数"] = 3,
        ["魔法名"] = "副_仙人掌_入口",
        ["打印信息"] = false,
        ["显示在指令选单中"] = true,
        ["几率"] = 0,
        ["冷却"] = 1,
        ["各目标冷却"] = 0,
        ["基础威力"] = 1,
        ["释放给自己"] = false,
        ["延迟"] = 0,
        ["子魔法"] = {
            {
                ["魔法"] = "副_仙人掌_伤害"
            }
        },
        ["特效_释放"] = {
            {
                ["_type"] = "ParticleGraphic",
                ["特效对象"] = "开火/开火/仙人掌_开火",
                ["特效资产"] = "",
                ["绑定实体"] = true,
                ["绑定挂点"] = "",
                ["偏移"] = {
                    0,
                    0,
                    0
                },
                ["目标"] = "自己",
                ["目标场景名"] = "",
                ["延迟"] = 0,
                ["持续时间"] = 1,
                ["重复次数"] = 1,
                ["重复延迟"] = 0
            },
            {
                ["_type"] = "AnimationGraphic",
                ["播放动画"] = "attack",
                ["播放速度"] = 1,
                ["目标"] = "自己",
                ["目标场景名"] = "",
                ["延迟"] = 0,
                ["持续时间"] = 0,
                ["重复次数"] = 1,
                ["重复延迟"] = 0
            },
            {
                ["_type"] = "ParticleGraphic",
                ["特效对象"] = "特效/击中/爆炸_金色_带橘色小型",
                ["特效资产"] = "",
                ["绑定实体"] = false,
                ["绑定挂点"] = "",
                ["偏移"] = {
                    0,
                    0,
                    0
                },
                ["目标"] = "触发点",
                ["目标场景名"] = "",
                ["延迟"] = 0,
                ["持续时间"] = 1,
                ["重复次数"] = 1,
                ["重复延迟"] = 0
            },
            {
                ["_type"] = "SoundGraphic",
                ["声音资源"] = "sandboxId://soundeffect/throw2发射音效.ogg",
                ["绑定实体"] = false,
                ["响度"] = 1,
                ["音调"] = 1,
                ["距离"] = {
                    600,
                    6000
                },
                ["仅播放给相关者"] = false,
                ["目标"] = "自己",
                ["目标场景名"] = "",
                ["延迟"] = 0,
                ["持续时间"] = 1,
                ["重复次数"] = 1,
                ["重复延迟"] = 0
            },
            {
                ["_type"] = "SoundGraphic",
                ["声音资源"] = "sandboxId://soundeffect/splat2击中音效.ogg",
                ["绑定实体"] = false,
                ["响度"] = 1,
                ["音调"] = 1,
                ["距离"] = {
                    600,
                    6000
                },
                ["仅播放给相关者"] = false,
                ["目标"] = "触发点",
                ["目标场景名"] = "",
                ["延迟"] = 0,
                ["持续时间"] = 1,
                ["重复次数"] = 1,
                ["重复延迟"] = 0
            }
        },
        ["宽度倍率"] = 1,
        ["高度倍率"] = 1,
        ["尺寸倍率"] = 1,
        ["必须要目标"] = false
    }),
    ["副_召唤_仙人掌"] = Spell.Load({
        ["类型"] = "SummonSpell",
        ["召唤在目标位置"] = true,
        ["怪物类型"] = "副-召唤物-仙人掌",
        ["最大数量"] = 1,
        ["召唤范围"] = 100,
        ["持续时间"] = 0,
        ["继承等级"] = false,
        ["额外召唤物属性"] = {
            ["生命"] = {
                ["额外属性"] = "生命",
                ["属性增伤"] = {
                    ["属性类型"] = "生命",
                    ["倍率"] = 2,
                    ["增加类型"] = "增加",
                    ["乘以基础数值"] = false
                }
            },
            ["攻击"] = {
                ["额外属性"] = "攻击",
                ["属性增伤"] = {
                    ["属性类型"] = "攻击",
                    ["倍率"] = 0.2,
                    ["增加类型"] = "增加",
                    ["乘以基础数值"] = false
                }
            }
        },
        ["魔法名"] = "副_召唤_仙人掌",
        ["打印信息"] = false,
        ["显示在指令选单中"] = true,
        ["几率"] = 0,
        ["冷却"] = 40,
        ["各目标冷却"] = 0,
        ["基础威力"] = 1,
        ["释放给自己"] = false,
        ["延迟"] = 0,
        ["特效_释放"] = {
            {
                ["_type"] = "SoundGraphic",
                ["声音资源"] = "sandboxId://soundeffect/plant放植物.ogg",
                ["绑定实体"] = false,
                ["响度"] = 1,
                ["音调"] = 1,
                ["距离"] = {
                    600,
                    6000
                },
                ["仅播放给相关者"] = false,
                ["目标"] = "目标",
                ["目标场景名"] = "",
                ["延迟"] = 0,
                ["持续时间"] = 1,
                ["重复次数"] = 1,
                ["重复延迟"] = 0
            }
        },
        ["宽度倍率"] = 1,
        ["高度倍率"] = 1,
        ["尺寸倍率"] = 1,
        ["必须要目标"] = true
    }),
    ["副_召唤_椰子炮"] = Spell.Load({
        ["类型"] = "SummonSpell",
        ["召唤在目标位置"] = true,
        ["怪物类型"] = "副-召唤物-椰子炮",
        ["最大数量"] = 1,
        ["召唤范围"] = 100,
        ["持续时间"] = 40,
        ["继承等级"] = false,
        ["额外召唤物属性"] = {
            ["生命"] = {
                ["额外属性"] = "生命",
                ["属性增伤"] = {
                    ["属性类型"] = "生命",
                    ["倍率"] = 2,
                    ["增加类型"] = "增加",
                    ["乘以基础数值"] = false
                }
            },
            ["攻击"] = {
                ["额外属性"] = "攻击",
                ["属性增伤"] = {
                    ["属性类型"] = "攻击",
                    ["倍率"] = 0.55,
                    ["增加类型"] = "增加",
                    ["乘以基础数值"] = false
                }
            }
        },
        ["魔法名"] = "副_召唤_椰子炮",
        ["打印信息"] = false,
        ["显示在指令选单中"] = true,
        ["几率"] = 0,
        ["冷却"] = 55,
        ["各目标冷却"] = 0,
        ["基础威力"] = 1,
        ["释放给自己"] = false,
        ["延迟"] = 0,
        ["特效_释放"] = {
            {
                ["_type"] = "SoundGraphic",
                ["声音资源"] = "sandboxId://soundeffect/plant放植物.ogg",
                ["绑定实体"] = false,
                ["响度"] = 1,
                ["音调"] = 1,
                ["距离"] = {
                    600,
                    6000
                },
                ["仅播放给相关者"] = false,
                ["目标"] = "目标",
                ["目标场景名"] = "",
                ["延迟"] = 0,
                ["持续时间"] = 1,
                ["重复次数"] = 1,
                ["重复延迟"] = 0
            }
        },
        ["宽度倍率"] = 1,
        ["高度倍率"] = 1,
        ["尺寸倍率"] = 1,
        ["必须要目标"] = true
    }),
    ["椰子炮_入口"] = Spell.Load({
        ["类型"] = "ProjectileSpell",
        ["飞弹模型"] = "椰子飞弹",
        ["持续时间"] = 10,
        ["寻找目标"] = false,
        ["生成于自己位置"] = true,
        ["散射次数"] = 1,
        ["散射角度"] = 0,
        ["散射延迟"] = 0,
        ["初始角度修改"] = {
            0,
            0
        },
        ["发射位置偏移"] = {
            0,
            145,
            -111
        },
        ["速度"] = 3000,
        ["重力"] = 0,
        ["追踪目标速度"] = 0,
        ["穿过地形"] = false,
        ["结束子魔法"] = {
            {
                ["魔法"] = "椰子炮_范围魔法"
            }
        },
        ["可重复碰撞同一目标"] = false,
        ["对同一目标生效间隔"] = -1,
        ["生效次数"] = 1,
        ["魔法名"] = "椰子炮_入口",
        ["打印信息"] = true,
        ["显示在指令选单中"] = true,
        ["几率"] = 0,
        ["冷却"] = 2,
        ["各目标冷却"] = 0,
        ["基础威力"] = 1,
        ["释放给自己"] = false,
        ["延迟"] = 0,
        ["特效_释放"] = {
            {
                ["_type"] = "ParticleGraphic",
                ["特效对象"] = "特效/开火/椰子炮_开火",
                ["特效资产"] = "",
                ["绑定实体"] = true,
                ["绑定挂点"] = "",
                ["偏移"] = {
                    0,
                    0,
                    0
                },
                ["目标"] = "自己",
                ["目标场景名"] = "",
                ["延迟"] = 0,
                ["持续时间"] = 0,
                ["重复次数"] = 1,
                ["重复延迟"] = 0
            },
            {
                ["_type"] = "AnimationGraphic",
                ["播放动画"] = "attack",
                ["播放速度"] = 1,
                ["目标"] = "自己",
                ["目标场景名"] = "",
                ["延迟"] = 0,
                ["持续时间"] = 1,
                ["重复次数"] = 1,
                ["重复延迟"] = 0
            },
            {
                ["_type"] = "ParticleGraphic",
                ["特效对象"] = "特效/击中/爆炸_金色_带旋风",
                ["特效资产"] = "",
                ["绑定实体"] = false,
                ["绑定挂点"] = "",
                ["偏移"] = {
                    0,
                    0,
                    0
                },
                ["目标"] = "触发点",
                ["目标场景名"] = "",
                ["延迟"] = 0,
                ["持续时间"] = 1,
                ["重复次数"] = 1,
                ["重复延迟"] = 0
            },
            {
                ["_type"] = "SoundGraphic",
                ["声音资源"] = "sandboxId://soundeffect/大炮射击(cannon_shot)_爱给网_aigei_com.ogg",
                ["绑定实体"] = false,
                ["响度"] = 1,
                ["音调"] = 1,
                ["距离"] = {
                    600,
                    6000
                },
                ["仅播放给相关者"] = false,
                ["目标"] = "自己",
                ["目标场景名"] = "",
                ["延迟"] = 0,
                ["持续时间"] = 1,
                ["重复次数"] = 1,
                ["重复延迟"] = 0
            },
            {
                ["_type"] = "SoundGraphic",
                ["声音资源"] = "sandboxId://soundeffect/火爆辣椒_爱给网_aigei_com.mp3",
                ["绑定实体"] = false,
                ["响度"] = 1,
                ["音调"] = 1,
                ["距离"] = {
                    600,
                    6000
                },
                ["仅播放给相关者"] = false,
                ["目标"] = "触发点",
                ["目标场景名"] = "",
                ["延迟"] = 0,
                ["持续时间"] = 1,
                ["重复次数"] = 1,
                ["重复延迟"] = 0
            }
        },
        ["宽度倍率"] = 1,
        ["高度倍率"] = 1,
        ["尺寸倍率"] = 1,
        ["必须要目标"] = false
    }),
    ["椰子炮_范围伤害"] = Spell.Load({
        ["类型"] = "PainSpell",
        ["基础伤害"] = 0,
        ["基础倍率"] = 1,
        ["元素类型"] = "无",
        ["属性增伤"] = {
            {
                ["属性类型"] = "攻击",
                ["倍率"] = 2.5,
                ["增加类型"] = "增加",
                ["乘以基础数值"] = false
            }
        },
        ["仅造成仇恨"] = false,
        ["魔法名"] = "椰子炮_范围伤害",
        ["打印信息"] = true,
        ["显示在指令选单中"] = true,
        ["几率"] = 0,
        ["冷却"] = 0,
        ["各目标冷却"] = 0,
        ["基础威力"] = 1,
        ["释放给自己"] = false,
        ["延迟"] = 0,
        ["宽度倍率"] = 1,
        ["高度倍率"] = 1,
        ["尺寸倍率"] = 1,
        ["必须要目标"] = true
    }),
    ["椰子炮_范围魔法"] = Spell.Load({
        ["类型"] = "AOESpell",
        ["持续时间"] = 0,
        ["范围形状"] = "圆形",
        ["圆形半径"] = 400,
        ["偏移"] = {
            0,
            0,
            0
        },
        ["_previewLocation"] = nil,
        ["魔法名"] = "椰子炮_范围魔法",
        ["打印信息"] = true,
        ["显示在指令选单中"] = true,
        ["几率"] = 0,
        ["冷却"] = 0,
        ["各目标冷却"] = 0,
        ["基础威力"] = 1,
        ["释放给自己"] = false,
        ["延迟"] = 0,
        ["子魔法"] = {
            {
                ["魔法"] = "椰子炮_范围伤害"
            }
        },
        ["特效_释放"] = {
            {
                ["_type"] = "ParticleGraphic",
                ["特效对象"] = "紫红色爆炸",
                ["特效资产"] = "",
                ["绑定实体"] = false,
                ["绑定挂点"] = "",
                ["偏移"] = {
                    0,
                    0,
                    0
                },
                ["目标"] = "目标",
                ["目标场景名"] = "",
                ["延迟"] = 0,
                ["持续时间"] = 0,
                ["重复次数"] = 1,
                ["重复延迟"] = 0
            }
        },
        ["宽度倍率"] = 1,
        ["高度倍率"] = 1,
        ["尺寸倍率"] = 1,
        ["必须要目标"] = true
    }),
    ["副-火爆辣椒-飞弹-范围-伤害"] = Spell.Load({
        ["类型"] = "PainSpell",
        ["基础伤害"] = 400,
        ["基础倍率"] = 1,
        ["元素类型"] = "无",
        ["属性增伤"] = {
            {
                ["属性类型"] = "攻击",
                ["倍率"] = 2.2,
                ["增加类型"] = "倍率",
                ["乘以基础数值"] = false
            }
        },
        ["仅造成仇恨"] = false,
        ["魔法名"] = "副-火爆辣椒-飞弹-范围-伤害",
        ["打印信息"] = true,
        ["显示在指令选单中"] = true,
        ["几率"] = 0,
        ["冷却"] = 0,
        ["各目标冷却"] = 0,
        ["基础威力"] = 1,
        ["释放给自己"] = false,
        ["延迟"] = 0,
        ["宽度倍率"] = 1,
        ["高度倍率"] = 1,
        ["尺寸倍率"] = 1,
        ["必须要目标"] = true
    }),
    ["副-火爆辣椒-飞弹-范围"] = Spell.Load({
        ["类型"] = "AOESpell",
        ["持续时间"] = 0,
        ["范围形状"] = "圆形",
        ["圆形半径"] = 600,
        ["偏移"] = {
            0,
            0,
            0
        },
        ["_previewLocation"] = nil,
        ["魔法名"] = "副-火爆辣椒-飞弹-范围",
        ["打印信息"] = true,
        ["显示在指令选单中"] = true,
        ["几率"] = 0,
        ["冷却"] = 0,
        ["各目标冷却"] = 0,
        ["基础威力"] = 1,
        ["释放给自己"] = false,
        ["延迟"] = 0,
        ["子魔法"] = {
            {
                ["魔法"] = "副-火爆辣椒-飞弹-范围-伤害"
            },
            {
                ["魔法"] = "副-火爆辣椒_持续伤害"
            }
        },
        ["宽度倍率"] = 1,
        ["高度倍率"] = 1,
        ["尺寸倍率"] = 1,
        ["必须要目标"] = true
    }),
    ["副-火爆辣椒-飞弹"] = Spell.Load({
        ["类型"] = "ProjectileSpell",
        ["飞弹模型"] = "火爆辣椒",
        ["持续时间"] = 20,
        ["寻找目标"] = false,
        ["生成于自己位置"] = true,
        ["散射次数"] = 1,
        ["散射角度"] = 0,
        ["散射延迟"] = 0,
        ["初始角度修改"] = {
            45,
            0
        },
        ["发射位置偏移"] = {
            0,
            0,
            0
        },
        ["速度"] = 2000,
        ["重力"] = 0,
        ["追踪目标速度"] = 500,
        ["穿过地形"] = false,
        ["结束子魔法"] = {
            {
                ["魔法"] = "副-火爆辣椒-飞弹-范围"
            }
        },
        ["可重复碰撞同一目标"] = false,
        ["对同一目标生效间隔"] = -1,
        ["生效次数"] = 1,
        ["魔法名"] = "副-火爆辣椒-飞弹",
        ["打印信息"] = true,
        ["显示在指令选单中"] = true,
        ["几率"] = 0,
        ["冷却"] = 40,
        ["各目标冷却"] = 0,
        ["基础威力"] = 1,
        ["释放给自己"] = false,
        ["延迟"] = 0,
        ["特效_释放"] = {
            {
                ["_type"] = "AnimationGraphic",
                ["播放动画"] = "attack",
                ["播放速度"] = 1,
                ["目标"] = "自己",
                ["目标场景名"] = "",
                ["延迟"] = 0,
                ["持续时间"] = 0,
                ["重复次数"] = 1,
                ["重复延迟"] = 0
            },
            {
                ["_type"] = "ParticleGraphic",
                ["特效对象"] = "特效/击中/爆炸_深红_地面炸开燃烧地面",
                ["特效资产"] = "",
                ["绑定实体"] = false,
                ["绑定挂点"] = "",
                ["偏移"] = {
                    0,
                    0,
                    0
                },
                ["目标"] = "触发点",
                ["目标场景名"] = "",
                ["延迟"] = 0,
                ["持续时间"] = 1,
                ["重复次数"] = 1,
                ["重复延迟"] = 0
            },
            {
                ["_type"] = "SoundGraphic",
                ["声音资源"] = "sandboxId://soundeffect/火爆辣椒_爱给网_aigei_com.mp3",
                ["绑定实体"] = false,
                ["响度"] = 1,
                ["音调"] = 1,
                ["距离"] = {
                    600,
                    6000
                },
                ["仅播放给相关者"] = false,
                ["目标"] = "触发点",
                ["目标场景名"] = "",
                ["延迟"] = 0,
                ["持续时间"] = 1,
                ["重复次数"] = 1,
                ["重复延迟"] = 0
            },
            {
                ["_type"] = "SoundGraphic",
                ["声音资源"] = "sandboxId://soundeffect/throw[1~2].ogg",
                ["绑定实体"] = false,
                ["响度"] = 1,
                ["音调"] = 1,
                ["距离"] = {
                    600,
                    6000
                },
                ["仅播放给相关者"] = false,
                ["目标"] = "自己",
                ["目标场景名"] = "",
                ["延迟"] = 0,
                ["持续时间"] = 1,
                ["重复次数"] = 1,
                ["重复延迟"] = 0
            }
        },
        ["宽度倍率"] = 1,
        ["高度倍率"] = 1,
        ["尺寸倍率"] = 1,
        ["必须要目标"] = false
    }),
    ["副-火爆辣椒_持续伤害"] = Spell.Load({
        ["类型"] = "DOTBuff",
        ["基础伤害"] = 0,
        ["基础倍率"] = 1,
        ["属性增伤"] = {
            {
                ["属性类型"] = "攻击",
                ["倍率"] = 0.6,
                ["增加类型"] = "增加",
                ["乘以基础数值"] = false
            }
        },
        ["脉冲时间"] = 0.5,
        ["持续时间"] = 3,
        ["持续时间独立计算"] = false,
        ["重复释放刷新时间"] = true,
        ["生效次数"] = 0,
        ["最大层数"] = 0,
        ["无需更新"] = false,
        ["魔法名"] = "副-火爆辣椒_持续伤害",
        ["打印信息"] = false,
        ["显示在指令选单中"] = true,
        ["几率"] = 0,
        ["冷却"] = 0,
        ["各目标冷却"] = 0,
        ["基础威力"] = 1,
        ["释放给自己"] = false,
        ["延迟"] = 0,
        ["宽度倍率"] = 1,
        ["高度倍率"] = 1,
        ["尺寸倍率"] = 1,
        ["必须要目标"] = true
    }),
    ["副_召唤_辣椒投手"] = Spell.Load({
        ["类型"] = "SummonSpell",
        ["召唤在目标位置"] = true,
        ["怪物类型"] = "副-召唤物-辣椒投手",
        ["最大数量"] = 1,
        ["召唤范围"] = 100,
        ["持续时间"] = 40,
        ["继承等级"] = false,
        ["额外召唤物属性"] = {
            ["生命"] = {
                ["额外属性"] = "生命",
                ["属性增伤"] = {
                    ["属性类型"] = "生命",
                    ["倍率"] = 2,
                    ["增加类型"] = "增加",
                    ["乘以基础数值"] = false
                }
            },
            ["攻击"] = {
                ["额外属性"] = "攻击",
                ["属性增伤"] = {
                    ["属性类型"] = "攻击",
                    ["倍率"] = 0.4,
                    ["增加类型"] = "增加",
                    ["乘以基础数值"] = false
                }
            }
        },
        ["魔法名"] = "副_召唤_辣椒投手",
        ["打印信息"] = false,
        ["显示在指令选单中"] = true,
        ["几率"] = 0,
        ["冷却"] = 50,
        ["各目标冷却"] = 0,
        ["基础威力"] = 1,
        ["释放给自己"] = false,
        ["延迟"] = 0,
        ["特效_释放"] = {
            {
                ["_type"] = "SoundGraphic",
                ["声音资源"] = "sandboxId://soundeffect/plant放植物.ogg",
                ["绑定实体"] = false,
                ["响度"] = 1,
                ["音调"] = 1,
                ["距离"] = {
                    600,
                    6000
                },
                ["仅播放给相关者"] = false,
                ["目标"] = "目标",
                ["目标场景名"] = "",
                ["延迟"] = 0,
                ["持续时间"] = 1,
                ["重复次数"] = 1,
                ["重复延迟"] = 0
            }
        },
        ["宽度倍率"] = 1,
        ["高度倍率"] = 1,
        ["尺寸倍率"] = 1,
        ["必须要目标"] = true
    }),
    ["副_辣椒投手_入口"] = Spell.Load({
        ["类型"] = "ProjectileSpell",
        ["飞弹模型"] = "辣椒投手飞弹",
        ["持续时间"] = 10,
        ["寻找目标"] = false,
        ["生成于自己位置"] = true,
        ["散射次数"] = 1,
        ["散射角度"] = 0,
        ["散射延迟"] = 0,
        ["初始角度修改"] = {
            45,
            0
        },
        ["发射位置偏移"] = {
            0,
            234,
            -85
        },
        ["速度"] = 3000,
        ["重力"] = 0,
        ["追踪目标速度"] = 500,
        ["穿过地形"] = false,
        ["结束子魔法"] = {
            {
                ["魔法"] = "副_辣椒投手_范围魔法"
            }
        },
        ["可重复碰撞同一目标"] = false,
        ["对同一目标生效间隔"] = -1,
        ["生效次数"] = 1,
        ["魔法名"] = "副_辣椒投手_入口",
        ["打印信息"] = true,
        ["显示在指令选单中"] = true,
        ["几率"] = 0,
        ["冷却"] = 2,
        ["各目标冷却"] = 0,
        ["基础威力"] = 1,
        ["释放给自己"] = false,
        ["延迟"] = 0,
        ["特效_释放"] = {
            {
                ["_type"] = "AnimationGraphic",
                ["播放动画"] = "attack",
                ["播放速度"] = 1,
                ["目标"] = "自己",
                ["目标场景名"] = "",
                ["延迟"] = 0,
                ["持续时间"] = 0,
                ["重复次数"] = 1,
                ["重复延迟"] = 0
            },
            {
                ["_type"] = "ParticleGraphic",
                ["特效对象"] = "特效/击中/爆炸_黄色_火球炸开",
                ["特效资产"] = "",
                ["绑定实体"] = false,
                ["绑定挂点"] = "",
                ["偏移"] = {
                    0,
                    0,
                    0
                },
                ["目标"] = "触发点",
                ["目标场景名"] = "",
                ["延迟"] = 0,
                ["持续时间"] = 1,
                ["重复次数"] = 1,
                ["重复延迟"] = 0
            }
        },
        ["宽度倍率"] = 1,
        ["高度倍率"] = 1,
        ["尺寸倍率"] = 1,
        ["必须要目标"] = false
    }),
    ["副_辣椒投手_持续伤害"] = Spell.Load({
        ["类型"] = "DOTBuff",
        ["基础伤害"] = 0,
        ["基础倍率"] = 1,
        ["属性增伤"] = {
            {
                ["属性类型"] = "攻击",
                ["倍率"] = 0.6,
                ["增加类型"] = "增加",
                ["乘以基础数值"] = false
            }
        },
        ["脉冲时间"] = 0.5,
        ["持续时间"] = 3,
        ["持续时间独立计算"] = false,
        ["重复释放刷新时间"] = true,
        ["生效次数"] = 0,
        ["最大层数"] = 0,
        ["无需更新"] = false,
        ["魔法名"] = "副_辣椒投手_持续伤害",
        ["打印信息"] = false,
        ["显示在指令选单中"] = true,
        ["几率"] = 0,
        ["冷却"] = 0,
        ["各目标冷却"] = 0,
        ["基础威力"] = 1,
        ["释放给自己"] = false,
        ["延迟"] = 0,
        ["宽度倍率"] = 1,
        ["高度倍率"] = 1,
        ["尺寸倍率"] = 1,
        ["必须要目标"] = true
    }),
    ["副_辣椒投手_范围伤害"] = Spell.Load({
        ["类型"] = "PainSpell",
        ["基础伤害"] = 0,
        ["基础倍率"] = 1,
        ["元素类型"] = "无",
        ["属性增伤"] = {
            {
                ["属性类型"] = "攻击",
                ["倍率"] = 1,
                ["增加类型"] = "增加",
                ["乘以基础数值"] = false
            }
        },
        ["仅造成仇恨"] = false,
        ["魔法名"] = "副_辣椒投手_范围伤害",
        ["打印信息"] = false,
        ["显示在指令选单中"] = true,
        ["几率"] = 0,
        ["冷却"] = 0,
        ["各目标冷却"] = 0,
        ["基础威力"] = 1,
        ["释放给自己"] = false,
        ["延迟"] = 0,
        ["宽度倍率"] = 1,
        ["高度倍率"] = 1,
        ["尺寸倍率"] = 1,
        ["必须要目标"] = true
    }),
    ["副_辣椒投手_范围魔法"] = Spell.Load({
        ["类型"] = "AOESpell",
        ["持续时间"] = 0,
        ["范围形状"] = "圆形",
        ["圆形半径"] = 400,
        ["偏移"] = {
            0,
            0,
            0
        },
        ["_previewLocation"] = nil,
        ["魔法名"] = "副_辣椒投手_范围魔法",
        ["打印信息"] = false,
        ["显示在指令选单中"] = true,
        ["几率"] = 0,
        ["冷却"] = 0,
        ["各目标冷却"] = 0,
        ["基础威力"] = 1,
        ["释放给自己"] = false,
        ["延迟"] = 0,
        ["子魔法"] = {
            {
                ["魔法"] = "副_辣椒投手_范围伤害"
            },
            {
                ["魔法"] = "副_辣椒投手_持续伤害"
            }
        },
        ["宽度倍率"] = 1,
        ["高度倍率"] = 1,
        ["尺寸倍率"] = 1,
        ["必须要目标"] = true
    }),
    ["钢铁地刺_dot"] = Spell.Load({
        ["类型"] = "DOTBuffSpell",
        ["基础伤害"] = 0,
        ["基础倍率"] = 1,
        ["属性增伤"] = {
            {
                ["属性类型"] = "攻击",
                ["倍率"] = 3,
                ["增加类型"] = "增加",
                ["乘以基础数值"] = false
            }
        },
        ["脉冲时间"] = 0.1,
        ["持续时间"] = 5,
        ["持续时间独立计算"] = false,
        ["重复释放刷新时间"] = true,
        ["生效次数"] = 0,
        ["最大层数"] = 0,
        ["无需更新"] = false,
        ["魔法名"] = "钢铁地刺_dot",
        ["打印信息"] = false,
        ["显示在指令选单中"] = true,
        ["几率"] = 0,
        ["冷却"] = 0,
        ["各目标冷却"] = 0,
        ["基础威力"] = 1,
        ["释放给自己"] = false,
        ["延迟"] = 0,
        ["宽度倍率"] = 1,
        ["高度倍率"] = 1,
        ["尺寸倍率"] = 1,
        ["必须要目标"] = true
    }),
    ["钢铁地刺_脉冲"] = Spell.Load({
        ["类型"] = "AOESpell",
        ["持续时间"] = 30,
        ["可重复击中同一目标"] = false,
        ["击中间隔"] = 1,
        ["特效_持续"] = {
            {
                ["_type"] = "ParticleGraphic",
                ["特效对象"] = "怪物模型/植物/钢铁地刺",
                ["特效资产"] = "",
                ["绑定实体"] = false,
                ["绑定挂点"] = "",
                ["偏移"] = {
                    0,
                    0,
                    0
                },
                ["目标"] = "自己",
                ["目标场景名"] = "",
                ["延迟"] = 0,
                ["持续时间"] = 0,
                ["重复次数"] = 1,
                ["重复延迟"] = 0
            }
        },
        ["范围形状"] = "圆形",
        ["圆形半径"] = 0,
        ["偏移"] = {
            0,
            0,
            0
        },
        ["_previewLocation"] = nil,
        ["魔法名"] = "钢铁地刺_脉冲",
        ["打印信息"] = false,
        ["显示在指令选单中"] = true,
        ["几率"] = 0,
        ["冷却"] = 50,
        ["各目标冷却"] = 0,
        ["基础威力"] = 1,
        ["释放给自己"] = false,
        ["延迟"] = 0,
        ["子魔法"] = {
            {
                ["魔法"] = "钢铁地刺_dot"
            }
        },
        ["特效_释放"] = {
            {
                ["_type"] = "SoundGraphic",
                ["声音资源"] = "sandboxId://soundeffect/plant放植物.ogg",
                ["绑定实体"] = false,
                ["响度"] = 1,
                ["音调"] = 1,
                ["距离"] = {
                    600,
                    6000
                },
                ["仅播放给相关者"] = false,
                ["目标"] = "目标",
                ["目标场景名"] = "",
                ["延迟"] = 0,
                ["持续时间"] = 1,
                ["重复次数"] = 1,
                ["重复延迟"] = 0
            }
        },
        ["宽度倍率"] = 1,
        ["高度倍率"] = 1,
        ["尺寸倍率"] = 1,
        ["必须要目标"] = true
    }),
    ["副_召唤_星星果"] = Spell.Load({
        ["类型"] = "SummonSpell",
        ["召唤在目标位置"] = true,
        ["怪物类型"] = "副-召唤物-星星果",
        ["最大数量"] = 1,
        ["召唤范围"] = 100,
        ["持续时间"] = 10,
        ["继承等级"] = false,
        ["额外召唤物属性"] = {
            ["生命"] = {
                ["额外属性"] = "生命",
                ["属性增伤"] = {
                    ["属性类型"] = "生命",
                    ["倍率"] = 3,
                    ["增加类型"] = "增加",
                    ["乘以基础数值"] = false
                }
            },
            ["攻击"] = {
                ["额外属性"] = "攻击",
                ["属性增伤"] = {
                    ["属性类型"] = "攻击",
                    ["倍率"] = 0.8,
                    ["增加类型"] = "增加",
                    ["乘以基础数值"] = false
                }
            }
        },
        ["魔法名"] = "副_召唤_星星果",
        ["打印信息"] = false,
        ["显示在指令选单中"] = true,
        ["几率"] = 0,
        ["冷却"] = 40,
        ["各目标冷却"] = 0,
        ["基础威力"] = 1,
        ["释放给自己"] = false,
        ["延迟"] = 0,
        ["特效_释放"] = {
            {
                ["_type"] = "SoundGraphic",
                ["声音资源"] = "sandboxId://soundeffect/plant放植物.ogg",
                ["绑定实体"] = false,
                ["响度"] = 1,
                ["音调"] = 1,
                ["距离"] = {
                    600,
                    6000
                },
                ["仅播放给相关者"] = false,
                ["目标"] = "目标",
                ["目标场景名"] = "",
                ["延迟"] = 0,
                ["持续时间"] = 1,
                ["重复次数"] = 1,
                ["重复延迟"] = 0
            }
        },
        ["宽度倍率"] = 1,
        ["高度倍率"] = 1,
        ["尺寸倍率"] = 1,
        ["必须要目标"] = true
    }),
    ["副_星星果_伤害"] = Spell.Load({
        ["类型"] = "PainSpell",
        ["基础伤害"] = 0,
        ["基础倍率"] = 1,
        ["元素类型"] = "无",
        ["属性增伤"] = {
            {
                ["属性类型"] = "攻击",
                ["倍率"] = 0.35,
                ["增加类型"] = "增加",
                ["乘以基础数值"] = false
            }
        },
        ["仅造成仇恨"] = false,
        ["魔法名"] = "副_星星果_伤害",
        ["打印信息"] = false,
        ["显示在指令选单中"] = true,
        ["几率"] = 0,
        ["冷却"] = 0,
        ["各目标冷却"] = 0,
        ["基础威力"] = 1,
        ["释放给自己"] = false,
        ["延迟"] = 0,
        ["宽度倍率"] = 1,
        ["高度倍率"] = 1,
        ["尺寸倍率"] = 1,
        ["必须要目标"] = true
    }),
    ["副_星星果_入口"] = Spell.Load({
        ["类型"] = "ProjectileSpell",
        ["飞弹模型"] = "星星飞弹",
        ["持续时间"] = 5,
        ["寻找目标"] = false,
        ["生成于自己位置"] = true,
        ["散射次数"] = 5,
        ["散射角度"] = 72,
        ["散射延迟"] = 0,
        ["初始角度修改"] = {
            0,
            0
        },
        ["发射位置偏移"] = {
            0,
            0,
            0
        },
        ["速度"] = 5000,
        ["重力"] = 0,
        ["追踪目标速度"] = 0,
        ["穿过地形"] = false,
        ["可重复碰撞同一目标"] = false,
        ["对同一目标生效间隔"] = -1,
        ["生效次数"] = 1,
        ["魔法名"] = "副_星星果_入口",
        ["打印信息"] = true,
        ["显示在指令选单中"] = true,
        ["几率"] = 0,
        ["冷却"] = 1.5,
        ["各目标冷却"] = 0,
        ["基础威力"] = 1,
        ["释放给自己"] = false,
        ["延迟"] = 0,
        ["子魔法"] = {
            {
                ["魔法"] = "副_星星果_伤害"
            }
        },
        ["特效_释放"] = {
            {
                ["_type"] = "AnimationGraphic",
                ["播放动画"] = "attack",
                ["播放速度"] = 1,
                ["目标"] = "自己",
                ["目标场景名"] = "",
                ["延迟"] = 0,
                ["持续时间"] = 0,
                ["重复次数"] = 1,
                ["重复延迟"] = 0
            },
            {
                ["_type"] = "ParticleGraphic",
                ["特效对象"] = "特效/击中/爆炸_金色_带橘色小型",
                ["特效资产"] = "",
                ["绑定实体"] = false,
                ["绑定挂点"] = "",
                ["偏移"] = {
                    0,
                    0,
                    0
                },
                ["目标"] = "触发点",
                ["目标场景名"] = "",
                ["延迟"] = 0,
                ["持续时间"] = 1,
                ["重复次数"] = 1,
                ["重复延迟"] = 0
            },
            {
                ["_type"] = "SoundGraphic",
                ["声音资源"] = "sandboxId://soundeffect/snow_pea_sparkles星星飞弹飞行.ogg",
                ["绑定实体"] = false,
                ["响度"] = 1,
                ["音调"] = 1,
                ["距离"] = {
                    600,
                    6000
                },
                ["仅播放给相关者"] = false,
                ["目标"] = "自己",
                ["目标场景名"] = "",
                ["延迟"] = 0,
                ["持续时间"] = 1,
                ["重复次数"] = 1,
                ["重复延迟"] = 0
            },
            {
                ["_type"] = "SoundGraphic",
                ["声音资源"] = "sandboxId://soundeffect/splat2击中音效.ogg",
                ["绑定实体"] = false,
                ["响度"] = 1,
                ["音调"] = 1,
                ["距离"] = {
                    600,
                    6000
                },
                ["仅播放给相关者"] = false,
                ["目标"] = "触发点",
                ["目标场景名"] = "",
                ["延迟"] = 0,
                ["持续时间"] = 1,
                ["重复次数"] = 1,
                ["重复延迟"] = 0
            }
        },
        ["宽度倍率"] = 1,
        ["高度倍率"] = 1,
        ["尺寸倍率"] = 1,
        ["必须要目标"] = false
    }),
    ["副_窝瓜_范围伤害"] = Spell.Load({
        ["类型"] = "PainSpell",
        ["基础伤害"] = 0,
        ["基础倍率"] = 1,
        ["元素类型"] = "无",
        ["属性增伤"] = {
            {
                ["属性类型"] = "攻击",
                ["倍率"] = 3,
                ["增加类型"] = "增加",
                ["乘以基础数值"] = false
            }
        },
        ["仅造成仇恨"] = false,
        ["魔法名"] = "副_窝瓜_范围伤害",
        ["打印信息"] = false,
        ["显示在指令选单中"] = true,
        ["几率"] = 0,
        ["冷却"] = 0,
        ["各目标冷却"] = 0,
        ["基础威力"] = 1,
        ["释放给自己"] = false,
        ["延迟"] = 0,
        ["宽度倍率"] = 1,
        ["高度倍率"] = 1,
        ["尺寸倍率"] = 1,
        ["必须要目标"] = true
    }),
    ["副_窝瓜_范围魔法"] = Spell.Load({
        ["类型"] = "AOESpell",
        ["持续时间"] = 0,
        ["范围形状"] = "圆形",
        ["圆形半径"] = 800,
        ["偏移"] = {
            0,
            0,
            0
        },
        ["_previewLocation"] = nil,
        ["魔法名"] = "副_窝瓜_范围魔法",
        ["打印信息"] = false,
        ["显示在指令选单中"] = true,
        ["几率"] = 0,
        ["冷却"] = 60,
        ["各目标冷却"] = 0,
        ["基础威力"] = 1,
        ["释放给自己"] = false,
        ["延迟"] = 0,
        ["子魔法"] = {
            {
                ["魔法"] = "副_窝瓜_范围伤害"
            }
        },
        ["宽度倍率"] = 1,
        ["高度倍率"] = 1,
        ["尺寸倍率"] = 1,
        ["必须要目标"] = true
    }),
    ["副_窝瓜_飞弹"] = Spell.Load({
        ["类型"] = "ProjectileSpell",
        ["飞弹模型"] = "窝瓜",
        ["持续时间"] = 20,
        ["寻找目标"] = false,
        ["生成于自己位置"] = true,
        ["散射次数"] = 1,
        ["散射角度"] = 0,
        ["散射延迟"] = 0,
        ["初始角度修改"] = {
            45,
            0
        },
        ["发射位置偏移"] = {
            0,
            0,
            0
        },
        ["速度"] = 2000,
        ["重力"] = 0,
        ["追踪目标速度"] = 500,
        ["穿过地形"] = false,
        ["结束子魔法"] = {
            {
                ["魔法"] = "副_窝瓜_范围魔法"
            }
        },
        ["可重复碰撞同一目标"] = false,
        ["对同一目标生效间隔"] = -1,
        ["生效次数"] = 1,
        ["魔法名"] = "副_窝瓜_飞弹",
        ["打印信息"] = true,
        ["显示在指令选单中"] = true,
        ["几率"] = 0,
        ["冷却"] = 40,
        ["各目标冷却"] = 0,
        ["基础威力"] = 1,
        ["释放给自己"] = false,
        ["延迟"] = 0,
        ["特效_释放"] = {
            {
                ["_type"] = "AnimationGraphic",
                ["播放动画"] = "attack",
                ["播放速度"] = 1,
                ["目标"] = "自己",
                ["目标场景名"] = "",
                ["延迟"] = 0,
                ["持续时间"] = 0,
                ["重复次数"] = 1,
                ["重复延迟"] = 0
            },
            {
                ["_type"] = "ParticleGraphic",
                ["特效对象"] = "特效/击中/溅射_绿色_带烟雾和叶片飞开",
                ["特效资产"] = "",
                ["绑定实体"] = false,
                ["绑定挂点"] = "",
                ["偏移"] = {
                    0,
                    0,
                    0
                },
                ["目标"] = "触发点",
                ["目标场景名"] = "",
                ["延迟"] = 0,
                ["持续时间"] = 1,
                ["重复次数"] = 1,
                ["重复延迟"] = 0
            },
            {
                ["_type"] = "SoundGraphic",
                ["声音资源"] = "sandboxId://soundeffect/squash_hmm[1~2].ogg",
                ["绑定实体"] = false,
                ["响度"] = 1,
                ["音调"] = 1,
                ["距离"] = {
                    600,
                    6000
                },
                ["仅播放给相关者"] = false,
                ["目标"] = "自己",
                ["目标场景名"] = "",
                ["延迟"] = 0,
                ["持续时间"] = 1,
                ["重复次数"] = 1,
                ["重复延迟"] = 0
            },
            {
                ["_type"] = "SoundGraphic",
                ["声音资源"] = "sandboxId://soundeffect/砸地_爱给网_aigei_com.mp3",
                ["绑定实体"] = false,
                ["响度"] = 1,
                ["音调"] = 1,
                ["距离"] = {
                    600,
                    6000
                },
                ["仅播放给相关者"] = false,
                ["目标"] = "触发点",
                ["目标场景名"] = "",
                ["延迟"] = 0,
                ["持续时间"] = 1,
                ["重复次数"] = 1,
                ["重复延迟"] = 0
            },
            {
                ["_type"] = "SoundGraphic",
                ["声音资源"] = "sandboxId://soundeffect/throw[1~2].ogg",
                ["绑定实体"] = false,
                ["响度"] = 1,
                ["音调"] = 1,
                ["距离"] = {
                    600,
                    6000
                },
                ["仅播放给相关者"] = false,
                ["目标"] = "自己",
                ["目标场景名"] = "",
                ["延迟"] = 0,
                ["持续时间"] = 1,
                ["重复次数"] = 1,
                ["重复延迟"] = 0
            }
        },
        ["宽度倍率"] = 1,
        ["高度倍率"] = 1,
        ["尺寸倍率"] = 1,
        ["必须要目标"] = false
    }),
    ["副_召唤_魅惑菇"] = Spell.Load({
        ["类型"] = "SummonSpell",
        ["召唤在目标位置"] = true,
        ["怪物类型"] = "副-召唤物-魅惑菇",
        ["最大数量"] = 1,
        ["召唤范围"] = 100,
        ["持续时间"] = 0,
        ["继承等级"] = false,
        ["额外召唤物属性"] = {
            ["生命"] = {
                ["额外属性"] = "生命",
                ["属性增伤"] = {
                    ["倍率"] = 1,
                    ["增加类型"] = "增加",
                    ["乘以基础数值"] = false
                }
            },
            ["攻击"] = {
                ["额外属性"] = "攻击",
                ["属性增伤"] = {
                    ["属性类型"] = "攻击",
                    ["倍率"] = 10,
                    ["增加类型"] = "增加",
                    ["乘以基础数值"] = false
                }
            }
        },
        ["魔法名"] = "副_召唤_魅惑菇",
        ["打印信息"] = false,
        ["显示在指令选单中"] = true,
        ["几率"] = 0,
        ["冷却"] = 60,
        ["各目标冷却"] = 0,
        ["基础威力"] = 1,
        ["释放给自己"] = false,
        ["延迟"] = 0,
        ["特效_释放"] = {
            {
                ["_type"] = "SoundGraphic",
                ["声音资源"] = "sandboxId://soundeffect/plant放植物.ogg",
                ["绑定实体"] = false,
                ["响度"] = 1,
                ["音调"] = 1,
                ["距离"] = {
                    600,
                    6000
                },
                ["仅播放给相关者"] = false,
                ["目标"] = "目标",
                ["目标场景名"] = "",
                ["延迟"] = 0,
                ["持续时间"] = 1,
                ["重复次数"] = 1,
                ["重复延迟"] = 0
            }
        },
        ["宽度倍率"] = 1,
        ["高度倍率"] = 1,
        ["尺寸倍率"] = 1,
        ["必须要目标"] = true
    }),
    ["提示退出按钮"] = Spell.Load({
        ["类型"] = "CommandSpell",
        ["指令"] = {
            [[focusOn {"聚焦UI":{"聚焦UI":[{"UI名":"AfkHud","控件路径":"挂机底图/退出按钮","提示文本":"你正在吸收阳光！\\n点击这里可以退出挂机状态","可点击任意位置":false,"PC端特殊处理":false,"若是PC端则改为":{"UI名":"","控件路径":"","提示文本":"","可点击任意位置":false}}],"完成时执行指令":[]}} ]],
            [[var {"操作":"改为","变量名":"has_guajied","值":"1"} ]]
        },
        ["魔法名"] = "提示退出按钮",
        ["打印信息"] = false,
        ["显示在指令选单中"] = true,
        ["几率"] = 0,
        ["冷却"] = 0,
        ["各目标冷却"] = 0,
        ["基础威力"] = 1,
        ["释放给自己"] = true,
        ["延迟"] = 0,
        ["释放条件"] = Modifiers.New({
            {
                ["目标"] = "自己",
                ["条件类型"] = "VariableCondition",
                ["条件"] = {
                    ["名字"] = "has_guajied",
                    ["最小值"] = 0,
                    ["最大值"] = 0
                },
                ["动作"] = "必须"
            }
        }),
        ["宽度倍率"] = 1,
        ["高度倍率"] = 1,
        ["尺寸倍率"] = 1,
        ["必须要目标"] = true
    }),
    ["基金卡每日变量"] = Spell.Load({
        ["类型"] = "CommandSpell",
        ["指令"] = {
            [[var {"操作":"减少","变量名":"基金卡","值":"1"} ]]
        },
        ["魔法名"] = "基金卡每日变量",
        ["打印信息"] = false,
        ["显示在指令选单中"] = true,
        ["几率"] = 0,
        ["冷却"] = 0,
        ["各目标冷却"] = 0,
        ["基础威力"] = 1,
        ["释放给自己"] = true,
        ["延迟"] = 0,
        ["宽度倍率"] = 1,
        ["高度倍率"] = 1,
        ["尺寸倍率"] = 1,
        ["必须要目标"] = true
    }),
    ["基金卡每日领取SR碎片"] = Spell.Load({
        ["类型"] = "ItemSpell",
        ["物品类型"] = "SR碎片",
        ["基础数量"] = 3,
        ["基础倍率"] = 1,
        ["向附近广播获得物品"] = false,
        ["魔法名"] = "基金卡每日领取SR碎片",
        ["打印信息"] = false,
        ["显示在指令选单中"] = true,
        ["几率"] = 0,
        ["冷却"] = 0,
        ["各目标冷却"] = 0,
        ["基础威力"] = 1,
        ["释放给自己"] = true,
        ["延迟"] = 0,
        ["宽度倍率"] = 1,
        ["高度倍率"] = 1,
        ["尺寸倍率"] = 1,
        ["必须要目标"] = true
    }),
    ["基金卡每日领取金币"] = Spell.Load({
        ["类型"] = "ItemSpell",
        ["物品类型"] = "金币",
        ["基础数量"] = 540,
        ["基础倍率"] = 1,
        ["向附近广播获得物品"] = false,
        ["魔法名"] = "基金卡每日领取金币",
        ["打印信息"] = false,
        ["显示在指令选单中"] = true,
        ["几率"] = 0,
        ["冷却"] = 0,
        ["各目标冷却"] = 0,
        ["基础威力"] = 1,
        ["释放给自己"] = true,
        ["延迟"] = 0,
        ["宽度倍率"] = 1,
        ["高度倍率"] = 1,
        ["尺寸倍率"] = 1,
        ["必须要目标"] = true
    }),
    ["基金卡每日领取阳光"] = Spell.Load({
        ["类型"] = "ItemSpell",
        ["物品类型"] = "阳光",
        ["基础数量"] = 50000,
        ["基础倍率"] = 1,
        ["向附近广播获得物品"] = false,
        ["魔法名"] = "基金卡每日领取阳光",
        ["打印信息"] = false,
        ["显示在指令选单中"] = true,
        ["几率"] = 0,
        ["冷却"] = 0,
        ["各目标冷却"] = 0,
        ["基础威力"] = 1,
        ["释放给自己"] = true,
        ["延迟"] = 0,
        ["宽度倍率"] = 1,
        ["高度倍率"] = 1,
        ["尺寸倍率"] = 1,
        ["必须要目标"] = true
    }),
    ["基金卡特权"] = Spell.Load({
        ["类型"] = "MultiSpell",
        ["随机顺序"] = false,
        ["释放个数"] = 999,
        ["组合技"] = false,
        ["魔法名"] = "基金卡特权",
        ["打印信息"] = false,
        ["显示在指令选单中"] = true,
        ["几率"] = 0,
        ["冷却"] = 0,
        ["各目标冷却"] = 0,
        ["基础威力"] = 1,
        ["释放给自己"] = true,
        ["延迟"] = 0,
        ["释放条件"] = Modifiers.New({
            {
                ["目标"] = "自己",
                ["条件类型"] = "VariableCondition",
                ["条件"] = {
                    ["名字"] = "基金卡",
                    ["最小值"] = 0,
                    ["最大值"] = 0
                },
                ["动作"] = "拒绝"
            }
        }),
        ["子魔法"] = {
            {
                ["魔法"] = "基金卡每日领取阳光"
            },
            {
                ["魔法"] = "基金卡每日领取金币"
            },
            {
                ["魔法"] = "基金卡每日领取SR碎片"
            },
            {
                ["魔法"] = "基金卡每日变量"
            }
        },
        ["宽度倍率"] = 1,
        ["高度倍率"] = 1,
        ["尺寸倍率"] = 1,
        ["必须要目标"] = true
    }),
    ["特权卡每日变量"] = Spell.Load({
        ["类型"] = "CommandSpell",
        ["指令"] = {
            [[var {"操作":"减少","变量名":"特权卡","值":"1"} ]]
        },
        ["魔法名"] = "特权卡每日变量",
        ["打印信息"] = false,
        ["显示在指令选单中"] = true,
        ["几率"] = 0,
        ["冷却"] = 0,
        ["各目标冷却"] = 0,
        ["基础威力"] = 1,
        ["释放给自己"] = true,
        ["延迟"] = 0,
        ["宽度倍率"] = 1,
        ["高度倍率"] = 1,
        ["尺寸倍率"] = 1,
        ["必须要目标"] = true
    }),
    ["特权卡每日领取能量豆"] = Spell.Load({
        ["类型"] = "ItemSpell",
        ["物品类型"] = "能量豆",
        ["基础数量"] = 2,
        ["基础倍率"] = 1,
        ["向附近广播获得物品"] = false,
        ["魔法名"] = "特权卡每日领取能量豆",
        ["打印信息"] = false,
        ["显示在指令选单中"] = true,
        ["几率"] = 0,
        ["冷却"] = 0,
        ["各目标冷却"] = 0,
        ["基础威力"] = 1,
        ["释放给自己"] = true,
        ["延迟"] = 0,
        ["宽度倍率"] = 1,
        ["高度倍率"] = 1,
        ["尺寸倍率"] = 1,
        ["必须要目标"] = true
    }),
    ["特权卡特权"] = Spell.Load({
        ["类型"] = "MultiSpell",
        ["随机顺序"] = false,
        ["释放个数"] = 999,
        ["组合技"] = false,
        ["魔法名"] = "特权卡特权",
        ["打印信息"] = false,
        ["显示在指令选单中"] = true,
        ["几率"] = 0,
        ["冷却"] = 0,
        ["各目标冷却"] = 0,
        ["基础威力"] = 1,
        ["释放给自己"] = true,
        ["延迟"] = 0,
        ["释放条件"] = Modifiers.New({
            {
                ["目标"] = "自己",
                ["条件类型"] = "VariableCondition",
                ["条件"] = {
                    ["名字"] = "特权卡",
                    ["最小值"] = 0,
                    ["最大值"] = 0
                },
                ["动作"] = "拒绝"
            }
        }),
        ["子魔法"] = {
            {
                ["魔法"] = "特权卡每日变量"
            },
            {
                ["魔法"] = "特权卡每日领取能量豆"
            }
        },
        ["宽度倍率"] = 1,
        ["高度倍率"] = 1,
        ["尺寸倍率"] = 1,
        ["必须要目标"] = true
    }),
    ["伤害魔法"] = Spell.Load({
        ["类型"] = "PainSpell",
        ["基础伤害"] = 50,
        ["基础倍率"] = 1,
        ["元素类型"] = "无",
        ["仅造成仇恨"] = false,
        ["魔法名"] = "伤害魔法",
        ["打印信息"] = true,
        ["显示在指令选单中"] = true,
        ["几率"] = 0,
        ["冷却"] = 0,
        ["各目标冷却"] = 0,
        ["基础威力"] = 1,
        ["释放给自己"] = true,
        ["延迟"] = 0,
        ["宽度倍率"] = 1,
        ["高度倍率"] = 1,
        ["尺寸倍率"] = 1,
        ["必须要目标"] = true
    }),
    ["中毒BUFF"] = Spell.Load({
        ["类型"] = "DOTBuff",
        ["基础伤害"] = 0,
        ["基础倍率"] = 1,
        ["脉冲时间"] = 0,
        ["持续时间"] = 0,
        ["持续时间独立计算"] = false,
        ["重复释放刷新时间"] = true,
        ["生效次数"] = 0,
        ["最大层数"] = 0,
        ["无需更新"] = false,
        ["魔法名"] = "中毒BUFF",
        ["打印信息"] = false,
        ["显示在指令选单中"] = true,
        ["几率"] = 0,
        ["冷却"] = 0,
        ["各目标冷却"] = 0,
        ["基础威力"] = 1,
        ["释放给自己"] = false,
        ["延迟"] = 0,
        ["宽度倍率"] = 1,
        ["高度倍率"] = 1,
        ["尺寸倍率"] = 1,
        ["必须要目标"] = true
    }),
    ["冰冻BUFF"] = Spell.Load({
        ["类型"] = "AttributeBuffSpell",
        ["属性类型"] = "速度",
        ["属性值"] = -100,
        ["百分比"] = true,
        ["持续时间"] = 1,
        ["持续时间独立计算"] = false,
        ["重复释放刷新时间"] = true,
        ["生效次数"] = 0,
        ["最大层数"] = 0,
        ["无需更新"] = false,
        ["魔法名"] = "冰冻BUFF",
        ["打印信息"] = false,
        ["显示在指令选单中"] = true,
        ["几率"] = 0,
        ["冷却"] = 30,
        ["各目标冷却"] = 0,
        ["基础威力"] = 1,
        ["释放给自己"] = false,
        ["延迟"] = 0,
        ["宽度倍率"] = 1,
        ["高度倍率"] = 1,
        ["尺寸倍率"] = 1,
        ["必须要目标"] = true
    }),
    ["减速BUFF"] = Spell.Load({
        ["类型"] = "AttributeBuffSpell",
        ["属性类型"] = "速度",
        ["属性值"] = -50,
        ["百分比"] = true,
        ["持续时间"] = 1,
        ["持续时间独立计算"] = false,
        ["重复释放刷新时间"] = true,
        ["生效次数"] = 0,
        ["最大层数"] = 0,
        ["无需更新"] = false,
        ["魔法名"] = "减速BUFF",
        ["打印信息"] = false,
        ["显示在指令选单中"] = true,
        ["几率"] = 0,
        ["冷却"] = 0,
        ["各目标冷却"] = 0,
        ["基础威力"] = 1,
        ["释放给自己"] = false,
        ["延迟"] = 0,
        ["宽度倍率"] = 1,
        ["高度倍率"] = 1,
        ["尺寸倍率"] = 1,
        ["必须要目标"] = true
    }),
    ["灼烧BUFF"] = Spell.Load({
        ["类型"] = "DOTBuff",
        ["基础伤害"] = 10,
        ["基础倍率"] = 1,
        ["属性增伤"] = {
            {
                ["属性类型"] = "攻击",
                ["倍率"] = 1,
                ["增加类型"] = "增加",
                ["乘以基础数值"] = false
            }
        },
        ["脉冲时间"] = 0,
        ["持续时间"] = 0,
        ["持续时间独立计算"] = false,
        ["重复释放刷新时间"] = true,
        ["生效次数"] = 0,
        ["最大层数"] = 0,
        ["无需更新"] = false,
        ["魔法名"] = "灼烧BUFF",
        ["打印信息"] = false,
        ["显示在指令选单中"] = true,
        ["注释"] = "火系异常状态",
        ["几率"] = 0,
        ["冷却"] = 0,
        ["各目标冷却"] = 0,
        ["基础威力"] = 1,
        ["释放给自己"] = false,
        ["延迟"] = 0,
        ["宽度倍率"] = 1,
        ["高度倍率"] = 1,
        ["尺寸倍率"] = 1,
        ["必须要目标"] = true
    }),
    ["挂机获得阳光"] = Spell.Load({
        ["类型"] = "ItemSpell",
        ["物品类型"] = "阳光",
        ["基础数量"] = 1,
        ["基础倍率"] = 1,
        ["向附近广播获得物品"] = true,
        ["魔法名"] = "挂机获得阳光",
        ["打印信息"] = false,
        ["显示在指令选单中"] = true,
        ["几率"] = 0,
        ["冷却"] = 0,
        ["各目标冷却"] = 0,
        ["基础威力"] = 1,
        ["释放给自己"] = true,
        ["延迟"] = 0,
        ["释放条件"] = Modifiers.New({
            {
                ["目标"] = "自己",
                ["条件类型"] = "ChanceCondition",
                ["条件"] = {
                    ["最小值"] = 100
                },
                ["动作"] = "威力乘以",
                ["数量"] = "1+[每秒收益_挂机]"
            },
            {
                ["目标"] = "自己",
                ["条件类型"] = "VariableCondition",
                ["条件"] = {
                    ["名字"] = "online_time",
                    ["最小值"] = 7200,
                    ["最大值"] = 86400
                },
                ["动作"] = "威力乘以",
                ["数量"] = "0.5"
            },
            {
                ["目标"] = "自己",
                ["条件类型"] = "VariableCondition",
                ["条件"] = {
                    ["名字"] = "online_time",
                    ["最小值"] = 14401,
                    ["最大值"] = 86400
                },
                ["动作"] = "威力乘以",
                ["数量"] = "0.5"
            },
            {
                ["目标"] = "自己",
                ["条件类型"] = "VariableCondition",
                ["条件"] = {
                    ["名字"] = "online_time",
                    ["最小值"] = 21601,
                    ["最大值"] = 86400
                },
                ["动作"] = "威力乘以",
                ["数量"] = "0.5"
            },
            {
                ["目标"] = "自己",
                ["条件类型"] = "VariableCondition",
                ["条件"] = {
                    ["名字"] = "online_time",
                    ["最小值"] = 28801,
                    ["最大值"] = 86400
                },
                ["动作"] = "威力乘以",
                ["数量"] = "0.5"
            },
            {
                ["目标"] = "自己",
                ["条件类型"] = "VariableCondition",
                ["条件"] = {
                    ["名字"] = "online_time",
                    ["最小值"] = 36001,
                    ["最大值"] = 86400
                },
                ["动作"] = "威力乘以",
                ["数量"] = "0.5"
            },
            {
                ["目标"] = "自己",
                ["条件类型"] = "VariableCondition",
                ["条件"] = {
                    ["名字"] = "online_time",
                    ["最小值"] = 43200,
                    ["最大值"] = 86400
                },
                ["动作"] = "威力乘以",
                ["数量"] = "0.5"
            }
        }),
        ["特效_释放"] = {
            {
                ["_type"] = "SoundGraphic",
                ["声音资源"] = "sandboxId://soundeffect/sun[1~4].ogg",
                ["绑定实体"] = false,
                ["响度"] = 0.46,
                ["音调"] = 1,
                ["距离"] = {
                    600,
                    6000
                },
                ["仅播放给相关者"] = true,
                ["目标"] = "自己",
                ["目标场景名"] = "",
                ["延迟"] = 0,
                ["持续时间"] = 1,
                ["重复次数"] = 1,
                ["重复延迟"] = 0
            }
        },
        ["宽度倍率"] = 1,
        ["高度倍率"] = 1,
        ["尺寸倍率"] = 1,
        ["必须要目标"] = true
    })
}loaded = true
end

---@param spellName string
---@return Spell
function SpellConfig.Get(spellName)
    if not loaded then
        LoadConfig()
    end
    return SpellConfig.config[spellName]
end

---@return Spell[]
function SpellConfig.GetAll()
    if not loaded then
        LoadConfig()
    end
    return SpellConfig.config
end
return SpellConfig
